[{"title": "Why Weak College Guys Have Megyn Worried About the Future of Mankind: “Who are the young, college girls going to sleep with? Because they’ve run out of real men.”", "description": "", "comments": ["life pro tip, never listen to anybody who tries to decide what makes a \"real man\"", "I have degrees and 5 combat tours.  Education and masculinity don't need to be mutually exclusive.", "Real men have alao run out of real women.", "Lmao, has she seen college girls these days? No wonder the guys don't want them.", "Uh, the new \"Conservative\" fear is that 19 year old girls won't have enough college guys to have casual sex with? Okay..."]}, {"title": "Federal Judge Has Bad News for Hunter Biden, Says There’s Zero Evidence His Charges Are Politically Motivated", "description": "", "comments": []}, {"title": "Happy Resurrection Day!", "description": "", "comments": []}, {"title": "Antisemitism Goes Hand-in-Hand With Societal Decay", "description": "", "comments": ["I would say having a completely corrupted government who hates their own citizens does a lot more to decay society. "]}, {"title": "Judge's Daughter Linked to Democrats Raising $93 Million Amid Trump Trial, Recusal Calls Intensify", "description": "", "comments": []}, {"title": "Damage Control: Now Biden Wishes Christians a Happy Easter", "description": "", "comments": ["I can’t remember if that was last year or two years ago when the Easter bunny had to redirect Biden because he got lost in front of the White House.", "Too late, asshole.  Christians received and understood your message, as intended, loud and clear, and we will be voting accordingly in November.", "With a bunny. Meanwhile, the Whitehouse has told the kids making designs for the Easter Egg Roll that no religious symbols or words are allowed.", "The resident is a sick POS", "**Shit stain back pedaling as fast as he can**"]}, {"title": "3 months and 28 days: Leftist events clog calendar as White House faces backlash over Easter announcement", "description": "", "comments": ["He deserves it."]}, {"title": "It kinda makes sense", "description": "", "comments": []}, {"title": "Disney-DeSantis settlement humiliates past pro-Disney headlines: Media 'as usual' were wrong", "description": "", "comments": []}, {"title": "Who is burning books now, left?", "description": "", "comments": ["Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*", "I am going to council caution on this story.    There is a lot of local scuttlebutt and some circumstantial evidence that a certain local \"firebrand\" pastor may be behind this to generate attention for his own cause.   There have been other vandalism incidents where conveniently that day was the only day none of his security cameras were  working.      \n\n\nWhile there is an obvious attack on Christianity happening these days, I am not convinced this particular one is genuine.   I will wait for more facts.\n\nI recommend the same for you.", "Why is there a trailer full of bibles?  Truck, van, covered trailer makes more sense."]}, {"title": "Archbishop Carlo Maria Viganò calls for the excommunication of Joe Biden from the Catholic Church after Biden Proclaimed Easter Sunday Transgender Visibility Day.", "description": "", "comments": ["Do it; stop talking about it. Ex-communicate him."]}, {"title": "CNBC: Voters Want Trump to Combat Runaway Inflation", "description": "", "comments": ["I think this is the main issue drawing independents and swing voters to Trump.", "Unlike Biden, the Donald understands basic math, economics AND he’s financially literate. Find me one Dem who can say the same on any of those, I’ll wait.\n\n**Bidenomics** lolol"]}, {"title": "Forget Mike Johnson: Why would ANY Republican want to be House speaker?", "description": "", "comments": ["I'm just as enthusiastic about swamp-draining as the next conservative....but Rome wasn't built in a day....and the dysfunction on the Republican side of the House is becoming increasingly glaring. A half dozen arch-conservatives with an implacable hostility to virtually *any* legislative agenda save their own narrow vision might just help derail our election prospects in November.", "Can't be that hard if you at least try to not sell out the people who put you there... ", "So you too can get impeached by mostly democrats voting with a few disgruntled republicans!\n\nOh wait...", "If they had an ounce of patriotism or service to their country. Anyone in the Freedom Caucus would be proud to serve.\n\nLet the shills cry and give it to us then."]}, {"title": "Trump claims Mexico’s demands are proof of ‘lack of respect’ for Biden - Washington Examiner", "description": "", "comments": []}, {"title": "‘It’s All Propaganda’: GOP Senator Says Trump’s VP Pick Will Be A Surprise", "description": "[deleted]", "comments": ["I’ve said for a long time it’s going to be a dark horse candidate. The majority of people had never even heard of or seen Mike pence before he was selected. That was strategic and we’re going to see it happen again.", "He'll name Eric Trump to be VP.", "Wingnut for VP?  Crazy times…"]}, {"title": "Trump PAC Creates 'Biden-Mart' Grocery Store, Shows You Mind-Blowing Price Hikes Since 2021", "description": "", "comments": ["But I thought inflation was transitory….", "[removed]"]}, {"title": "Trump Responds to Mexican President's 'List of Demands' to Joe Biden", "description": "", "comments": []}, {"title": "Pro-Palestinian protesters interrupt Easter Vigil service at St. Patrick's Cathedral in NYC", "description": "", "comments": ["♫ Try that in a small synagogue ♪♫♬"]}, {"title": "The man who caused the 2008 financial collapse that hurt millions of Americans is given a $10 million bond, while the man that had ZERO victims and hurt no one was given a $455 million bind. It makes no sense!", "description": "", "comments": ["Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*", "Madoff didn't cause the financial collapse. He was the biggest fraudster in history, probably, but that scheme didn't move the needle on the worldwide economy.", "Bernie Madoff didn’t cause the 08 collapse, greedy banks did.", "Well, I think I Madoff was a federal prosecution.", "Good lord is this a lot of incorrect information in one post. Do better, OP. \n\nBernie Madoff (who, I always enjoy mentioning, was a prolific democratic donor) had nothing to do with the financial collapse. Also, release bail and an appeal bond against a judgement are not remotely the same thing."]}, {"title": "Who Put Marjorie Taylor Greene In Charge?", "description": "", "comments": ["Leadership is a rare thing among Congress these days", "Her constituents then House leadership.", "She is another fan of fake it till you make it, only problem is no one else is stepping up  point out how to do it right.", "Conservatives", "She is the \"leader\" the maga deserve."]}, {"title": "“I’m tired of deleting death threats”: Claudia Sahm on the inconvenient truth about America’s economy - Americans have never had it so good, but they refuse to admit it", "description": "", "comments": ["So she is saying we are gaslighting ourselves?", "Two years ago I paid $5 to $7 for a rib steak. Today a rib steak costs about $12 to $28.\n\nI have to ration gas. \n\nCan't afford to eat out.\n\nI was doing great under Trump.", "I just paid $18 for a hamburger, fries, cup of chili, and a drink. Doesn't feel so good lol."]}, {"title": "Dem clients of daughter of judge in Trump trial raised $90M off case", "description": "", "comments": []}, {"title": "Yes, Michael Bitchless, that's EXACTLY what you're supposed to do... ", "description": "[removed]", "comments": []}, {"title": "Protesters screaming 'Free Palestine' ambush Easter Vigil at St Patrick's Cathedral", "description": "", "comments": ["Someone is going to end up with a broken nose."]}, {"title": "El Paso Judge Releases Migrants Accused in Border Stampede on Easter Sunday", "description": "", "comments": []}, {"title": "'Rain tax' in Canada? Toronto faces anger over tax plan", "description": "", "comments": []}, {"title": "Bidenomics in action.", "description": "", "comments": []}, {"title": "I'll keep it.", "description": "", "comments": ["This is great and all but we should focus on keeping this a sub dedicated to discussion about conservative politics and their importance to American Liberty."]}, {"title": "How to Explain the World Economic Forum’s Agenda to Idiots.", "description": "", "comments": []}, {"title": "Where is tha MONEY🤣🤣🤣 ???", "description": "", "comments": ["Why is this a gif?", "Didn't he also give out a stimulus package as President during Covid? Everyone dubbed them Biden Bucks?", "Bud, congressional republicans block him giving money to Americans. The only thing our politicians agree on is that we are less important than Ukrainians."]}, {"title": "Statement from President Joe Biden on Easter", "description": "", "comments": ["Making sure this was overshadowed by the trans visibility statement so we know the order of importance to them.", "Good for him for saying at least this much.  Hopefully it was sincere and from his heart."]}, {"title": "Fury as FDNY firefighters are forced to remove Stars and Stripes honoring 9/11 heroes after Democrat lawmaker branded it a 'fascist symbol'", "description": "", "comments": ["So, per the article, some rando complains to the city council about the flag. A staffer for a city council person then reached out to the fire department and asked if that breaks any rules (which is what they should do). When it turns out that it does break *a fire department* ban on *any* modified American flag, they’re told to take it down. In the end, the ban is lifted and the flag stays. \n\nSeems like everyone did their job right here? Doesn’t matter where you are on the political spectrum, someone is gonna be a pissed about something and this time it actually went through the steps and was resolved. \n\nAlso that headline is pretty disingenuous.", "It’s interesting that no one seems to even know that desecrating the US flag is illegal and disrespectful. But the Russian bots like to start crap."]}, {"title": "Kennedy Eyes Libertarian Lifeline in Ballot Battle Bonanza", "description": "As someone who considers himself a libertarian conservative, I’m not sure what benefit the libertarian party sees ( other than using RFK as a place holder since it doesn’t have its own candidate this year) in giving it’s election spot to a candidate who has just chosen an extreme Leftist who is opposed to almost everything true libertarians stand for!??\n\nThis makes little sense.\n\nAs a libertarian…I will never support a ticket with a hard core leftist on it!!\n\nThese almost guarantees that RFK pulls a LOT more votes from Biden than Trump.", "comments": ["RFK is not right-leaning or libertarian at all… what on earth?", "His VP pick was the obvious attempt to attract more left wing voters and/or repel more right, while the libertarian party is less of a sure thing and seems more a means of getting more support since he may struggle to end up on enough ballots otherwise.\n\nLibertarians are quite repulsive to pro welfare state economically left, but they have some appeal to socially liberal left and certain single issue voters like the pro gun and/or legal weed crowds.\n\nAt the same time, they appeal to the economically right who aren't socially conservative. But... Trump himself fits that bill to an extent. He is not remotely plausible as a compassionate/Christian social conservative, and his foreign policy leans isolationist as is often preferred by libertarians.\n\nI'm not sure how many of each type there are and to what extent they lean dem/rep this election, but we'd need some sense of that to judge how this influence the votes RFK pulls.\n\nGenerally it seems like third parties tend to favor Republicans by pulling from democrats, but it's harder to say with libertarians specifically."]}, {"title": "Navy makes shocking aircraft carrier decision while China threat rises", "description": "", "comments": ["This author leaves out a lot of vital context.  \n\nI am a big proponent of keeping our military fully funded and I think it's a mistake to delay production of the new carriers.  The works is a far more stable and safer place when the United states has a military of overwhelming capabilities.  We want our military to be stronger and more advanced than all of our adversaries combined. \n\nThat said the context that's missing in this article is\n1. these 2 new carriers were slated to replace carriers that are still in service and still far more powerful and advanced than anything China (or anyone else)  has. \n\n2. The carriers China has are not true carriers.  They are what is called jump carriers, sometimes referred to as mini carriers. They are much shorter in design and their flight deck is built with a sloped ramp to get aircraft air borne. Because of these design differences they only hold a small portion of the aircraft.  I believe it is 17 combat fighters. In comparison our old carriers that are slated to be replaced hold 90. The new ford class holds 137. 1 of our old ones equals over 4 of theirs in capability without even considering how much more technologically advanced or farther and fighter craft are. The f22 is virtually invisible on radar with a cross section of less than .0001/square meters.  That's smaller than a bubble bee. They can not be shot down with guided munitions.  Line of sight spray and pray is their only risk.   The fuijan will be China first true carrier and while that is a threat to be taken seriously, they don't have the anything comparably to the f22 to stick on it. It's going to be armed with technologically outdated fighters.  \n\n3. In contrast to China, the United states currently has 11 true fleet carriers. 10 Nimitz class and 1 ford class. And not just the carriers, but entire carrier strike groups comprised of over a dozen war ships and several dozen support ships. In addition to the fleet carter's we have an additional 10+ light carriers. \n\nIn conclusion, while on the surface it is concerning to see China investing to expand their military capabilities while we show down our plans to update our fleet, we don't need to freak out.  The difference between the militaries is like comparing a random high school jv team to the Dallas cowboys of the early 90s, 49ers of the 80s our patriots of the 2000s.  China's new carriers start to close the gap, but the gap is still the size of the grand canyon.", "Woman who spent entire career in military industrial complex wants more $15,000,000,000 ships. News at 11."]}, {"title": "Left Wing Logic", "description": "", "comments": []}, {"title": "House Republican suggests US should nuke Gaza in resurfaced clip: ‘Get it over quick’", "description": "", "comments": ["Make of this what you will: “We shouldn’t be spending a dime on humanitarian aid. It should be like Nagasaki and Hiroshima. Get it over quick.”\n\nNot the best idea to use two cities we nuked as a metaphor. Even if he didn’t mean using a nuke, the optics of using two cities we *did* nuke in a metaphor is bad.", "I mean the entire region won’t take in Palestinian refugees for a reason. And they’re all Muslim Arab countries. \n\nHe doesn’t explicitly call for nuking them. In the article he clarifies what he meant was resolving the conflict as expeditiously as possible militarily. A metaphor.\n\nIdk you can either accept he meant what he says he meant or continue to believe what those words mean to you.\n\n*“As a child who grew up in the Cold War Era, the last thing I’d advocate for would be the use of nuclear weapons. In a shortened clip, I used a metaphor to convey the need for both Israel and Ukraine to win their wars as swiftly as possible, without putting American troops in harm’s way,” the statement read.*\n\n*“My reasoning was the exact opposite of what is being reported: the quicker these wars end, the fewer innocent lives will be caught in the crossfire. The sooner Hamas and Russia surrender, the easier it will be to move forward. The use of this metaphor, along with the removal of context, distorted my message, but I fully stand by these beliefs and stand by our allies.”*", "Russia surrender? You know this dude is fucking clueless.", "Why is no one talking about detention centers? If the Israelis removed these civilians from the battlefield they could declare free fire zones and stop using the Vietnam handbook. It seems pretty clear to me that Bibi has no intention of winning this war quickly."]}, {"title": "The Case for Trump’s Foreign Policy Leadership", "description": "", "comments": []}, {"title": "$2 Million Law Suit for Police Using ‘Excessive’ Force in Jan. 6 Beating", "description": "", "comments": ["Unless they get it outside of DC circuit, they have no chance."]}, {"title": "Biden Says His Next SCOTUS Nominee 'Will Be An Illegal Immigrant, I Mean Undocumented'", "description": "", "comments": ["This is satire…", "Oh thank God, I forgot it’s April Fool’s Day.", "Don't post bullshit, not even on April 1st."]}, {"title": "'SNL' mocks Donald Trump Bibles ahead of Easter Sunday", "description": "", "comments": ["Everyone in the \"entertainment\"/media industry has to be praying that Trump wins so they can continue to coast using him for content.", "They mock Trump for this, meanwhile ignore all the free material Joe and the hoe have been cranking out all this time."]}, {"title": "Mass deportation of migrants seen in Russia after concert attack. This is the way", "description": "", "comments": ["Honestly, it’s not a good time to be in Russia because they like to take their immigrants to arrest them and charge them with being spies and then trade them.", "And they will be headed this way.", "In an absolute totalitarian state this is the way. Remember totalitarian is what a government wants but what the people must resist. Security is the responsibility of state, sure. The Russian sovereignty, like the American sovereignty, is not acting responsibly to the people. They’re just acting irresponsibly differently.", "Let's not use Russia as an example to look up to."]}, {"title": "Harvard applications plummet in potential harbinger for other schools", "description": "", "comments": ["&gt;While Harvard had nearly 57,000 applicants for the class of 2027, applications declined more than 5% to about 54,000 for the incoming class of 2028. \n\nStill a bit above the 37,000 applicants Harvard had 5 years ago. If anything I'm guessing applications will decrease around the US as institutions continue to re-instate SAT/ACT requirements.\n\nAlso I'm sure they will cry into their pile of cash ($53 billion endowment) as we argue online", "The class of 2018 had 34, 295 applicants.\n\nClass of 2019 had 37, 307. \n\nClass of 2020 had 39, 041.\n\n2021 - 39, 506. \n\n2022 - 42, 749. \n\n2023 - 43, 330. \n\nClass of 2024 - 40, 428. \n\n2025 - 57, 786. \n\n2026 - 62, 221. \n\n2027 - 56, 937. \n\n2028 - 54, 008 &lt;--- this is where the article states it \"plummets\". \n\nAdmission is still greatly up from decade ago or even 4 years ago, and hasn't \"plummeted\". This is a misleading nothing burger. \n\n\n[source](https://oira.harvard.edu/factbook/fact-book-admissions/)", "good.  we dont need more liberal arts degree holders."]}, {"title": "Ex-CENTCOM Commander: ISIS Threat To U.S. Becoming Serious Because Of Biden’s Foreign Policy | The Daily Wire", "description": "", "comments": []}, {"title": "Hope everyone had a great Easter! ", "description": "", "comments": ["Is that the bunny talking …or the old guy?\n\nI admit….it’s hard to believe that old guy is for real …or just a propped up corpse from Weekend at Bernie’s.", "Come on man, Joe just needs some directions."]}, {"title": "The children yearn for the Dairy Queen", "description": "", "comments": ["I live in an area where mom and pop ice cream shops dominate the only ice cream chain we have (Friendly's). It's pretty cool.", "It will be interesting to see what happens in CA with their new fast food minimum wage.  I imagine there will be a lot of closures as customers are unwilling to pay for low-quality food what it costs to support that level of pay.", "Making ice cream cones is an entry level low skill job for teenagers. It’s should be for them to some cash to play with during the summer or to start saving. \n\nIt’s not for grown ass adults trying to raise a family. A manager spot is a maybe but to raise a family, someone should be targeting a skilled profession and a job with benefits"]}, {"title": "Biden Says His Next SCOTUS Nominee 'Will Be An Illegal Immigrant, I Mean Undocumented' (satire)", "description": "", "comments": ["Can’t be any worse than the last one that doesn’t know what a woman is", "Dont give the left ideas! they will do it...its not satire if its believable", "I would believe it. The last one doesn't even know what a woman is."]}, {"title": "Google has a picture of Trumps likeness with duct tape over his mouth when you search “gag order”.", "description": "Seems very unprofessional, the left wing tech empire continues to inject their blatant bias into their program functions. I fear that googles Gemini will do something similar. I’m aware that news just broke about Trumps gag order but I was just simply looking up what a gag order entailed in the first place. ", "comments": ["And when you look up \"sedition\" it shows pictures of January 6th", "Search gag order on Google images. 95% of the photos are of Trump. Its because the Trump gag order is very popular right now.\n\nLegal analyst Glenn Kirschner applauded the gag order saying he hopes it curtails the former president's \"endlessly dangerous, violence-inspiring rhetoric.\" BLOODBATH!!", "The schism between conservatives and liberals is growing wider in the U.S.  \n\nAnd our politicians and mass media try to heighten that gap as much as possible.\n\nI don’t believe they’ve thought the consequences through however…"]}, {"title": "Pro-Palestinian protesters interrupt Easter Vigil service at St. Patrick's Cathedral in NYC", "description": "", "comments": ["Can you imagine if some Christians interrupted a special  Muslim worship service?", "They can call themselves “pro-Palestinian” but they’re really just Hamasnicks", "This is an attack on *western civilization*, not *israel*", "Rent-a-protesters"]}, {"title": "'Demented' Trump 'incapable of doing job' says psychologist. Says Biden is still sound in his judgement, and though he forgets things, they aren't massive gaffes.", "description": "", "comments": ["Doctors who presume to diagnose a patient without meeting the patient are called \"quacks\".\n\nThere should be \"red flag laws\" for quacks; their license to practice medicine should be seized.", "Remember boys and girls: Biden is mentally sharp, the economy is the best ever and crime is at an all time low!", "Goldwater Rule doesn't apply to \"psychologist\" when they are \"sAvInG dEmOcRaCy\" by slandering Trump and propping up Biden.\n\nJust like covid rules didn't apply to rioters.\n\nJust like classified documents laws didn't apply to Biden.\n\nJust like so many other things."]}, {"title": "Border Agents Caught on Camera Telling Migrants They’re “Free to Go, and Free to Travel Wherever They Want.”", "description": "", "comments": ["Sooo, they're actively participating in the destruction of the American way of life by allowing these criminals into our country?", "I support law enforcement but when you sit by and enable this you’re just as bad as the Big Man himself.", "That's nice of them", "Christ, this is an embarrassment and a disgrace to the USA."]}, {"title": "Biden faces fresh political peril with latest student loans lawsuit", "description": "", "comments": []}, {"title": "Ex-DOJ official’s disbarment trial shows difficult road for Jack Smith v. Trump", "description": "", "comments": []}, {"title": "Gunman kills 1, injures 4 at Nashville coffee shop on Easter Sunday", "description": "", "comments": ["Yeah, the liberals on r/Nashville are already going after gunowners and totally bypassing the actual shooter. They're making all kinds of excuses. And we know why lol.", "Is that a POC? If so, don't expect too much MSM coverage on this.", "Behind a paywall.", "Interesting if he was white, this would be blown up all over every news station all day. He’s not white though so liberals don’t care. Remember, it doesn’t fit their narrative."]}, {"title": "The Many Ways A Porous Border Means Crime Without Boundaries", "description": "", "comments": []}, {"title": "Professors get $1 million to apply ‘critical race studies’ to the classics | The College Fix", "description": "", "comments": ["The title of this post alone should make it abundantly clear why DEI is the biggest grift in history.\n\nAnd in most cases, _a shakedown_.", "&gt;The new program will be a “multi-year fellowship program designed to mentor graduate students and early career researchers of the ancient Mediterranean as they *center critical race studies* in their scholarship and teaching,” according to a Princeton announcement.\n\nPlacing critical theory at the center of anything, let alone *scholarship and teaching*, is not healthy for anyone...", "Since I already have hardcover copies of the classics on my shelves these people won’t be changing or editing a word of what I read. \n\nI suggest everyone find and keep hard copies of all their beloved media and store it in a safe place, the left is coming and will make every attempt to alter and destroy anything from the past they don’t agree with."]}, {"title": "Texas Judge Releases Illegal Immigrants Who Rioted and Clashed With National Guard at Southern Border", "description": "", "comments": ["[deleted]", "Hopefully, at the judges own backyard. Why would the people rounding them up have any incentive to arrest these people if the corrupt judges are going to let them loose anyway? It is a risk to their lives having to catch these violent people.", "Every branch of the government has been compromised.  We are living in an authoritarian system.  Our lack of borders has dismantled the sovereignty.  No one in any branch of government is on our side."]}, {"title": "Texas Judge Releases Illegal Immigrants Who Rioted and Clashed With National Guard at Southern Border", "description": "", "comments": ["Can you imagine a group of US citizens, illegally crossing in to Mexico and clashing with Mexican troops? You will be imprisoned for YEARS in the worst conditions. Come here? Maybe a few days and released in to the country you violated to get our benefits, etc. What a fucked up world."]}, {"title": "‘Vaccine lettuce’ bill, aiming to classify food containing a vaccine as a drug, passes in Tennessee", "description": "", "comments": ["This is in response to some group getting a grant to study if they could do it. The bill is more of a \"don't even think about it\" signal not to the scientists, but to the FDA.", "Tennessee must be a utopia where no one is homeless, no one is unemployed, there is an excess of funds available, education is the best in the country and crime is non-existent if this is what they are spending their voter's tax money legislating.", "What we need are laws ensuring that it's clearly labeled to contain vaccines"]}, {"title": "With ‘Friends’ Like Mexico’s Obrador, Who Needs Enemies Like Putin, Xi, Kim Jong Un and the Ayatollahs? › American Greatness", "description": "", "comments": []}, {"title": "9 Brits Apprehended Illegally Crossing Canadian Border into Vermont", "description": "", "comments": ["No doubt lured by the US government's offer of free tea and crumpets.", "What are the Brits names?", "My first thought was it was probably British Muslims."]}, {"title": "Welfare Migrant: \"I'm rich and you're miserable\" (Fox News)", "description": "", "comments": ["Is it really crazy to advocate for welfare chauvinism here? Even if you disagree with welfare, at the very least it should be restricted to the documented residents who need it.", "More diversity should reach diversity loving places like NYC, Chicago, Denver or Martha's Vineyard."]}, {"title": "'Equity-Based Algebra' Is as Bad as You Imagine It to Be", "description": "", "comments": ["[deleted]", "A^2 + B^2 = that's racist", "If everyone equally sucks at maths, there is no inequality anymore. That's the woke logic, I suppose. \n\n\nUSA is becoming an undeveloppind country. The whole western world is taking this exact same path. We are fucked. Plain and simple. Too much left-leaning morons on our shores. \n\n\nChina won't even have to fight us. They just have to wait a couple decades.", "This is another example of why my children go to private school."]}, {"title": "El Paso judge orders release of migrants accused of 'border riot'", "description": "", "comments": ["J6ers are still behind bars"]}, {"title": "NY Firefighters Forced to Remove Flag for 9/11 Heroes After Leftwing Questioning, Backlash Saves Day", "description": "", "comments": ["At this point, we're just two countries occupying the same geography and fighting over which one gets the government.", "[removed]"]}, {"title": "Boston is planning on putting illegal immigrants in veteran housing.", "description": "", "comments": ["This is like pouring salt into an open wound.", "“We can’t figure out why they keep coming. I guess we’ll give them food, housing, phones, and medical care until we get to the bottom of this” 🤡", "Its clear the disastrous Biden Administration cares more about ILLEGAL Immigrants than our own Veterans who fought for this amazing country.", "I am from Boston.\n\nThey also put them in a community center in roxbury which is a historically black neighborhood. It is one of the only “safe spaces” that those kids had.\n\nThey don’t give a fuck about American minorities. Just the optics."]}, {"title": "Donald Trump’s Road to Victory | There are about seven months until Election Day, but right now, Donald Trump’s road to victory in the 2024 presidential race looks surprisingly smooth.", "description": "", "comments": ["[deleted]", "Republicans have lost a lot of special elections since 2022.  Don't count your chickens before they hatch.\n\nVote.\n\nFundraise, get out the vote, ballot harvest, vote by mail.\n\nVote."]}, {"title": "In setback to Turkey’s Erdogan, opposition makes huge gains in local election", "description": "", "comments": []}, {"title": "El Paso judge orders release of migrants accused of 'border riot'", "description": "", "comments": ["Release them in the judge's neighborhood.", "[deleted]"]}, {"title": "A top official in Denver was just caught on tape begging illegals to leave the city", "description": "", "comments": ["Pretty amusing how he’s trying to convince them to go to NY or Chicago. They don’t want them either.\n\nWhat a mess this is. I feel bad for the people involved but they shouldn’t have been allowed over the border in the first place.", "Pretty easy to flex on republicans and declare yourself a sanctuary city when you’re hundreds of miles from a border, huh?", "This the Escape from New York origin story."]}, {"title": "Trump reacts to Mexican president's $20 billion demand from Biden admin: 'I wouldn't give him 10 cents'", "description": "", "comments": ["How about when Biden gets out we militarize the border and don't give him two cents", "Mexico 's president heard that the US was giving out money to other nations again and thought they would try it.", "There’s a serious collision coming between Trump and their President."]}, {"title": "February Gallup poll revealed that 90% of Republican respondents view \"illegal immigration\" as a \"critical threat\", while only 29% of Democrats feel the same", "description": "", "comments": ["30% is actually pretty high for something that you think would break along party lines\n\nThe dems internal polling must show that independents are in favor of limiting illegal immigration because they pivoted hard from the whole ‘you’re xenophobic for being against illegal immigration’ to ‘actually we care and are trying but it is trumps fault’", "Democrats ask why so many Republicans have a problem with illegal immigration when they dont live anywhere near the border. Cant make this stupidity up."]}, {"title": "Business Owners Fight GOP Efforts to Make Them Police Workers’ Immigration Status", "description": "", "comments": ["\"Don't make me stop using cheap illegal labor!\"", "Fine the living daylights out of ‘em if they don’t use E-Verify. \n\nPlus jail time.", "The business owners love the illegal  aliens. Business owners can easily use free federal service called E-verify. But instead they use the I-9 form which people can defeat easily using forged documents.", "Its like groundhog day. E-verify was a hotbutton issue 20 years ago."]}, {"title": "Hmmm, A top official in Denver was just caught on tape begging illegals to leave the city: \"Any city. We can take you to the Canadian border, wherever.\"", "description": "", "comments": ["Oh and the Gov. of Texas is the bad man for sending them to other states.", "Governor Abbott is a visionary.", "Denver seems like one of the first big blue cities that is realizing how much of a problem this is, but they're trying to be low key with the realization so they don't lose left wing street cred. "]}]