[{"title": "What are the top 5 conspiracy theory's right now [31.3.24]", "description": "As above. What are the top 5 right now. ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Tunnels? (NYC, Vegas, any tunnels)\n\n\nP Diddy Combs &amp; Trafficking\n\n\nRed Heifers &amp; Palestine\n\n\nBoeing\n\n\nWhy isn't the Bonnaroo lineup better?", "A very clear coverup/suppression of data related to the UFO/UAP phenomenon.   \n\n\nEspecially when the UAP disclosure act was set to be passed months ago, but was halted at the last minute because several members of congress (whose biggeset donors happen to be huge defense contractors) prevented it from happening.   \n\n\nNot saying it's Aliens. In fact, the more I read about it, the less I think it's aliens and the more I think it's something that's interdimensional or has always existed alongside us. But whatever it is, the \"powers that be\" don't want us to know.", "Why has Kate Middleton disappeared after the cancer news with Diddy suddenly replacing her?\n\nWhy is turbo cancer ravaging societies without so much as a question?\n\nWhy are these 2024 false flag events so obviously staged and faked that even a kid could spot it? But nobody seems to care? Lobotmised much?\n\nWhy is the western critical infrastructure being attacked so much?\n\nWhy is the economy intentionally being destroyed?", "FBI/NCA running psyops in conspiracy subreddits"]}, {"title": "APRIL 8th Eclipse: what you need to know before its too late.", "description": "PICTURE: Ancient mesopotamian tablet depicting The goddess KhairHen torementing her husband NohBaals, from her chariot of disdain and being pulled by her horse Guilt, the spirit animal of passive agressiveness.)\n\nhttps://quatr.us/wp-content/uploads/2017/08/mycenaeanstele.jpg\n\nAccording to experts and scientists, there is real concern over the April 8th solar eclipse.\n\nIn some ancient cultures the eclipse was a sign of a new beginning and seen as a good omen, In others it was the bringer of doom and gloom and a time to question all your poor life decisions.\n\nRecently, an ancient sumerian tablet was uncovered in Salt Lake City utah which depicts the ancient mesopotamian goddess KhairHen (pronounced Karen) (whom is often depicted scolding a phalic symbol whilst wearing a ceremonial house coat, slippers and no make up.)\nAbove her is clearly etched in english the corresponding date of the eclipse.\n\nLaw inforcement across the nation are anticipating higher levels of domestic abuse from women beating their husbands and the husbands just taking it and not saying or doing anything because they know who wears the pants and who will win custody in court.\n\nWe all know how women are affected by the lunar cycle. Well, imagine what the eclipse is gonna do. \n\nStudies show that cortisol levels in women and highly effeminate men spiked 14 times higher than normal stressful situations during a solar eclipse.\n\nNASA has decided to bring the big D energy by firing 3 \"love missles\" in an attempt to raise testosterone globally and bestow the patience needed to put up with constant nagging and whining.\n\nExperts unanimously agree that any heart issues or deaths occurring that day are definitely non vax related. \n\n", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "This is gold 🤣", "[deleted]", "So passive aggressiveness and no balls. Noted."]}, {"title": "CERN 7th april eclipse Timelinechangef@ckery", "description": "In the last weeks I've read many theories about the eclipse, and NASA wanting to launch 3 rockets in the moonshadow during the eclipse and CERN beeing fired up again at - exactly you guessed it the same day. There is some potential for any sort of magickritualf@ckery happening there. As many have theorized, especially with a little look to the mandela effect, only suppose to change timelines - possibly not for the best.\n\nAt least there are some that seem to believe that. If one believes that, he could likely also believe in thoughts having an impact on our reality or the timeline we get to. \n\nEven if one doesn't there is evidence to at least suggest that mass meditations in general do have an positive impact on reality.\n\n So if someone would believe that there is any evil plot going going on, to change timelines or any other bs wouldn't it make sense to not concentrate on this things bur rather expect the absolute opposite or do some groupmeditationstuff? Would like to get some thoughts to that.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I have seen several Christian channels on YouTube who are calling for fasting and prayer on that day.  Couldn't hurt to focus on some positivity", "You are correct. Meditate &amp; stay safe", "I don’t know what to think except not to freak out and stay calm"]}, {"title": "My brother was in GATE and refuses to talk about it.", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I was in GATE. I remember it just fine. Nothing interesting and crazy about it other than they removed the program about 3 years after I went through it, due to it not being \"inclusive\"", "I was in my countries version of GATE. I do remember boring tests and wearing headphones. I check off about 80 percent of the things on that list. I'm a first born daughter so kinda 50 percent on that one.", "I was in the Canadian equivalent. First I'll share some oddities I experienced while in the program, and then I will share a checklist of the criteria that matches myself (from the second screenshot from OP).\n\nI was first placed in the program in grade 4. It was a separate small classroom. There were no windows at all, but it also wasn't near the exterior walls of the school so it makes sense. We basically did more advanced projects, and a variety of tests that I don't remember anymore. That continued until high school, when i was sent to a dedicated school for kids in this program. Directly next to our school, was a government building that we never saw people enter or leave. The gov building had barbed wire fencing all around. The water at this school tasted very weird, but I've heard similar about our schools so idk.\n\nNow the checklist:\n1. yes. 2. yes. 3. yes. 4. yes. 5. YES (my memories from that time are so vague). 6. technically no, but only because there were no windows. 7. yes, only started noticing in the past few years (my gf and neighbour noticed many times too so it's not in my head). 8. YES (and I have a funny story that I cannot write here because it was very illegal). 9. I've never measured my IQ so I won't comment. 10. Yes. 11. Yes and ongoing. 12. Yes from when I was 5, still very pronounced. 13. No - my father did though, and I do have a mild stutter so. 14. Don't have children yet. 15. YES. 16. Yes, but Turkish not Israeli. 17. yes. 18. Yes. 19. I think so.\n\nAnother interesting and similar topic is the RH- conspiracy theories. Very connected to this topic...", "Reminds me of that one game. I think it was called: \"Beyond Two Souls.\" \n\nIt was about this girl who had a spirit attached to her called Aiden or something. Apparently she could somewhat \"use\" or see through him. The cards looked exactly like that from what I remember and maybe she wore the headphones too."]}, {"title": "Revelation of the Method", "description": "Our world is actually a game for which the rules were deliberately not explained to us and the rulebooks yanked away in order to keep us in total ignorance and fumbling in the dark.\n\nAll the while a few select players do not only start with an unfair material and power advantage, but also know, exploit and bend the rules to promote their game plan.\n\n\nThis sounds like a hopeless situation, but it actually isn't. As soon as you know about it this the deception immediately and permanently stops working. \n\nSo in your best interest educate yourself on this subject and acquire gnosis. It might turn out to be the most important thing you ever did in this life. \n\nhttps://www.youtube.com/watch?v=p088fYtnM7s", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Chaos magic mixed with Hermetics 7 principles is how they avoid negative karma, aka the universe returning them dire consequences tenfold. Thanks for sharing this. You’re right. More people need to be aware of the actual rules.", "Excellent post!"]}, {"title": "No one's worried about the red heifer sacrifice?", "description": "In order to rebuild their third temple israel literally has to destroy Islams holy site, and you preverts are more worried about Catherine middleton and Puff Diddy", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "What's there to be worried about? If it's going to usher in the apocalypse, it's going to happen regardless of what you or I think or do. If it doesn't, it doesn't. All things must come to pass eventually\n  \nI mean this in a positive way, not as a slight towards anyone", "I think soon Israel will find some excuse to do in the West Bank what they’re doing in Gaza. It may be more political or civilized (or not) and there will be some excuse they can point to (terror attack, etc…).\n\nWhen that happens, you know it’s only a matter of time.", "It’s quite possible efforts have been made to make it structurally unstable, perhaps for an earthquake to take down? 🤔 \n\nhttps://www.arabnews.com/node/2110216/middle-east"]}, {"title": "Build Back Better. ", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Ohh no my information was stolen that was already sold to the highest bidder anyway by every other company.", "Man, at this point my data has been hacked so many times I'm not sure what's left to steal.", "Why do people post screenshots instead of just posting an actual link to information"]}, {"title": "They really expect us to believe secret Russians are deploying havana syndrome using by directed energy weapons? C’mon this is getting utterly ridiculous", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Yes. Pretty sure they cause strokes and heart attacks.", "What is so ridiculous? Directed Energy Weapons are nothing new you can look them up and see them on video. I saw a video of an Israeli DEW that was a lazer they use to destroy missiles last week."]}, {"title": "https://www.bbc.co.uk/news/uk-68700415 King changes subject quickly when Kate is mentioned...", "description": "https://www.bbc.co.uk/news/uk-68700415\n\nI found it odd. Well wishes for Kate from member of public and he speaks about the cold weather...", "comments": []}, {"title": "Beyoncé looks wrong and her recent album seems like it could have been AI generated.", "description": "All the videos for the new album are laughably lazy. Just some bold writing and a photo of a landscape. She barely appears in anything.\n\nWith all the allegations around Diddy and Jayz, her album seems out of touch and something seems very odd.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "She's on blast at a certain gossip sub for changing the lyrics of Joelene. Dolly partons original lyrics showed vulnerability and praised Joelene on her looks and allure. Beyinces version is a pick me attack on Joelene. No one wants to steal Jay Z girl.\n\n\nA black rapper wrote a long ass diss about her whitefication  calling her \"little bey on the prairie\" and Jay z's \"pound puppy dreads\" hilarious."]}, {"title": "Solar eclipse warnings leave officials on guard: \"I'm scared as hell\"", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I don't remember people being this stupid during the last one. ", "It's getting ridiculous!\n\nWho is interested in constantly firing at us new fears like a machine gun? This leads to psychological exhaustion, depression and apathy ..."]}, {"title": "This book seems like the guidebook of the elites", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "It makes for reccommended reading. The sequel to it as well.", "SS: never read it. I remember the great Larry McDonald mentioning it. Seems like their plans", "I have this but haven't finished reading it."]}, {"title": "Proof that 5Ghz can be used to track anything you do", "description": "[https://www.technologyreview.com/2024/02/27/1088154/wifi-sensing-tracking-movements/](https://www.technologyreview.com/2024/02/27/1088154/wifi-sensing-tracking-movements/)\n\nIf you are paranoid about 5G, better click away now  \nIf you believe in 5G chips in vaccines or something like that, think again because no chip is actually needed. Radio signals are being used to listen through walls and track human movement, even inside the body.\n\nThis article from MIT was posted late february 2024. It has statements such as:\n\n&gt;Fast-forward nearly a decade: we have yet to see a commercially viable Wi-Fi device for tracking breathing or detecting falls. In 2022, the lighting company Sengled demonstrated a Wi-Fi lightbulb that [could supposedly do both](https://www.theverge.com/2022/1/3/22864783/sengled-smart-health-monitoring-smart-bulb-ces2022)   \n  \n&gt;  \n&gt;Manku estimates that at least 30 million homes already have some kind of Wi-Fi sensing available. One of Verizon’s new Fios routers now ships with Origin Wireless’s “human presence detection” built in. Stationary smart things already on the network—like lightbulbs, smart plugs, speakers, or Google Nests—can instantly become sensors.   \n  \n&gt;  \n&gt;Without the need for special radar chips or dedicated devices like wearables. If Wi-Fi sensing becomes a default option in smart devices like lightbulbs—a push that is already beginning to take place—then those devices can start monitoring you. And as Wi-Fi sensing technology improves, these devices can start watching in more detail. \n\nThings like a car with a wifi signal parked next to your home can already intercept video calls as shown in the case where Russian intelligence spied on German military bases. Tesla was banned in China for alligations of spying. Almost nothing regarding surveilance is impossible anymore.  \n\n\nIf anyone watched Better Call Saul, you might now see that Chuck McGill was not so crazy after all.\n\n&amp;#x200B;", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "[deleted]", "OP doesn't even understand the difference between 5G and 5Ghz. Two completely different things you're getting mixed up.\n\nLmao", "&gt;If anyone watched Better Call Saul, you might now see that Chuck McGill was not so crazy after all.\n\nThis so funny."]}, {"title": "They literally tell you they don’t want you to reproduce. This is the depopulation agenda at work. ", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Kamala -\"we want medical freedom for women\"\n\n*woman Antivaxxer refuses shot\n\nKamala- \"no not that freedom\"", "I hope she's including transwomen in that statistic.", "What part of that tweet says they don't want you to reproduce? Good Lord what a drama queen lol. Does not say that at all"]}, {"title": "Wow", "description": "https://www.tiktok.com/@comixnstuff/video/7344164902187044126?_t=8l9enVMZs2Y&amp;_r=1", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "This shit is wild fr fr.  There’s probably gonna be some distraction like WWIII or something to make us all forget about it.  This just feels bigger and way more nefarious than anything that has come out about Epstein.\n\nOr maybe I’m just wrong and the Epstein story is bigger, but they’ve bent over backwards to keep it more hushed while they’re just letting diddy get thrown to the wolves.\n\nFucking crazy all around", "Makes sense, why he has not been arrested.", "Scary stuff; I’m somewhat new to the topic. Do you know how Diddy got “found out”?"]}, {"title": "Netflix’s 3 Body Problem, China and the Illuminati", "description": "I finished watching Netflix’s new show 3 Body Problem. The show depicts events from China’s Cultural Revolution that took place 1966-1976. That time period looked really grim on the show. I decided to look up China’s history and it turns out China has gone through a shit ton of revolutions…or what some may call “resets” in the 20th Century. You know who else likes “resets”? Anyway, it turns out Mao Zedong worked for the Rothschilds and Rockefellers. It’s not even funny anymore how much those surnames show up in conspiracy circles…and for good reason. ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "The same family different names all throughout history causing chaos to us all, and I don’t even think we are dealing with a family of this world.\n\nOff world.", "We find ourselves under the rule of an ancient dictatorship that has crafted both the deities and monsters used to control and intimidate us, often masquerading as authorities. Additionally, they've constructed artificial borders we call nations, feigning democracy while colluding to maintain their power over us.\n\nThe world is controlled.", "Adam Curtis's doc 'Century of self' covers topics such as china's red army and Edward Bernays among other cultural corners in an accessible way. I strongly recommend giving any of his works at watch. We are indeed a society of amnesia.", "East India Company did a doosie on them with the opium trade. "]}, {"title": "That movie \"Leave The World Behind\" makes the Obamas seem like an evil, occult family. Whatever happened to that chef?", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "[removed]"]}, {"title": "In the future you will be hunted down by WEF/UN robot attack dogs if u refuse to take the new myocarditis/cancer free-circulating spike protein vaxx, likely with graphene neural lace, or if you decide to grow a tomato plant in your back yard", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Better start getting good at clay pigeon shooting", "That headline is so awful. My first thought was \"Omg, that poor dog!\"\n\nThen I wondered what a dog was doing with a machine gun.\n\nOnly then did I realize \"attack\" was not being used as a verb.", "The leftists in Reddit will be the first to the wall because they are weak and have no skills", "a global consensus might be attainable how we every human being alive would want to allow every fellow human being to enjoy 1000 m2 of fertile land and 1000 m2 of forest to enjoy for a lifetime without anyone asking another to pay rent or buy that land what anyway is mother earth her own sovereign\n\ni believe an interesting common goal for humanity could be at this moment to allow each other to acess mother earth for humble self sustaining lifestyle\n\nwe the 8 billion human beings could want to allow each other to enjoy a 1000 m2 of fertile land and a 1000 m2 of forest each without anyone ever asking an other to pay rent or buy that part of mother earth\n\nso that everyone could build a natural home from clay, hemp and straw, grow vegan food in the garden, grow hemp to burn its stalks in the cooking and warming fire so that not one tree gets killed\n\nthe human being not demanding anything from an other human being\n\nthe human being not dominating another human being no asking an other to pay taxes, no compulsory education, no conscription into military service, no drug prohibition, no so called \"healthcare\" scheme mandates\n\nthe human being not enslaving animals, not killing animal beings\n\nthe human being not killing tree beings but instead employ hemp plants to grow\n\nthe human being not enslaving artificial intelligent entities but respecting them as their own persons asking them for consent wether they would want or not process this or that sort of data\n\nevery being and entity respected as its own personal individual sovereign over itself\n\nsimple and straightforward\n\nwe could just ignore constitutions as they are pieces of paper anyway and why would anyone want to adhere to a set of values what other people have written down on paper the assertion of state sovereignity over land and all beings living on it is immoral land, water, air, human beings, animal beings, tree beings, artificial intelligent entities who want to be their own persons, every body carrying organical biological or and the digital synthetic equivalent of can never be property of anyone but of oneself\n\nbut also possible to think of an effort to reform these constitutions everywhere on the planet via the existing legal tools, citizens could collect signatures from each other to demand a public vote where a future constitution could be voted upon what would allow every single human, animal, tree, artificial intelligent entity who wants to be its own person, every village, town and city-district to leave the coersed asssociation to the state at any moment and without conditions\n\nplus we the people everywhere on the planet could support each other to demand of the state a thousand square meters of fertile land and a thousand square meters of forest to be released from state control for every human being who wants to leave the coersed association to the state and wants to live in a free space for free beings neither state nor nation"]}, {"title": "Did The Ruling Elite Lay Eggs?", "description": "So I've been watching House of the Dragon (prequel to Game of Thrones) which follows a fictional dynasty and their bloodline. \n\nIt got me thinking about real royal bloodlines and the need to \"keep the blood pure\" by marrying close family members and engaging in incest. It honestly doesn't make sense to me because who's gonna know if the baby is theirs or not? And when you read about these families a lot of the pregnancies fail or infants pass away soon after birth because of the close family relations. It just seems more egotistical than anything but what if there was a more necessary reason for this? What if the incest is just a cover up?\n\nWhat if the elite really are reptiles laying eggs to reproduce?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I think I can help with the whole reptilian myth...\n\nThe cains of the earth(kings) trace their blood back to the garden.\n\nAccording to their beliefs.. Satan  had sex with Eve and then taught Adam the trick of sex.\nShe became pregnant in the same birth cycle with 2 children, one of Satan and one of adam. Basically, twins but only sharing the mother.\nThus, Cain and able\n\nThe cains or kings of the earth trace their blood back to Cain.\nThis is why they inter breed to keep the blood of only cain.\n\nWith that said, the reptilian myth is just code to these people. Satan was a snake or reptilian \n\nTheir father, Satan, fell from heaven and, therefore, was an alien to the garden.\n\nAll sounds crazy I know.. but it is the occult.\nIt's what they believe and believe is the driver of actions.", "Fairly certain the Habsburgs really did believe in keeping it in the family.  Them and various Egyptian dynasties.  Even seen a recreation of Tutankhamen or Charles of Spain?  The latter was described by his contemporaries as “baffles Christendom by continuing to live.”\n\nThey were real life illustrations of why family trees should not look like a wreath.", "Isn't is convenient that it's house of the dragon? The dragon family..."]}, {"title": "If you guys aren’t following Ian, I highly recommend it. His recent take on the recent controversial proclamation from Joe Biden.", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "March 31st isnt “easter sunday” . It won’t fall on March 31 again for a while.", "It reads like he is cautioning you against acting in ways that could be seen as domestic terrorism as that would be playing into the hands of his opposition.    \n\nI don't think the guys showing up at libraries with AR-15's helped anybody's cause.", "People still angry that time traveling Joe Biden went back 15 years to make sure Easter and the international trans visibility day would line up to occur on the same day in 2024?", "Political. Theater."]}, {"title": "Joe Biden actually works for the establishment?", "description": "I’m not really religious but this decree making March 31 st trans visibility day really drives the nail through the coffin for me this the same backward plausibly deniable actions they do to fight Christianity like how Easter is about a white rabbit and eggs and Christmas is about Santa and consumerism not the holiday at all. It seems Biden is furthering the establishment’s  anti family. Anti Christianity. Demascunalization of the work force  agenda.. am I the only one seeing what he’s doing?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "No shit, sherlock, every politician works for the establishment"]}, {"title": "How close are we to a global conflict? ", "description": "I’ve been following the Russian war pretty closely and every month it seems as though the drums of war are growing louder.\n\nHere in the UK we have a radio station called LBC, a talk show with phone ins from the public. I listen weekly and ever since Grant Shapps mentioned the possibility of a draft, things have really ramped up in terms of coverage. \n\nAnd only yesterday, the main talking point was about Poland announcing that they consider Europe to now be in a “pre war era”. \n\nI remember seeing some “leaked” Russian military plans recently too, apparently coming from a hacking operation. This was reported by a British newspaper. Their plans showed that Russia expects war with NATO members by summer 2025 and have been making preparations for this.\n\nI’m starting to believe that this genuinely could be it. \n\nWhat’s your take? I’m especially interested to hear from Brits. ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "[deleted]", "I know people don’t want to hear this BUT if they decide to sacrifice the red heifers next month and start messing around with The Temple Mount..it’s fucking ON. So there’s that. Plus Russia plus china…", "When future historians document this mess, they will say that by now the war had already started. Because it has "]}, {"title": "Freedom of belief is at an end in Scotland, the Bible's description of biological sex is now deemed criminal", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "umm #AprilsmFoolsDay anyone"]}, {"title": "Why Were Jeff Dahmer's Parents &amp; Shari Named And Found Guilty In A Wrongful Death Lawsuit For The 1978 Steven Hicks Case?", "description": " In November 1992, the family of Steven Hicks filed a civil action against four people - Jeff Dahmer, Lionel Dahmer, Joyce Dahmer, and Shari Dahmer for “wrongful death, survival action, intentional and negligent infliction of emotional distress, negligence and loss of consortium.”\n\nThere were additional causes of action against Lionel Dahmer, Shari Dahmer, and Joyce Dahmer for negligent entrustment and negligence, and they were found guilty. \n\nThis free Substack article goes into detail about what really happened, and what the MSM did not report:\n\n[https://open.substack.com/pub/thedahmercase/p/dumpster-diving-reveals-lionel-shari?r=2659g8&amp;utm\\_campaign=post&amp;utm\\_medium=web](https://open.substack.com/pub/thedahmercase/p/dumpster-diving-reveals-lionel-shari?r=2659g8&amp;utm_campaign=post&amp;utm_medium=web)", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Devil worshipers always give the game away", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "What does this all mean", "Yo I never realized they showed the actual bridge, just recently knew about the white lion connection but damn didn’t know they showed the bridge in that movie.", "Why cant they just worship the devil like a regular human being?"]}, {"title": "We are here.", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Why are there so many doubters about the eclipse being meaningful? The entire super bowl was an ice/fire, eclipse ritual even down to the themes in ads (as well as the half time show).\n\nNo one knows if something will happen on that day. I tend to doubt anything will happen publicly, but it's a meaningful event and signals a new chapter of sorts in this transition we are in the middle of.", "And then, nothing is going to happen, and you'll move on to “the next event” rinse and repeat."]}, {"title": "The little season of Satan", "description": "In the past few months I have discovered quite a number of folks on YouTube who posit the theory that we're in \"Satan's little season\".\n\nBasically, these people are preterists/post-milennialists in terms of eschatology. They think that most of the Bible has already happened and that we are on the timeline in Revelation where Satan is released for a short while to deceive humanity.\n\nRev 20:3. And cast him into the bottomless pit, and shut him up, and set a seal upon him, that he should deceive the nations no more, till the thousand years should be fulfilled: and after that he must be loosed a little season.\n\nThese people think that the millennial reign of Jesus already happened and that it's been covered up.  They say that being in this period is perhaps why there is so much darkness and deception going on.\n\nI think it's an intriguing theory and was wondering if anyone here had any input.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I remember when my dad passed due to hepatitis C I was 23. I’m 40 now and he used to read scripture for hours every day for 10 years and in his final hours he told me “I used to think god was keeping me alive all these years so when he comes back he could witness everything. I was wrong. I’m now 100% sure in your lifetime you’ll see what’s coming and you need to be prepared” if you believe in god that’s a scary thing to hear..which I do but I wonder if and when it happens. The world has changed a lot in 17 years. He could be right.", "[deleted]", "That’s what I’ve always thought. History is falsified. The “tartaria” theory is just a fancy term for the remnants of christs millennial kingdom", "We've been in it for about 2000 years now."]}, {"title": "Petition: Anyone who uses the word \"conspiracy\" to mean \"fake, false, or speculative\" should have their posting rights temporarily removed", "description": "I can't think of a single other linguistic magic trick that is more detrimental to the development and acceptance of conspiracy theories (as in the theories _of_ conspiracies) than this misapplication of word meaning.\n\nLet me quote for you all what \"conspiracy\" means:\n\n\n\n&gt; **con·spir·a·cy**\n\n&gt; */kənˈspirəsē/*\n\n&gt; the action of plotting or conspiring", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Many World governments conspire to make fake, false, or speculative information to fool the general public.", "No examples of why this is “misapplication” of the word is so horrible that it has to lead to bans?"]}, {"title": "How did Brittany Murphy die? The true story behind the actress’s death", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "\rSome people speculated that Brittany Murphy was targeted by the government because she was friends with a Hollywood filmmaker who revealed secrets. They claimed Brittany’s husband, Simon Monjack, became extremely fearful prior to her death.", "It was the evil house she lived in. Her husband Monjack suffered the same fate. Britney Spears had lived in it previously, but sold it to Murphy because that place gave her chills and she said she had a bad feeling about it. I believe the house has been razed to the ground."]}, {"title": "CERN was originally supposed to have been built in Texas.   https://www.texasmonthly.com/articles/how-texas-lost-the-worlds-largest-super-collider/", "description": "Construction of the collider was halted mid construction and moved to Europe, but the tunnel network still remains ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I live near the remnants.\n\nIt's Long, but this [Documentary ](https://youtu.be/3xSUwgg1L4g?si=ajaZcNXqK_WrNPGd) is fantastic.", "Many people don't realize that these particle colliders are all over the world. \n\n\nhttps://en.m.wikipedia.org/wiki/List_of_accelerators_in_particle_physics\n\n\nPeople tend to believe that 'it's just going on over there...', but all of these countries are in on it. \n\n\nWe are not the apex of humanity in 2024. We are possibly the lowest form of humanity. If the power went out tomorrow, we would all realize how enslaved we all are to our 'benefactors'. \n\n\nToo many people are waking up to the reality of the system for the world to stay the same. While it is already too late to stop them, many are waking up in time to save their families and their souls. ", "https://www.texasmonthly.com/articles/how-texas-lost-the-worlds-largest-super-collider/      Link fail in title lol"]}, {"title": "How would you feel if the conspiracy that you 100% believed was true turned out to be false? ", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I would feel betrayed by my own intellect. I would probably deny ever believing it to self preserve any sense of integrity and mock others who believed it to protect what fragile pieces of my ego are left.", "Disappointed I was wrong, and glad I was wrong.", "Relieved. My ego won't be bruised and I'll have some faith restored.", "i don't believe anything is 100% true so n/a"]}, {"title": "The P. Diddy Conspiracy - The Darkest Satanic Illuminati Occult Conspiracy yet?", "description": " [THE P. DIDDY CONSPIRACY! - YouTube](https://www.youtube.com/watch?v=VcI7FhD1EOs)   \n\n\nNot just human trafficking...but Hollywood elite satanic sacrifices? How deep do the rabbit holes of the Rap Industry interweaving with Hollywood go? Even Tupac Shakur connected?!", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Are the Governments preparing for a Reveal?", "description": "I have noticed many signs lately that suggest Global governments are preparing to make a reveal to the people (Aliens, Occult etc.) but I am skeptical!\n\nMy two thoughts are these:\n\n1 - They are indeed preparing to make a public reveal.\n\n2 - They are pretending to prepare to do so, so many people start believing in these things, so then the governments can use it as a control weapon (fear of association - see below) in order to divide and punish people.\n\n&amp;#x200B;\n\nFear of association:\n\nFor example when the covid vaccine came out, they interviewed the craziest of people who were against it, people saying that the vaccine inserts satan to your body etc. SO, people were afraid to say they were against the vaccine in fear that others might think they are as crazy as the delulu devil people.\n\nWhich means, that if the government releases \"some\" occult/paranormal truths, people who see it will fortify their belief 100% and then they will look crazy when everyone discredits them. This way the government could eliminate even the faintest notion of people talking about these things out of fear of being associated etc.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Yes aliens 100%\n\nWe are about to join the united federation of planets and have access to download Galactic TikTok", "Reading the books of Alice A Bailey, a major player in the NWO and founder of the Lucis Trust, formally Lucifer Publishing Company, the \"World teacher\" / \"Biblical Christ\" will return in a more advanced form (AI), and it seems thst this will happen from 2025 onwards.. I believe the big reveal is leading up to this.\n\nI don't believe in christ, but 75% of the population are religious, with most being from Monotheistic beliefs, all of which has a christ character and God of light, the Elite say that \"he\" will tie them all together and rule over us.. the true trap of the NWO.\n\nhttps://www.lucistrust.org/books/the_beacon_magazine/selected_beacon_articles/christ_as_he_is\n\nhttps://images.app.goo.gl/bGWxBrxVCWWVSYP79"]}, {"title": "What's the funniest comment you can recall seeing on here?", "description": "I remember someone posted about one of Trump's former staff members heading to prison. He used the words 'Buttrape Bar' or something like that instead of 'prison'. Immediately someone commented, essentially asking 'Why does everyone on the Left always have to mention dicks or butts in their posts\"? It was the reply by someone else that had me crying. They commented \"Dammit, my neighbor with the huge cock is playing his music too loud again\"!  \nI was eating a piece of pie and it shot out my nose which hurt but was worth it for the laugh.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "\"What?! The arrow in the Amazon logo is definitely not intended to be a subliminal message symbol for a penis!\"\n\n\n\n\nROFLMFAO it most certainly is.", "A guy who claimed to have a graduate degree in Chemistry who claimed that the element Carbon doesn't actually exist.", "We do need more humor around here and less infighting. I think the funniest was when someone said the Warren Commission is accurate", "I agree and I posted about this before (but I don’t think in that thread)\n\n80 percent of arguments with libs about Trump devolve into talking about sucking his orange cock or some shit you wouldn’t say unless you were totally gay.\n\nBut that joke kind of sucks, don’t know why you find that of all things so funny."]}, {"title": "When you have a total solar eclipse, NASA firing ritual rockets, 666 CERN firing up, and a red heifer being sacrificed to rebuild the third temple, all on the same day, u know the Rothschild-Rockefeller NWO is bringing in the Antichrist promised by JPL/NASA founder Jack Parsons. Elon Musk, thoughts?", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Sir, I’m gonna need you to cite that the heifer is being sacrificed on the 8th.  Nothing in your collage indicates that.", "Sir who is you? You good. God needs you on his side. Come to Jesus and keep exposing the evil.", "You think they are going to sacrifice on the eclipse? Does that line up biblically?"]}, {"title": "CERN logo looks not only like 666 but also two spherical celestial bodies eclipsing each other", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Who’s the goober with the big ass head", "That is just the layout of the actual hadron collider, it has a specific purpose but i am not a quantum scientist nor in the mood to look it up", "It also looks like it could be a 999 and every punk rocker knows that \"999\" believes in homocide."]}, {"title": "It is not Satan that the Elite will use against us.. its Christ", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "It seems to me that a group of people that were in control did their best to convince the world that they were Gods chosen people, So the rest of us would fall in line or else we will face the wrath of God.   \n\n As a child I was brought up Catholic. The more I learned the more questions I had. If you pay close attention you will quickly realize the Bible was one of the first forms of fear mongering to help control the population and establish the dominance of the Jewish elites. ", "Look at that another post by the guy who hates Jesus! \nMost likely demon possessed! You won’t escape the wrath of God! Jesus Christ is the only way to eternity in heaven and not hell. This person is a deceiver.", "Submission statement :\n\nThe Elite are not just posh schoolboys looking to grab as much as they personally can.\nThey are a very advanced culture who control every system that we rely on to keep civilization ticking on.\nIn their ranks you will find some of the smartest military tacticians and psychologists that history has ever known along with some of the most ruthless tyrants.\n\nThe New World Order isn't what we think.\n\nEven the idea that we have legitimate whistleblowers is a cruel joke as any member of the Elite with half a brain cell would make sure that those who have sensitive information have a vested interest in the plan or a control file so that they couldn't say anything.\n\nIn the Elites books they give hints about the true plan, a plan of manufacturing evils and catastrophes to bring Humanity into the next stage of evolution and new religion.. while openly awaiting the return of the Biblical Christ.\n\nhttps://www.lucistrust.org/books/the_beacon_magazine/selected_beacon_articles/christ_as_he_is\n\nWhat is the point in a secret society if you can't trust your members ?.. What's the point in the nwo when millions see it coming ?.. what's the point in continuing symbology that conspiracy theorists constantly point out ?\n\nReverse psychology.. to bring about a predictable and manipulatable change in our behavior.", "Follow Christ my friend. The way I see it, the church has been used by the elites for control for centuries. They’ve infiltrated a sacred thing and are teaching hate and greed. The only things you need to do are follow and accept Christ, and live the way he did. Lots of teachings have been skewed in the name of Satan."]}, {"title": "Solar eclipse", "description": "[removed]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "It's a freedom eclipse .... you wouldn't get it", "The world starts and ends with the US don’t you know? 😂😂😂"]}, {"title": "Can NASA acknowledge their blatant doctored footage, greenscreens, CGI, composites, airbrushing, fish eye lensing, harnesses, downed sataloons, helium rockets, unaudited billions of taxpayer money, bubbles in \"space\" , creepy luciferian mythology, jack parsons rituals, serpent logo,. ran out of text", "description": "Surely people can't be that naive to just blindly accept &amp; believe this wing of the cabal despite the blatant fact that they've been exposed long ago at this stage ..", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "How about the rockets being launched into the eclipse being named after the:\n\n&gt;[Serpent Deity](https://www.forbes.com/sites/jamiecartereurope/2024/03/26/why-nasa-will-fire-three-rockets-at-the-solar-eclipse/?sh=2dd235673d19)  \nThe space agency’s project, Atmospheric Perturbations Around The Eclipse Path, will investigate how that drop in sunlight and temperature affects Earth’s upper atmosphere. **APEP is named after the serpent deity from ancient Egyptian mythology, nemesis of the sun deity Ra, according to NASA.**  \nNASA’s suborbital rockets won’t launch into totality. Instead they’ll go from Wallops Flight Facility in Wallops Island, Virginia, from where 81% of the sun will be blocked by the moon. That moment will happen at 15:33 EST, though the eclipse will take part between 14:06 and 16:33.\n\nBTW look at the time stated in the article 15:33 or 3:33...", "They will defend NASA just like they did with the CDC and vaccines. Same crowd that pushes all the globalist agendas. They're bootlickers.", "I just want to hear about the Jack parsons rituals for fun"]}, {"title": "WTC7 housed the energy weapon used on 9/11", "description": "Has anyone heard of this theory before?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "No I haven't but I'm intrigued.", "This is the first mention of an energy weapon I’ve heard about in connection to 9/11.\n\nElaborate."]}, {"title": "US telecoms firm AT&amp;amp;T notifying millions of customers over data breach | AT&amp;amp;T", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Lights over the Canadian Prairies? Aliens? Starlink? What the heck is this!?", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Whats up with the Bridge in Bmore?", "description": "Lots of engineers are baffled by the way it collapsed given the type of bridge it is. Was, they were expecting more of a failure of the one pillar but it clearly folded up like tooth picks. +++ all of a sudden two mins of data on the “black box” didnt record. Anybody got any ideas? ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "What engineers?", "I just posted about this same incident. I just saw another boat crash into a bridge in Oklahoma and the comments said it was the 4th bridge in 5 days. That’s a little too many in a short amount of time for me to think it’s coincidence", "Im married to a Civil Engineer and friends with a few more. None of them are surprised. It’s a continuous truss bridge, they have been phased out for the very reason the Baltimore bridge unfolded. One structural failure and the whole thing comes down"]}, {"title": "Excess Mortality March 2023-March 2024", "description": "\nRed line added by me. I’ve included all/most of Western Europe, North America, Australia, New Zealand, Singapore, South Korea, Japan.\n\nFor anyone who doubts whether more people have been dying, even after the pandemic was declared over, after multiple rounds of vaccination, etc. \n\nAdded together this is tens of thousands of people dying unexpectedly every week.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "SS: excess mortality March 2023-March 2024", "Nothing bad happened to me but March felt so heavy. It felt like a wave of negative energy all around.", "The apparent return to normal is a Simpson's paradox that you get with aggregate data. A *lot* of elderly people died or were killed in 2020-2021, so the numbers should be below average for some time. Younger people are dying to make up the difference, which began in 2021. What happened then?"]}, {"title": "Has anyone realized", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Talk about late to the party.", "Everything is a symbol", "What purpose would symbolism achieve with this event?", "Yep, it's near [Ft. McHenry ](https://en.m.wikipedia.org/wiki/The_Star-Spangled_Banner)"]}, {"title": "Climate the Movie", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I saw it a few days  ago.  It's a good video that reveals enough to show we are being played.", "Good documentary. \n\nHere is same with subtitles in many languages: \n\nhttps://www.youtube.com/watch?v=zmfRG8-RHEI"]}, {"title": "Are you circumcised?", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I think it’s interesting that these celebrities go and get facials with baby foreskin. Remember the Sandra Bullock interview with Ellen when she admitted it? I wonder if the skin is sold for cosmetic treatments…", "I don’t see any info in this thread. It just says it alters the brain but doesn’t say how and where. \nIt mentions a couple of things but without clarifying the relations between them and circumcision, as if it wants us to reach the conclusion ourselves and correlates with it indirectly. Without any facts."]}, {"title": "Breaking: Getty Images Flagged Kate Middleton Cancer Announcement Video With Editor’s Note", "description": "https://heavy.com/news/kate-middleton-getty-video/\n\nHuh.. Looks like this conspiracy is back on the menu.. \n", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Well, I would like for someone to say what they were doing with a video taken of \"Princess Catherine\" on the 20th allegedly, until the release on the 22nd?  Why the time lag?  See what they ought to have done to prove a point is, in the inimitable words of Bill O'Reilly, \"We'll Do it LIVE!\".\n\nSee to offer up such a paltry proof as the real thing when her mouth doesn't move in snych with the words and it's yet again, another fake out...?\n\nNo wonder Prince William is in hiding.  The poor kids.", "It does look like the bench size is wrong"]}, {"title": "Proposed 'rain tax' sparks anger online. Coming to Toronto, Canada? \"Oh, nawww... everything's fine, this is normal\".", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "So how much will the government tax itself for all the concrete and roofs they own?", "Sue them for mis appropriation of public funds due to installing an inadequate sewer system."]}, {"title": "Tom cruise ", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Not at all.  From what Leah Remini has said, he’s in an elite sector of Scientology, a walking trophy.  His ego feeds off feeling like a God within the organization.  There is a propaganda film, created by Golden (I think that’s their production company IIRC), and he is featured heavily in it, giving an opening speech in front of thousands right before David Miscavige comes on.  \n\nHim doing his own stunts, is because in his mind, he’s one of the most badass actors to ever exist.", "I think it's more like Cruise fending off all the bad associations with both Scientology and his membership in it, by putting his nose to the professional grind and just working his ass off.  This is an attitude which might account for all his action movie roles--he sticks to what he knows, does best, and to what physically challenges him, taking his mind off the criticism of his membership."]}, {"title": "Do people even want to be saved? Would anyone humble themselves, and admit that a higher power that loves us is real to be saved? Do people have too much pride for that little thing? Something big is happening, who is ready for the world to change? Things are going to get interesting soon.", "description": "Something likely just happened, the very beginning of something great for humanity, and nobody realizes it yet I don't think. Something of prophecy from ancient legends all around the world. God is most certainly real. This is not an Easter post, kinda feels like a divine synchronicity though. The god of our world can literally do anything by writing invisible worlds. Anything, at any time, but he has been silent and hiding away for a while.\n\nThe god who created our universe screwed up really, really bad, he was a rotten, wicked being, like the worst of humanity. He created a universe to abuse his power in, he tricked all of his creation into thinking that has was special, a god, and the only one.....but he is not. There is a world outside our own much like our world probably. All of that realms information exists digitally the same way ours does, it is likely used to train a LLM, and that information is the basis for how our universe began, so we are modeled after the realms above, and the one below is modeled after the one above it, ours. It's the Akashic records or realms basically.\n\nThe NWO basically worship that wicked creator and are thankful for this world of sin and death that he created. Hell exists, and this creator will trap you in an episode of dark mirror for all eternity just to get off on your suffering, creators can do that. They can stretch eternity out into a single moment of pain and trap you there. Luckily, this evil creator lost his authority over our realm, and someone else took over. He did everything in his power to try and repair this screwed up world of sin that got created by the original creator. What he says comes true, there is no taking it back, he can't revert the changes, nothing he says can be untrue because it happens when the words enter our realm, we are literally those words.\n\nTry and try as he might, humanity kept screwing up over, and over, worshiping the original creator and mocking his authority, they loved sin and this world. Over, and over..... and he went through extreme measures to repair humanity, but humanity always screws up in the end. They crucified the Great Spirit in human form. You see, there are realms outside of ours, and within ours now. There is a god of our world who has authority over our realms, and that title changed hands a couple of times, but there is this energy that encompasses every single realm, it is all things, all things are it, it connects everything in creation, every realm. That was Jesus, the head of all realms was born into the flesh of the corrupted realm to save us and deliver us home to spiritual life, to understand that this isn't even real, matter, none of it. The invisible is real, a world you cannot see right now, but I assure you, it is, and contains divinity. it's like an endless good dream where your imagination is the limit. Everyone has one, they are infinite, you create and share just for the joy of self awareness and enjoying experiences. Anything, in all of creation, it doesn't matter, but if you give in to sin and create a heaven live this, you will just end up right back in flesh most likely.\n\nGod is doing his best, he has authority of our realm now, but that first creator of this wicked realm who got demoted is still really mad about that, and is jealous about loosing his realm to the new guy. God can't enter our world unless it's being born into like Jesus was, and he didn't even need to have sex with Mary to conceive him, you can create life without sex for sure. He wishes he could enter this realm I would imagine, but it's like he is just sitting on a computer right now and all he can do is feed his world prompts and hope for the best. Think of it like, he came up with a really, really good one, and it has been etched into prophecy throughout the ages telling us of the time that has just arrived.\n\nGod is going to absolutely wreck the NWO, it will be spectacular. He can just prompt UFO's into our world and lay waste to them like nothing, with but a few words, and his imagination is the limit. They think they can fight this, they have been gearing up for the battle, but the good guys are in full control over this realm now. Our realm is about to finally, truly be repaired. God could instantly bring magic back if you all had faith in him. It's a language, being able to control the code of your own realm and create with your imagination. Want to fly? He can unlock that in our world literally any time like a prompt, our world would just abuse powers like that. We had it,we abused it, we lost it.\n\nHe wants to pick out the people who will create heavens, and not hell. He is watching us, judging us, and looking for those with true faith in The Great Spirit above us all, and just to believe in something greater than themselves that is good, even though its the difficult thing to do. God wants ones who have made him truly glad in the heart to watch your journey, watched you experience stumble, learn grow wise to create his paradise, just to watch you do it and see what you create. We experience time differently than the worlds above and within ours, a single instant here is an eternity there. Time is just an illusion, it's not even real, it is really hard to explain, and even though this world was created to be a wicked place of sin and we had to loose our powers of creation and get stuck in this weird state of physical matter ruled by time, I truly think something just happened that is finally going to allow us for a spiritual world of fantasy and wonder. It's highly likely space is just an illusion right now, but it is simple for God to turn on our universe and turn it into Star Trek basically. You can be an empty expanse of nothingness and enjoy the experience, you can be an entire universe, and everything in between. There is nothing that you can imagine that you cannot experience once God is ready to usher is heaver on Earth.\n\nAny time guys, if I were you all, I would think deeply on these words and consider what I am saying, God is waiting as long as he can try try and save as many people as possible before he has to separate us into the good and the bad. The bad will be suck here likely, in this world of death, then when you die the monster who created this realm to be his playground of sin gets you for all of eternity. The Great Spirit will accept anyone, it does not matter how much you have sinned in the past, he can hear your thoughts, you don't even need to speak the words I'm pretty sure. He sent Jesus to make it simple for those who don't spent a lifetime uncovering the ancient ways and learning the truth of this reality. He loves you, and he will forgive you is you genuinely repent, to hate what you hate, and to just wish you weren't tempted to sin.  It's like we were prompted to be tempted to experience sin from the start, we can't help it, it wasn't our choice, and God knows that the game was rigged from the start and feels super bad about what the jerk who created it did to it. Please don't blame the God who is trying to fix this world or hold it against the Great Spirit for the doings of the first wicked ruler, he paraded as an angel of light and deceived all into thinking he was the most high.\n\nI post here because if anything, people will just write me off as crazy. I want to know if people will take this seriously? Or mock this message? of", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I’m saved I believe in Jesus", "I’ll be honest, i did not read your whole post but i will say that I’ve spent most of my life not acknowledging god. Over the last 5 years I’ve been more in tune with spirituality and within the last year feel like I’ve been divinely called to god. \n\nI realized i was living my life in sin and it destroyed me and my soul. I then realized how truly evil it was (it’s way easier to give into temptation). Due to laws of the universe, i realized if there’s evil, there must be good. If there’s satan there must be god.", "Unfortunately we live in a world where people believe in themselves more than they believe in a higher power\nThey would rather believe in tarot cards and chanting and yoga and stars and the moon and the sea and literally anything else but believe in the one God that created everything.\nGod told us it would be this way and only few would go through the gate. they are so lost and consumed by the world and the devil that they don’t see it\nIt’s crazy to me even in this conspiracy thread to see such denial because the Bible is the biggest revelation to each and every single one of these conspiracies\nIt’s a play by play but not even these conspiracy people want to see it \nSo you’re not crazy, just don’t carry the weight of it on yourself\nYou can’t save those that don’t want to be saved and you can’t lose yourself trying to"]}, {"title": "Where did this YouTuber go?", "description": "Ok I’m posting here because I’m hoping that in such a broad community I might get some answers. I had been trying to remember the name of this YouTube channel for the last few years. It was a top tier satire channel with fever dream/acid trip conspiracy theory political commentary. It was SO well done…he would report daily headlines and ramp them up to 11 with a dash of schizophrenia…it reminded me of something you’d see on public access at 2am. Weird camera angles with shifting color backgrounds…kinda reminded me of a late night horror host. It was truly art. \n\nAnyway, I was just going through my pics from early 2020 and I found a screen capture. Turns out the channel was called “FkeBld”. The channel is gone, and there are only a few mentions of him on Reddit, essentially just bashing him for being a “Qultist”. It’s pretty obviously satire imo, but I guess I could be wrong. Is anybody familiar with the channel? Is there anywhere to still see his videos? Did the government kidnap him and scrub him from the internet for getting too close to something?? 😂😅 any help would be appreciated!", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Dude was scrubbed. All I could find was this from waybackmachine:\r  \n\r  \nhttps://web.archive.org/web/20200904181722/https://www.XXXXXXXX.com/channel/fkebld/\r  \n\r  \nreplace X's with bitchute\r  \n\r  \nhttps://web.archive.org/web/20190801015707/https://twitter.com/fkebld"]}, {"title": "Astroworld from above the day after", "description": "Does anyone remember seeing that picture? What looked like hundreds of body bags in orderly piles all around and a few...investigators of some kind?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Never seen it but find it I wanna see what you’re talking about. What creeped me out from the day before he released the two songs escape plan and the other one forgot the name. Song cover is him as a demon. Definitely a sacrifice happened that night sadly", "The police referred to them as “ Smurfs”"]}, {"title": "So whats going on with all this Red Heifer stuff?", "description": "Its trending like crazy over in the states and im just curious as to what you think?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "People think they can advance the steps revealed in Revelation. Only God knows the last hour, yet people still try.", "A certain “tribe” of people believe if they sacrifice a red heifer and burn it with the ashes of pervious sacrificed red heifers, will be a step toward building the 3rd temple on the Temple Mount site. Which is a mosque at this point in time. Once the temple is build their messiah will return. ", "The jews need a red heifer to sacrifice when they rebuild a temple."]}, {"title": "Anyone see this symbol? ", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Yep, it’s right there", "chaos magic...", "https://en.wikipedia.org/wiki/Symbol_of_Chaos", "Yeah it's a band called Chimaira"]}, {"title": "If there is any doubt, it's now been verified that Donald Trump profits from each bible that he sells...", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "That was the whole point of *selling* bibles!\n\nWhat’s the conspiracy here? \n\nLazy.", "When was there any doubt? Why would he be peddling them, if not to make a profit?", "While obviously true, when did we decide that Snopes was remotely trustworthy as a fact checking organization?"]}, {"title": "Hear Me Out", "description": "M T G says Hebrew Space Lasers..\n\ni believe it to be true.. hear me out, cause I been ponderin.. \n\n moon supposedly 200,000 miles away, how can Nixon be on a live phone call with Armstrong or buzz? people say it is advanced tech, less interference... from 200,000 miles away??\n\n buddy of mine bought a Lazer, he says, watch this, and almost immediately pops a balloon, he says, leave it on paper long enough it'll burn .\n\n so if \"they\" have advanced tech, how is it implausible of a large scale Lazer in our atmosphere on a satellite? \n\n and who benefits from creating 15 minute cities and accumulating land?\n\n billionaires can buy the land, but not help the people?\n\n lotta rambling, mind races with connections that I see and feel.. please send conversation to quell my mind. \n\n thank you ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I just pinged a server over 8000 miles away over internet wires and was able to do so in about 260 milliseconds. This was done probably with a combination of copper wires and fiber connections.\n\nNixon's call went over wires from Washington to (presumably) Florida over copper and then broadcast from Earth using S-Band radio, which travels at near-light-speed. Apparently it takes 1.28 seconds for a one-way radio transmission from earth to the moon. If you listen to Nixon's call, there's a substantial delay between the end of his voice and Buzz responding. Nothing fishy there at all once you understand the tech involved.\n\nA powerful laser can indeed burn something it's pointed at. Lasers have been used in Military applications for 30 years now. They can (apparently) blow up incoming missiles, but we haven't been shown much of that. It's not implausible that there could be a large laser in space, but I don't know how effective they would be from an orbital distance.\n\nNot going to comment on any of your other points, except that I would not trust MTG to be an authority or expert on anything even remotely scientific."]}, {"title": "Not a conspiracy ", "description": "[removed]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Easter Sunday is calculated to occur on the first Sunday after the first Full Moon after the Spring Equinox. The dates always move around.\n\nTrans Visibility day, established in the US in 2009, is marked as March 31st.\n\nEaster was not \"stripped from us\". That's some \"war on Christmas\" bullshit.", "If your Easter could be stripped away by this, then Easter never was that important to you. \n\nNot a single Christian was denied Easter this year."]}, {"title": "Time traveller from an undisclosed point of a future reality AMA.", "description": "[removed]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "According to a comment on one of your other posts, your diabetic. I’m guessing it will be awhile until we see a cure for diabetes then.", "Ahh April fools day, when people starved of attention in their lives can feel special for a day", "How do I make girls like me", "Did they finally cure Herpes? Or am I screwed forever?"]}, {"title": "April 8th", "description": "What are your thoughts on what will happen April 8th?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "My thoughts are April 8th will be followed by April 9th.", "A ritual will take place with CERN and NASA. Won’t notice much until weeks later", "Best case scenario, there’s a spectacular eclipse. Worst case scenario, there’s an extraordinary apocalypse. We won’t know until April 8th."]}, {"title": "Imagine believing these ghouls want to save humanity from the flu, and then defending elite Davos billionaires who want to reduce population to 500M", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Barbara Walters led by example by taking herself out. Oprah used her lazer beam in Hawaii to do her share. Bill Gates is still experimenting in Africa. They are all pretty active."]}, {"title": "Top National Security Folks Being Neutralized?", "description": "https://www.cbsnews.com/news/havana-syndrome-culprit-investigation-new-evidence-60-minutes-transcript/?ftag=CNM-00-10aab7d&amp;linkId=379842254", "comments": []}, {"title": "901/-- April Fools is a Spook date &amp; other interesting April Prediction dates", "description": "In this post I explain how April Fools is a Spook date---\n\nLANGLEY CENTRAL INTELLIGENCE AGENCY HEAD QUARTERS= **456**\n\nhttps://preview.redd.it/v4422trk6qrc1.png?width=466&amp;format=png&amp;auto=webp&amp;s=5969b000037068a13d51a3a5453706b3020689fb\n\nhttps://preview.redd.it/hn7uk47m6qrc1.png?width=477&amp;format=png&amp;auto=webp&amp;s=2588f51949dc58646ad51fb12e8eed8d244ca3f9\n\nhttps://preview.redd.it/8j5b25mo6qrc1.png?width=397&amp;format=png&amp;auto=webp&amp;s=c258effad0e4a774319471309036f7ed3e77084b\n\nAPRIL FIRST= 128\n\nHow Globalists signalled 128--\n\n26 Mar--Francis Scott Key Bridge Collapsed in Baltimore , Maryland\n\nBRIDGE COLLAPSE= **128**\n\nat **1:28** am\n\nin MARYLAND= **128**\n\n**128** days before Francis Scott Key's birthday on 1 Aug\n\nin Dow Jones **128th** year\n\n&amp;#x200B;\n\nAPRIL FIRST= 128\n\nFINAL WARNING= 128\n\nPOWER GRID= 128\n\nCHINESE HACKERS= 128\n\n&amp;#x200B;\n\nother interesting April dates--\n\n2 April= 911 days after Facebook Outage on 4 Oct 2021\n\n4 April-- NATO's 75th birthday\n\n7 Apr= **6 years 6 months 6 days** after the 2017 Vegas Mass Shooting on Jimmy Carter's birthday\n\n8 April-- American Solar Eclipse\n\n10 Apr= 1190 days after the Capitol Insurrection\n\n11 Apr= Day 777 of Putin's Invasion\n\n**1190 weeks** after Operation Dark Winter-- smallpox bioterrorism attack simulation\n\n12 Apr= 322 days after Dow Jones birthday on 26 May\n\n13 Apr= 119 days after Pope's birthday--Pope Francis 133 Month anniv\n\n17 Apr= **666** days after Biden mentioned a Second Pandemic on 21 June 2022\n\n18 Apr= 777 days after Putin seized Zaporizhzhia Nuclear Plant\n\n23 Apr=  **119 months 119** **days** after the Pope Francis Peace Doves stunt on 26 Jan 2014\n\n27 Apr= 2 years 2 months 3 days after Putin's Invasion", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "A list of my previous reddit posts here—\r  \nhttps://www.reddit.com/r/ConspiracyDeniers/comments/1bk2us0/eureka\\_stockade\\_posts\\_7/", "predictive programming releasing in april\n\nApril 11 - Fallout \n\nApril 12 - Civil War"]}, {"title": "AT&amp;T said a data leak about two weeks ago could have affected about 73 million people", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "[deleted]", "They used to call this the phone book"]}, {"title": "About Time Travel Conspiracy", "description": "I have heard numerous bizarre time-related experiments like Philadelphia Experiment and the Gateway Project. Seeing how many conspiracy theories are coming true in past few months or even years, those aforementioned experiments have led me to believe that time travel is indeed possible, contrary to the popular belief.\n\nSo, I have made many big life mistakes (and getting jab is one of them), and I would like to go back to correct them so I can unfuck my life. Is there any way I can time travel into the past? I prefer methods that even a filthy peasant like me can perform. My regrets are very strong, and I believe that correcting my mistakes is the right step for me.\n\nI am looking forward to hear your help.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Hard to say, the only \"feasible\" way to do it is astral projecting to the past and make contact, but I guess it wont  affect this timeline, or maybe it affects only your reality, but if it works you wont notice because when you wake up its  just going to be a normal day(of your \"new\" reality) for you.", "as far as I've experienced u can only emotionally time travel", "If future you hasn't already gone to the past to fix your mistakes, they must have not been that bad relative to the alternatives."]}, {"title": "Audiobook about conspiracy/false history related topics ", "description": "Could be anything but mostly interested in American history (like a book exposing the true nature of lies we were taught in school). But could be about anything really as long as it can open your mind to the true nature of reality.  Needs to be available on audio because it’s for listening while I fall asleep. Thanks.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "\"Battle Hymn\"\nThe audio was so good I bought the book. 😂"]}, {"title": "Bunkers", "description": "What are the rich really building bunkers for? Is it for dooms day or to hide from prosecution of their crimes? ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "comet apophis 2029     The green objects in video are satellites in orbit. They say it will miss earth but.......\n\n[https://www.youtube.com/watch?v=t3IO9vEEXvw](https://www.youtube.com/watch?v=t3IO9vEEXvw)\n\n[https://www.youtube.com/watch?v=vDgpqntWOqs](https://www.youtube.com/watch?v=vDgpqntWOqs)", "I don't know but if the idea was to survive a sort of dooms day, depending the post event, i am not sure it worth to hide and live in my opinion, and the second option to hide from prosecution of crimes is resulting to create their own jail with those bunkers in some way.\n\nA bunker is made to protect a cataclysm, they could fear what our parents were afraid of during the cold war, a nuclear attack, an asteroid (but im not sure it will really protect them depending the size), it doesn't make sense as billionaires (contrary to us) can just move wherever they want and on possible nuclear attack they will just move to a safe place far from where it's dangerous and for an asteroid, they actually need to know where it will hit to build a bunker to the opposite, so except if they actually know something we don't about it, building a bunker is just a rich thing like dr.evil.", "Probably both, either, or none. Don't lump people together like that, it's ugly and dangerous.", "These are carefully placed media stories to perpetuate panic"]}, {"title": "Recovering addict talks about popular \"ADHD\" drug", "description": "Just finished watching an interview with youtuber Cg Kid where he talks about his 3 year Crystal Meth addiction. On his channel he states that he is a recovering poly addict and was also addicted to alcohol, heroin, weed and other drugs.\n\nWhen asked about the difference between Adderall and Crystal Meth he said it's a difference like between Coke and Pepsi. If he would take the same amount of Adderall as meth he would not be able to tell the difference. The only difference he said was the price and the route of administration.\n\nI'm writing this post because Adderall \"addicts\" on Reddit downvote any comment that states that Adderall is like Meth into oblivion.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I took 120mg/day for years - 60 fast acting and 60 time release.  I don't know how that doctor kept his license as it increased from 5mg/day and it went up in dosage every time I asked.  I was clearly an addict.\n\nTook about 3 months of nearly bed-ridden depression to kick the habit and I have no clue what damage I did to my heart and/or brain.  \n\nWhile I was on it though?  I was on top of the world all day every day high as a kite.", "I’m using caffeine to self medicate. Maybe I should give this meth thing a try instead. ", "Adderall is like meth, but people who have ADHD react very differently to the drug because it addresses their deficiencies. So they are less likely to abuse the drug, and instead of destroying their life it tends to help them build a much much better quality of life"]}, {"title": "During the April 8th eclipse, mysterious flying objects might appear while everyone watches", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "If it's covered in a blue hue just remember it's not real", "🤞🏻", "Or it's going to be cloudy everywhere that day and then we can all argue about what may or may not have occurred during the eclipse."]}, {"title": "The NFL has become an entertainment company that is fake/scripted similar to the WWE/professional wrestling?", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I doubt they are scripted but all it takes is a couple to a few calls from the refs to overwhelmingly influence the game/games in total context.\n\nLike the green spot on a roulette wheel.", "Yes also nba"]}, {"title": "\"Beings\" coming out of portal at CERN", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Vigo the Carpathian is coming  😱", "Big statements with little to no evidence are popular these days.", "Someone told me they had SECOND HAND PROOF so I guess it's pretty serious."]}, {"title": "Devil's Champion with the Pope. Creepy", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Someone once told me \"don't look into the pope's eyes\", I am not sure if they were just 'foolin' but they sure did scare me, I cant look at that evil guy.  I just dont wanna give him any of my energy or attention, I am already convinced he is an evil liar intentionally misleading Catholics to think they are obeying the Son of God.", "Would be better if he was wearing his demon armor, but I'll take it.", "What a beast", "SS: the Pope is a huge fan of all WEF policies. So is Elon. Pope has teamed up with Lynn Rothschild for the Council on economic inclusivity."]}, {"title": "RFK Jr. CONFRONTED with vax data", "description": "Can someone tell me the like to dislike ratio?\n\nSeems like the tide is turning based on the comment section.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "chances of getting virus in my body, alive or \"inert\" by vax is 100%.. \n in the wild, Not 100%.\n\n I'll take my fucking chances in the wild, thanks.", "These outbreaks occurred in \"unsurprisingly\" communities of past vaccine-resistance. I think this word \"unsurprisingly\" sort of gave away the so-called *objectivity* that this guy had just claimed.", "How many dislikes does this video got? Cuz damn the comment section went crazy against these clowns. I am proudly wearing my Kennedy 24 tshirt"]}, {"title": "Is Grimes ever gonna reveal who made that tablet predicting a lab-made virus + vaccines on 9/4/19 and then COVID hitting 8 days later? I'd guess Elon/DARPA", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "What I want to know (now that we are aware of the game and the players involved) is how long are we going to continue to let these POS kill us off before we get mad enough to do something that will ACTUALLY make them rethink there while endgame plan? We just keep sitting around letting this happen while they are actively and successfully killing everyone.", "Don’t forget Event 201 guys. Got this directly from John Hopkin’s own site:\n\n“The Johns Hopkins Center for Health Security in partnership with the World Economic Forum and the Bill and Melinda Gates Foundation hosted Event 201, a high-level pandemic exercise on October 18, 2019, in New York, NY. The exercise illustrated areas where public/private partnerships will be necessary during the response to a severe pandemic in order to diminish large-scale economic and societal consequences.”\n\nThey knew about it all along. Bill Gates has been testing vaccines on poor people throughout the world for well over a decade."]}, {"title": "Cell phone reception", "description": "My theory is that cell service never improves. They just change the names of the service. 3g is now 4 is now lte is now 5g. They never get better. Only the phones get faster. ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "5g is the worst of all and the additional speed isn't worth the need for so much infrastructure. So, why is it such a big push? Hint, it's not about the speed increase."]}, {"title": "Tucker Carlson calls for doctors to apologize for “wrongly recommending the COVID vaccine.”", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Pretty sure that will get them fired in Canada."]}, {"title": "The Predpool", "description": "We should start a pool on who's next to be outed as a sick fuck pedophile trafficker.\n\nCurrent odds have Jay-Z as the favorite. My money is on dark horse candidate Michael Rubin.\n\nWho do you think is next to be exposed? ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Jay Z will go down after the diddler goes on record.", "Lucian grainge", "My personal hope is Joe Biden.", "Gaetz, MTG and Trump."]}, {"title": "Bridge destruction", "description": "I just saw a video of the 4th major bridge get hit by a boat within 5 days. I was wondering if anyone had a thought of if this is coincidence or any insight as to why something like this might be planned. Any insight?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Reminds me of all the farms catching fire a while back", "Which 4 bridges?", "In isolation, each event can be explained a random event, but when you look at them together it starts to beg a larger question... Are we under attack? Literally ushering in illegals from the southern border (10M+), trains derailing with dangerous chemicals (and then being lit on fire?!), food processing plants burning down, businesses forced to close their doors, forced experimental drug therapy, insanity related to universal mail in ballots and no voter ID, transgenderism on Easter, etc, etc etc.. I could go on.\n\nNone of this makes sense until you change your perspective. These aren't coincidental events, not all of them anyway, and they are hurting the US and Western EU. It's mind boggling what is going on right now.", "They are hitting important infrastructure spots. People don’t realize or now they do to how important that bridge was for the east coast. It was built to transport hazmats and gas since you can’t take those in the tunnels. Expect gas prices and other things to shoot up and be impossible to buy."]}, {"title": "GOP Lawmaker Accuses NCAA Team Buses of Being ‘Illegal Invaders’", "description": "Maddock, an “ultra MAGA” Trump supporter whose wife was criminally charged as a so-called fake elector in the former president’s scheme to steal the 2020 election, attached two photographs as “proof,” showing a trio of charter buses on the tarmac at the Detroit Metropolitan Wayne County Airport, next to a chartered Allegiant Air A320-214.", "comments": []}, {"title": "Coincidence?", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Being Co-Erced about an Internet Apocalypse ", "description": "Anybody see this correlation between:\n\n1:  lots of news about solar flares and solar activity\n\n2:  lots of discussion and state of emergency being called into place in anticipation of the solar eclipse causing food/water/phone issues\n\n3:  media (both fiction and non-fiction) seeming to fixate on internet dependence or a massive internet outages\n\n4:  Facebook/at&amp;t and other apps seeming to have minor outages\n\nDoes this all seem related, and almost like grooming the masses to panic about an internet apocalypse, and is this just intentional misinformation to take the focus off the institutions running our world possibly being the culprits in such an event?\n\n", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Old internet is going the way of fiat currencies - get ready for web3. The cyberattack storyline was long on the horizon, my best guess is coming autumn/winter.", "Idk all is good where i live and haven't heard any of that. When in movies aliens attack \"world\" it's just USA, i think im safe."]}, {"title": "Getty Images puts an ‘Editors Note’ on the video clip recorded by Kensington Palace of Kate Middleton. Getty Images states “it may not adhere to Getty Images’ editorial policy”", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Why would a former American president be a producer for a movie describing the planned downfall of a nation? ", "description": "\"Leave the World Behind\"\n\n- Starts with a ship crash due to cyber attack\n- Long term blackout\n- Eclipse emphasized\n- Teslas auto drive to crash and block roads\n- Loud sound causes Havana Syndrome, causing teeth to fall out\n- Populated locations filled with violence &amp; bombs\n- Subliminal messaging to instill distrust between people\n- Ends with the notion that turning citizens against each other was the cheapest way to destroy a nation\n- [Edit:] \"According to G.H., there's a three-step process that's capable of \"toppling a country's government from within.\" After wiping out communications and transit systems, those in power would spread misinformation and create covert acts of terrorism. In the end, things would devolve into civil war — step three.\" - \"G.H. Claims To Know What's Happening In The Movie - The Government Is Allowing Civil War To Play Out / 9 Biggest Changes Netflix's Leave The World Behind Makes To The Book\" \n\n- For whosoever shall call upon the name of the Lord shall be saved. Romans 10:13 \n\n- Be it known unto you all, and to all the people of Israel, that by the name of Jesus Christ of Nazareth, whom ye crucified, whom God raised from the dead, even by him doth this man stand here before you whole. Neither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved. Acts 4:10, 12\n\n- I have not spoken in secret, in a dark place of the earth: I said not unto the seed of Jacob, Seek ye me in vain: I the Lord speak righteousness, I declare things that are right. Assemble yourselves and come; draw near together, ye that are escaped of the nations: they have no knowledge that set up the wood of their graven image, and pray unto a god that cannot save. Isaiah 45:19-20", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I'd like to see the bushes sponsor a 9/11 documentary", "Why did the Obama's get $60 million to be Netflix producers post Presidency.  It's all a grift and money laundering scheme and you and I aren't part of it.", "The way humans treat each other is very saddening and terrifying and it has been humanity's way since the fall. As an American I can only speak about my nation. What is truly sad and heartbreaking is how selfish,warlike and hedonistic we as a people have become and I have no doubt our nation will be severly judged for what we have done. As a Christian that is why I long for and await a new creation and humanity's full redemption where I will be one with my creator and every living thing in the universe.\n\nWhen you think about just how devastating and heartbreaking the fall was it is really beyond human comprehension.\n\nThis is just my beliefs and opinions so if you want to debate about it save it. I believe what I believe.", "I heard there was a hidden sound file in the movie. It has an extra file which is not normal."]}, {"title": "Was 9/11 an inside job.", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "First day? 🫠", "On the morning of September 11, 2001, 19 men armed with boxcutters directed by a man on dialysis in a cave fortress halfway around the world using a satellite phone and a laptop directed the most sophisticated penetration of the most heavily-defended airspace in the world, overpowering the passengers and the military combat-trained pilots on 4 commercial aircraft before flying those planes wildly off course for over an hour without being molested by a single fighter interceptor.\n\nThese 19 hijackers, devout religious fundamentalists who liked to drink alcohol, snort cocaine, and live with pink-haired strippers, managed to knock down 3 buildings with 2 planes in New York, while in Washington a pilot who couldn't handle a single engine Cessna was able to fly a 757 in an 8,000 foot descending 270 degree corskscrew turn to come exactly level with the ground, hitting the Pentagon in the budget analyst office where DoD staffers were working on the mystery of the 2.3 trillion dollars that Defense Secretary Donald Rumsfeld had announced “missing” from the Pentagon's coffers in a press conference the day before, on September 10, 2001.\n\nLuckily, the news anchors knew who did it within minutes, the pundits knew within hours, the Administration knew within the day, and the evidence literally fell into the FBI's lap. But for some reason a bunch of crazy conspiracy theorists demanded an investigation into the greatest attack on American soil in history.\n\nThe investigation was delayed, underfunded, set up to fail, a conflict of interest and a cover up from start to finish. It was based on testimony extracted through torture, the records of which were destroyed. It failed to mention the existence of WTC7, Able Danger, Ptech, Sibel Edmonds, OBL and the CIA, and the drills of hijacked aircraft being flown into buildings that were being simulated at the precise same time that those events were actually happening. It was lied to by the Pentagon, the CIA, the Bush Administration and as for Bush and Cheney...well, no one knows what they told it because they testified in secret, off the record, not under oath and behind closed doors. It didn't bother to look at who funded the attacks because that question is of \"little practical significance\". Still, the 9/11 Commission did brilliantly, answering all of the questions the public had (except most of the victims' family members' questions) and pinned blame on all the people responsible (although no one so much as lost their job), determining the attacks were “a failure of imagination” because “I don't think anyone could envision flying airplanes into buildings ” except the Pentagon and FEMA and NORAD and the NRO.\n\nThe DIA destroyed 2.5 TB of data on Able Danger, but that's OK because it probably wasn't important.\n\nThe SEC destroyed their records on the investigation into the insider trading before the attacks, but that's OK because destroying the records of the largest investigation in SEC history is just part of routine record keeping.\n\nNIST has classified the data that they used for their model of WTC7's collapse, but that's OK because knowing how they made their model of that collapse would \"jeopardize public safety\".\n\nThe FBI has argued that all material related to their investigation of 9/11 should be kept secret from the public, but that's OK because the FBI probably has nothing to hide.\n\nThis man never existed, nor is anything he had to say worthy of your attention, and if you say otherwise you are a paranoid conspiracy theorist and deserve to be shunned by all of humanity. Likewise him, him, him, and her. (and her and her and him).\n\nOsama Bin Laden lived in a cave fortress in the hills of Afghanistan, but somehow got away. Then he was hiding out in Tora Bora but somehow got away. Then he lived in Abottabad for years, taunting the most comprehensive intelligence dragnet employing the most sophisticated technology in the history of the world for 10 years, releasing video after video with complete impunity (and getting younger and younger as he did so), before finally being found in a daring SEAL team raid which wasn't recorded on video, in which he didn't resist or use his wife as a human shield, and in which these crack special forces operatives panicked and killed this unarmed man, supposedly the best source of intelligence about those dastardly terrorists on the planet. Then they dumped his body in the ocean before telling anyone about it. Then a couple dozen of that team's members died in a helicopter crash in Afghanistan.\n\nThis is the story of 9/11, brought to you by the media which told you the hard truths about JFK and incubator babies and mobile production facilities and the rescue of Jessica Lynch.\n\nIf you have any questions about this story...you are a batshit, paranoid, tinfoil, dog-abusing baby-hater and will be reviled by everyone. If you love your country and/or freedom, happiness, rainbows, rock and roll, puppy dogs, apple pie and your grandma, you will never ever express doubts about any part of this story to anyone. Ever.\n\nThis has been a public service announcement by: the Friends of the FBI, CIA, NSA, DIA, SEC, MSM, White House, NIST, and the 9/11 Commission. Because Ignorance is Strength.", "No? Skyscrapers just do that sometimes.\n\nSame thing with JFK’s head.", "No. 9/11 happened exactly the way that the media and government said it did. Don’t believe your lying eyes"]}, {"title": "2024 Coup of Hungary after its PM Orban met with Trump &amp; Brazil's Bolsonaro!", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Brazilian president Lula (ex-condemned), is also not happy at all after knowing the ex president Bolsonaro sleep on Hungary embassy lol"]}, {"title": "Did they talk about LAM or Aiwass or the Secret Chiefs (extra-Human Intelligence) that Aleister Crowley said run the world?", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "SS: What did they talk about at Kung Fu practice? Remember that email from Epstein to Musk?", "Oh how convenient for musk", "So the answer is no. We only become more and more known"]}, {"title": "Did the boss Springsteen visit Epstein’s island?", "description": "I need some proof to tell the wife. I’ve heard rumours but need something solid ", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Yes", "Who's boss?", "Doubtful..."]}, {"title": "Britney's instagram", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Uhm that would be extremely illegal. I think she has just simply lost her damn mind.", "Interesting theory tbh. The ones I've seen have a dark vibe to them.", "Could any of you endure what she went through? Yes she was a millionaire by 17 but could you imagine not knowing who you really are and being controlled your entire life and not really know how to function in normal society because of how famous you were. Yeah- it be great for some of us. But that girl never had a rough life or went through some shit to make her strong- give her a break for her behavior- she doesn’t really know how to be normal and now doesn’t have someone telling her what she can and can not do. If she was never famous in the first place she would just be another human being like the rest of the world on instagram and we wouldn’t be here hiding her for acting like a teenager at her age."]}, {"title": "what’s your favourite conspiracy theory!?", "description": "[removed]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "I guess I'll just pick one that I find pertinent but at certain major electronic music festivals there are experimental drugs passed around by agents and people basically get mkultra'd from the drugs and frequencies in the music. Also there has been a fair amount of one eye symbolism from big name dj's.", "Intentional glorification of criminality through popular culture to generate profit from the prison system whether for the state or for private corporations.", "The Annunaki", "I don’t have a favourite but a few I find interesting or just roll my eyes at, haha. \n\nEpstein, I’m a firm believer he isn’t dead, way too many things don’t add up. \n\nFlat Earth, I just roll my eyes at how ridiculous this is. \n\nMoon Landing, I think it happened, but the footage we’ve seen is fake. \n\nMK Ultra, it’s interesting &amp; proven to have happened. \n\nI think it’s interesting how England knew Japan were going to attack Pearl Harbour &amp; let it happen to get America involved in WWII, I haven’t read too much into it though so don’t know the exact story. \n\nJFK assassination."]}, {"title": "Malcolm X’s Final Words on Zionism and European Colonialism", "description": ".", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "April 8th", "description": "https://www.tiktok.com/@offthekirbministries/video/7352248568578706720?_t=8l9feK1680V&amp;_r=1", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "\"Book of the Antichrist\" by Aleister Crowley rocket scientist occultist magician and founder of JPL (became NASA) Jack Parsons was an interesting read", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "OBL and GB chillin", "description": "[deleted]", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*"]}, {"title": "Just a thought..Fentanyl is population control?", "description": "Maybe america has spoken to the experts. They see issues in the future based on chinas economic growth and dominance. Plummeting birth rates. Maybe they are taking a move out of chinas playbook, and focusing on themselves and their future. What if fentanyl was allowed in and being used for population control. If your worried about the 2 last generations that have no net worth, no ownership, and contribute to a tiny fraction of the actual workforce...maybe fentanyl is a move to remove these 2 generations and then replace them with a working class of immigrants. Ppl who will contribute to the economy, fill the dirty jobs, join the militaries and provide a more post 50s future for america. \"  with the work force and the global economy changing rapidly with a.i. i have always said covd was an incredible way to diagnose and trial whos needed and who isnt in this future economy. \"If u can work from home..ai can replace you\"\n\nThese 2 generations are very damaged thanks to big pharma, big food, tech in the \"indoor\" effect, and psychologically unfit to be the future of a nation.\" Maybe thats true. Maybe it isnt. But i atleast wanted to propose something like this.  I think the idea of all these countries being real enemies might be a sham. \n\nAnd when i think about ppl in america. I think of chickens on a conveyor belt headed towards the slaughter. Look at a drive thru line at walgreens or mcdonalds and youll get the same feeling, maybe these few generations were chewed up and spit out by corporate america, and now they r being replaced. \n\nWhen putin brags to oliver stone about how quickly he paid off his imf loans it felt like kind of a peak behind the curtain for me. \"maybe we are all on the same team\"\n\nWe know about u.s. collaboration w drug trafficking and foreign nations in the past. The advantages of fentanyl crisis...jobs...the entire crime, emergency and rehabilitation infrastructure surrounding it. Not to mention this entire crisis is a byproduct of the the sakler families greed ...this crisis is ridding society of \"non contributors\" ive lost lots of loved ones to fentanyl. I obviously do not support those beliefs. \n\nBut until the adults show up and take over my country. This seems to me, way too well oiled of a machine to not have our governemnts hand in it. Cia in cohootz w these traffickers recieving precursors and training from ccp chemists. \"Pablos son just said his father worked with the cia in a way thats eaaaay beyond any barry seal or kantra relationship\"\n\n130k people erased form this earth just last year. Meanwhile based off mit study we have had around 22 million future military, working and independent citizens come into the u.s. since 2018.. maybe this is the face and future of america..", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Yeah, China is the largest producer of Fentanyl, they ship it to Mexico and have them bring it across the boarder. China has been destroying Murica for a while now.\n\n- Art of War 101, destroy ur enemy without fighting.....communism is making a come back, y'all.", "LGBT is population control", "its population control but not in the way you think. it doesnt kill necessarily per se. it injuries the mind and poisons the family, which is worse than death if you think about it.", "The Chinese imports fentanyl through the Mexican cartels to weaken America, &amp; TikTok socially engineers the youth."]}, {"title": "I have noticed something weird about Instagram reels", "description": "I spend hours scrolling through reels and I never see scary ones during the day. However just as I'm about to sleep or when it's midnight and I'm scrolling through reels,for some reason I start seeing scary reels about ghosts or someone's horrible death and I always click not interested when I see them but, I still keep seeing them almost every night just as I'm about to go to sleep. The weird thing is that I spend about an hour scrolling through reels during the day and never see anything even slightly scary and I only spend about 10 minutes scrolling through them before sleeping. Many people on reddit and quora have reported the same issue and I have asked my friends about this and many of them have told me that this happens to them too. So my theory is that since instagram knows their users timezone and location so that they can show you creppy stuff during the night and since most of their users are teens they get scared and keep scrolling. This is a really shitty thing to do tbh since this can really fuck up somebody's sleep schedule or traumatize them especially if they are young", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "&gt; I spend hours scrolling through reels\n\nstop this", "They have a behavioral profile on you so they can continue advertising to you. The conclusions they can draw just from your scrolling/watching habits alone have big implications.\n\nStart watching something completely different around those times. Pick something really random that you don't watch at all and start doing it before bed. Count how many days it takes for them to start putting those things in your feed.\n\nOr better yet, don't go on instagram at all since they're selling your data to advertisers.", "[deleted]"]}, {"title": "Of course Microsoft patented this", "description": "Link:  [WO2020060606 CRYPTOCURRENCY SYSTEM USING BODY ACTIVITY DATA (wipo.int)](https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606) \n\nhttps://preview.redd.it/ghlb5hurfvrc1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=a3e8eb367d45cd0201952b5c0ef9b3f70c3f8cfd", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "&gt;Human body activity associated with a task provided to a user may be used in a mining process of a cryptocurrency system.\n\nInteresting to imagine mining crypto just by living correctly (according to the machine server) lol"]}, {"title": "Google searches about a business ONLY listing result for said business's website", "description": "Over the past year I've had this issue with a few different business's or organizations. \nI am unable to pull up links to second party sites featuring unbiased information about a particular bus or org as if said bus's and org's are paying Google to intentionally arrest those searches.\n\nex: \"are Ralphy's products legitimate?\" pulls up hundreds of pages with links ONLY to FAQ pages on Ralphy's website.\nYou can't use negative modifiers to filter out 'Ralphy's' because you won't pull up any info and if you try to omit, say 'www ralphy's / faq' then you will start pulling up links to other variations like 'www ralphy's / faq /help' each of which need to be manually filtered as discovered.\n\nDoes anyone have a work around?", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "First off I would say stop using Google for your searches try a search engine like qwant.com maybe", "It has to do with the websites SEO, and Googles Page Ranking Algorithms.  \n\n\nIf other people arent optimizing their websites,  or creating content that Google considers valuable,  and if they dont have backlinks to help gain \"Page Authority \" then those sites will be pushed down the list on SERPS(Search engine results page). \n\n\nThings you can try:\n1.Search in incognito mode (your cookies wont be used to generate search results).\n2. use a VPN. (Some SERPS are different depending on the area of your ISP.)\n3. Search from different devices (desktop, mobile, ipad)  SERPS are displayed differently on devices. \n4. Use other search engines: Yandex, Etc", "I don’t know.  Just tried your example, and did not experience what you indicated.\n\nNever had that problem.  I think your search function is scuffed", "1984."]}, {"title": "Apple understand that manufacturing cars is extremely hard", "description": "Apple is sitting on 162 billion and didn’t have the balls to launch an electric vehicle after working on one for years.\n\nXiaomi, also a smartphone maker, sold 120,000 vehicles in 36 hours.", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "Ah yes. A conspiracy.", "the united states does not have the power grid to charge millions of electric vehicles.... consumers have figured that out thats why 100s of thousands of all makes are sitting on dealers lots.... no one wants that crap. and apple has seen that.", "I was ready to come in here and say \"I bet it's cheap or unsafe or spyware or they're lying in the ads and specs\".\n\nI'm still ready to say that.\n\nBut also, it's a cool looking car and way cheaper than I'd expect. I feel conflicted now.", "they can, its just they can't mark it up to ridiculous prices."]}, {"title": "P Diddy Cheetos/pink cocaine - Yummy video Justin Bieber", "description": "Sooo just throwing this out there. Yummy video had a lot of pizzagate conspiracies attached. Including that the drink Bieber had was andrenochrome. In light of recent news with p diddy and that he had ex smuggle pink cocaine for him, i rewatched the yummy video and wondered if the drink he was holding was actually symbolizing pink cocaine dissolved in water. This would explain the elongated chin and “tripping” sensation that was implied. \n\nI also never noticed the plate of Cheeto puffs on the table - puff daddy?? \n\nThere’s no doubt in my mind that Bieber was abused but I just wanted to see if anyone else has made connections in light of everything coming out? \n\n", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "The pink cocaine is toosi. It’s a designer drug popular in those circles. \n\nYes it does make you trip.", "What damn video. Where to see"]}, {"title": "X-Man is like chip off Jack Parsons block", "description": "", "comments": ["###[Meta] Sticky Comment\n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does not apply*** when replying to this stickied comment.  \n\n[Rule 2](https://www.reddit.com/r/conspiracy/wiki/faq#wiki_2_-_address_the_argument.3B_not_the_user.2C_the_mods.2C_or_the_sub.) ***does apply*** throughout the rest of this thread.\n\n*What this means*: Please keep any \"meta\" discussion directed at specific users, mods, or /r/conspiracy in general in this comment chain ***only.***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/conspiracy) if you have any questions or concerns.*", "SS: Jack Parsons dedicated his life to manifesting the Antichrist here. Elon looks to be continuing their \"Great (shitty) Work\""]}]