[{"title": "Why Weak College Guys Have Megyn Worried About the Future of Mankind: “Who are the young, college girls going to sleep with? Because they’ve run out of real men.”", "description": "", "time": 1711921762.0, "comments": ["life pro tip, never listen to anybody who tries to decide what makes a \"real man\"", "Real men have alao run out of real women.", "I have degrees and 5 combat tours.  Education and masculinity don't need to be mutually exclusive.", "Lmao, has she seen college girls these days? No wonder the guys don't want them.", "12 Years Navy and a degree.  Send noods...", "Uh, the new \"Conservative\" fear is that 19 year old girls won't have enough college guys to have casual sex with? Okay...", "What a great way to boost self confidence in young men.", "Oh how stunning and brave.\n\nThere's nothing conservative about encouraging unmarried men and women sleeping together.\n\nThis is why the GOP perpetually loses", "The girls in their 20's will sleep with men twice their age for sake of accessing the stability, wealth and perks of a more established older man who can lavish them in the manner to which they feel entitled. Meanwhile, younger men either go off to die in battle or make something of themselves over the course of their years, gradually becoming increasingly attractive to women as they gather wealth and prestige. This has been the way of things since the dawn of time.", "Sugar daddies?", "De masculine and feminization of the male children has consequences when they grow up. The liberal feminist lies created this problem and they can't fix it.", "&gt;Girls, do not look for a man who sits cross-legged beyond age 10, or one who is wearing a mask unless he is elderly and has a disease\n\nI guess she has something against firefighters too."]}, {"title": "Federal Judge Has Bad News for Hunter Biden, Says There’s Zero Evidence His Charges Are Politically Motivated", "description": "", "time": 1711904097.0, "comments": []}, {"title": "Happy Resurrection Day!", "description": "", "time": 1711903106.0, "comments": []}, {"title": "Antisemitism Goes Hand-in-Hand With Societal Decay", "description": "", "time": 1711903406.0, "comments": ["I would say having a completely corrupted government who hates their own citizens does a lot more to decay society. "]}, {"title": "Judge's Daughter Linked to Democrats Raising $93 Million Amid Trump Trial, Recusal Calls Intensify", "description": "", "time": 1711902417.0, "comments": []}, {"title": "Damage Control: Now Biden Wishes Christians a Happy Easter", "description": "", "time": 1711933089.0, "comments": ["I can’t remember if that was last year or two years ago when the Easter bunny had to redirect Biden because he got lost in front of the White House.", "Too late, asshole.  Christians received and understood your message, as intended, loud and clear, and we will be voting accordingly in November.", "With a bunny. Meanwhile, the Whitehouse has told the kids making designs for the Easter Egg Roll that no religious symbols or words are allowed.", "The resident is a sick POS", "**Shit stain back pedaling as fast as he can**", "Are we still pushing this non-story?\n\nBiden didn't create this day and place it on Easter.\nIt's existed for at least 10 years and it happened to fall on Easter this year. Y'know... cause Easter isnt on the same day each year. In fact next year this won't happen.\n\nWe make conservatives look bad when we try and spin stuff like this.\n\nIs it good? No of course not. But the insinuations being made about it are clearly false. This is not news.", "I think he is so fucked up he genuinely got the messages backwards. He meant to send the Easter message and then the trans message.", "The blasphemy coming from this clown, it will always be Easter...", "He wished Christians a happy Easter on Easter. What is the outrage here?"]}, {"title": "3 months and 28 days: Leftist events clog calendar as White House faces backlash over Easter announcement", "description": "", "time": 1711909208.0, "comments": ["He deserves it."]}, {"title": "It kinda makes sense", "description": "", "time": 1711937649.0, "comments": []}, {"title": "Disney-DeSantis settlement humiliates past pro-Disney headlines: Media 'as usual' were wrong", "description": "", "time": 1711933033.0, "comments": []}, {"title": "Who is burning books now, left?", "description": "", "time": 1711931681.0, "comments": ["Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*", "I am going to council caution on this story.    There is a lot of local scuttlebutt and some circumstantial evidence that a certain local \"firebrand\" pastor may be behind this to generate attention for his own cause.   There have been other vandalism incidents where conveniently that day was the only day none of his security cameras were  working.      \n\n\nWhile there is an obvious attack on Christianity happening these days, I am not convinced this particular one is genuine.   I will wait for more facts.\n\nI recommend the same for you.", "Why is there a trailer full of bibles?  Truck, van, covered trailer makes more sense.", "Christians aren’t Muslims. The Bible in and of itself if just a book, it is the content within that is sacred.", "They will hate you because they are of this world and you are not.", "I wonder if Merrick Garland will pick up his phone for this one…\n\n.. what am I kidding, he doesn’t care.", "Their push to delete Christianity will not stop at Christianity.", "Look at the bright side. Someone just gave away a free trailer. Who does that.", "All they need it the vin # and go to the dmv", "Track where the trailer came from. This one looks new enough to have serial numbers. Trailers aren't cheap so its pretty common practice for there to be records of serial numbers."]}, {"title": "Archbishop Carlo Maria Viganò calls for the excommunication of Joe Biden from the Catholic Church after Biden Proclaimed Easter Sunday Transgender Visibility Day.", "description": "", "time": 1711973924.0, "comments": ["Do it; stop talking about it. Ex-communicate him."]}, {"title": "CNBC: Voters Want Trump to Combat Runaway Inflation", "description": "", "time": 1711900565.0, "comments": ["I think this is the main issue drawing independents and swing voters to Trump.", "Unlike Biden, the Donald understands basic math, economics AND he’s financially literate. Find me one Dem who can say the same on any of those, I’ll wait.\n\n**Bidenomics** lolol"]}, {"title": "Forget Mike Johnson: Why would ANY Republican want to be House speaker?", "description": "", "time": 1711902819.0, "comments": ["I'm just as enthusiastic about swamp-draining as the next conservative....but Rome wasn't built in a day....and the dysfunction on the Republican side of the House is becoming increasingly glaring. A half dozen arch-conservatives with an implacable hostility to virtually *any* legislative agenda save their own narrow vision might just help derail our election prospects in November.", "Can't be that hard if you at least try to not sell out the people who put you there... ", "So you too can get impeached by mostly democrats voting with a few disgruntled republicans!\n\nOh wait...", "If they had an ounce of patriotism or service to their country. Anyone in the Freedom Caucus would be proud to serve.\n\nLet the shills cry and give it to us then."]}, {"title": "Trump claims Mexico’s demands are proof of ‘lack of respect’ for Biden - Washington Examiner", "description": "", "time": 1711903456.0, "comments": []}, {"title": "‘It’s All Propaganda’: GOP Senator Says Trump’s VP Pick Will Be A Surprise", "description": "[deleted]", "time": 1711918820.0, "comments": ["I’ve said for a long time it’s going to be a dark horse candidate. The majority of people had never even heard of or seen Mike pence before he was selected. That was strategic and we’re going to see it happen again.", "He'll name Eric Trump to be VP.", "Wingnut for VP?  Crazy times…"]}, {"title": "Trump PAC Creates 'Biden-Mart' Grocery Store, Shows You Mind-Blowing Price Hikes Since 2021", "description": "", "time": 1711934459.0, "comments": ["But I thought inflation was transitory…."]}, {"title": "Trump Responds to Mexican President's 'List of Demands' to Joe Biden", "description": "", "time": 1711947093.0, "comments": []}, {"title": "Pro-Palestinian protesters interrupt Easter Vigil service at St. Patrick's Cathedral in NYC", "description": "", "time": 1711936137.0, "comments": ["♫ Try that in a small synagogue ♪♫♬"]}, {"title": "The man who caused the 2008 financial collapse that hurt millions of Americans is given a $10 million bond, while the man that had ZERO victims and hurt no one was given a $455 million bind. It makes no sense!", "description": "", "time": 1711968612.0, "comments": ["Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*", "Madoff didn't cause the financial collapse. He was the biggest fraudster in history, probably, but that scheme didn't move the needle on the worldwide economy.", "Bernie Madoff didn’t cause the 08 collapse, greedy banks did.", "Well, I think I Madoff was a federal prosecution.", "Good lord is this a lot of incorrect information in one post. Do better, OP. \n\nBernie Madoff (who, I always enjoy mentioning, was a prolific democratic donor) had nothing to do with the financial collapse. Also, release bail and an appeal bond against a judgement are not remotely the same thing.", "Wow, if you are going to make such parallels, at least get the facts right.\n\nMadoff did not cause the 2008 crash.  His ponzi scheme unraveled _because_ of the market crash.\n\nBut he did defraud a small group of rich investors out of _billions_ of dollars.  That should be the comparison angle.", "While Madoff's ponzi scam was big, that's not enough to crash an economy.  The sub-prime housing loan market collapsing after Bill Clinton normalized it caused the crash.", "This whole thing makes more sense once you realize that it was never about punishing Trump for a legitimate reason and more about trying to bankrupt Trump so that he couldn’t run for POTUS.  These people will stop at *nothing* to remove Trump because *they* are the actual fascists, *they* are the authoritarians, *they* are all the things they have accused him of being.  \n\nTrump was right; it was never about crushing Trump. It's about crushing *us*, and Trump is just in their way.", "The right should be 100% unified behind Trump on this. Actually it’s really not even supporting Trump, it’s supporting the law and what’s right.", "Everyone in this thread talking about how madoff didn't cause the crash is pulling a \"but it says well regulated militia!\"\n\nThe more time you spend focusing on the extraneous fluff the more you get distracted from the actual point.", "[deleted]", "It makes total sense when you understand that someone was butthurt because she didn't win the election. There has been a full court press on him since he announced running.", "Well yeah but orange man bad, you see?"]}, {"title": "Who Put Marjorie Taylor Greene In Charge?", "description": "", "time": 1711915341.0, "comments": ["Leadership is a rare thing among Congress these days", "Her constituents then House leadership.", "She is another fan of fake it till you make it, only problem is no one else is stepping up  point out how to do it right.", "Conservatives", "She is the \"leader\" the maga deserve.", "I stopped at \"far right Republicans.\" All Republicans should be firm conservatives without any give. But they aren't, so the squishy ones call the conservatives \"far right.\"", "The eclipe/ earthquake specialists", "Funny I never hear liberals say \"the far left\". When they must have 100 different groups that are so far left it's crazy. I mean my God, you could call all progressive liberal college students far left", "[deleted]", "She  just has big balls and is loud. Compare that to the lethargic weak RINOs speakers we have had in the past.\n\nMTG for speaker. She couldn't do any worse and, as a bonus, she will annoy the left and the RINOs.", "The amount of her power in Washington depends on how much other House members are willing to listen to her. If democrats take over again, they could definitely strip her committee assignments like they did before. I live in her district.", "Leaders don’t get put in charge they emerge.", "We did.  She’s brilliant."]}, {"title": "“I’m tired of deleting death threats”: Claudia Sahm on the inconvenient truth about America’s economy - Americans have never had it so good, but they refuse to admit it", "description": "", "time": 1711949357.0, "comments": ["So she is saying we are gaslighting ourselves?", "Two years ago I paid $5 to $7 for a rib steak. Today a rib steak costs about $12 to $28.\n\nI have to ration gas. \n\nCan't afford to eat out.\n\nI was doing great under Trump.", "I just paid $18 for a hamburger, fries, cup of chili, and a drink. Doesn't feel so good lol.", "If this was said in 2016-2019 I'd believe her.", "“rEcOrD cOrPoRaTe PrOfItS”, at least that’s the drum the college educated liberals keep beating.", "Yes, my overall wealth has increased by 35% since 2019.\n\nThat wealth is from my house increasing in value since 2019. It is the largest asset me and my family have.\n\nHere is the kicker, I can’t use that increased wealth to buy groceries that have gone up 50-75%. I can’t use that wealth to go on vacation. Hell even if I were to take out an equity loan, the interest rates right now would send me to near bankruptcy.\n\nYes, 401k’s have gone up, home values have gone up. Anything large asset wise has gone up. Yet if you were able to make you bills and still have money left over for fun, you were doing good. Now all the extra money average families have is going to items they need to stay afloat and to survive. Food, gas, increased insurance, health insurance.\n\nThe only people that got ahead on this economy were the rich that already had money, stocks, 2&amp;3rd homes.\n\nThis article is a slap in the face to the middle class. ", "Bwahahaha!!", "The brainwashing is working on some.  Over the weekend my elderly mother parroted this view despite the fact that I didn’t bring anything up (I refuse to talk politics with family on the left… they are religious in their views and it’s no longer a discussion but rather a always a fight and I’ve had enough of that)\n\nShe doesn’t drive has a very limited diet and rarely leaves home  so it’s hard for her to understand but I found it interesting that she said basically the same stuff.\n\nFinal thought.  Biden quietly loosened up regs and permits on oil production.  He realized the horrible effect of his policies on inflation and how that would destroy democrats re election plans.  \n\nWatch the month over month below.  Obviously production was down during COVID but it continued to be down after COVID and well into his second year based on his green policies…. But then it goes up sharply.  No fan fare, no discussion that Trump was right but oil production in the US has been (over the last two Quarters) highest in history.  \n\nIt will stay that way until the election btw… then they will fuck you again.  But next time you DO wanna fuck with a lefty point out this interesting fact that they never care d about global warming (and rarely discuss it now) but only about power\n\nhttps://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&amp;s=MCRFPUS2&amp;f=M", "Compared to 200 years ago, I agree, but compared to 4 years ago, I completely disagree. I have 7 kids and a stay at home wife. If anyone would like to review food costs, I'm all in. It used to cost me around 750 a month in 2019 ( our meat has always been bought from a local farmer we get 1 whole beef, 2 whole hogs, and 200 pounds of chicken around $2k/yr) now for the same grocery run its almost $1800.00 and our meat has increades about $250. The farmer tries his best to keep costs down, but he has a family he needs to support too. Bidenomics is hard at work and draining the America people bank accounts.  And let's not even get into health care costs from 12 years ago. But yeah, we're all doing pretty well.", "I'm so sick of seeing articles like this, and they will only increase as the media does everything it can to help Biden get re-elected. \n\nEvery day I see another one of these linked on Reddit. The headline is always something along the lines of \"The economy is great under Biden, trust us, not yourself\". \n\nThe same fools telling me I should feel great about the value of my home and 401k being at record highs then say that homes are priced too high for Americans to buy and that a crash is coming. They say the stock market is at record highs under Biden, then say corporations are greedy and need to take a giant hit (which would sink their stock values). \n\nThe only things that haven't gone up 10%-20% over the last couple years is my income and my mortgage.", "I actually have to budget so I know when I am paying almost double in groceries a month than I was 4 years ago that your full of shit. \n\nEither that or you never track what your maid buys for your groceries", "The problem:\n\n[https://www.youtube.com/watch?v=L6aA3fiwTs0](https://www.youtube.com/watch?v=L6aA3fiwTs0)"]}, {"title": "Dem clients of daughter of judge in Trump trial raised $90M off case", "description": "", "time": 1711976280.0, "comments": []}, {"title": "Yes, Michael Bitchless, that's EXACTLY what you're supposed to do... ", "description": "[removed]", "time": 1711951193.0, "comments": []}, {"title": "Protesters screaming 'Free Palestine' ambush Easter Vigil at St Patrick's Cathedral", "description": "", "time": 1711905262.0, "comments": ["Someone is going to end up with a broken nose."]}, {"title": "El Paso Judge Releases Migrants Accused in Border Stampede on Easter Sunday", "description": "", "time": 1711930850.0, "comments": []}, {"title": "'Rain tax' in Canada? Toronto faces anger over tax plan", "description": "", "time": 1711908483.0, "comments": []}, {"title": "Bidenomics in action.", "description": "", "time": 1711973915.0, "comments": []}, {"title": "I'll keep it.", "description": "", "time": 1711935273.0, "comments": ["This is great and all but we should focus on keeping this a sub dedicated to discussion about conservative politics and their importance to American Liberty."]}, {"title": "How to Explain the World Economic Forum’s Agenda to Idiots.", "description": "", "time": 1711910499.0, "comments": []}, {"title": "Where is tha MONEY🤣🤣🤣 ???", "description": "", "time": 1711912331.0, "comments": ["Why is this a gif?", "Didn't he also give out a stimulus package as President during Covid? Everyone dubbed them Biden Bucks?", "Bud, congressional republicans block him giving money to Americans. The only thing our politicians agree on is that we are less important than Ukrainians.", "Nah, this isn't accurate.  Put the vaccination mandate he signed in front of him on the right.  That's what he does when people in this country need him, leverages that need into compliance with whatever authoritarian agenda his handlers have at any given time.", "Easier to launder in Ukraine or Iran."]}, {"title": "Statement from President Joe Biden on Easter", "description": "", "time": 1711910659.0, "comments": ["Making sure this was overshadowed by the trans visibility statement so we know the order of importance to them.", "Good for him for saying at least this much.  Hopefully it was sincere and from his heart.", "He didn't write this. A staff member did. Assclown has  idea what day it is.", "Lol too late, the damage is already done. He's not fooling anyone", "Notice how he didn't mention America at all.", "\"Devout catholic\" Joe Biden", "Empty words from faux Christian\n\nwhy is this being downvoted?  Is the word faux too advanced for r/conservative?\n\nYou can't judge a mans heart, but when you support abortion up until birth, are celebrating trans rights and lgbt+ relationships, and other radical far left policies that are aboustely anti-biblical or How about choosing to pretend one of his grandkid doesn't exist. it's not hard to make an educated guess.", "Aw man, I was hoping he'd announce that Dylan Mulvaney is the new Commissioner for the Ministry of Truth.", "Just don't put these kinds of ideas on our White House Easter eggs. That's just wrong. \n\nEnjoy the 2x higher grocery bill with your family. Ze appreciates it. \n\nLove Joe.", "Ramadan has always primarily been a holiday about LGBTQ+ rights, why not just make that holiday the trans day of awareness?", "I'd wish they'd proclaim trans visibility day on a Muslim holiday and see how they'd react to it. Biden the fake catholic at it again attacking Christianity...", "is this a joke??? I can't tell anymore"]}, {"title": "Fury as FDNY firefighters are forced to remove Stars and Stripes honoring 9/11 heroes after Democrat lawmaker branded it a 'fascist symbol'", "description": "", "time": 1711918289.0, "comments": ["So, per the article, some rando complains to the city council about the flag. A staffer for a city council person then reached out to the fire department and asked if that breaks any rules (which is what they should do). When it turns out that it does break *a fire department* ban on *any* modified American flag, they’re told to take it down. In the end, the ban is lifted and the flag stays. \n\nSeems like everyone did their job right here? Doesn’t matter where you are on the political spectrum, someone is gonna be a pissed about something and this time it actually went through the steps and was resolved. \n\nAlso that headline is pretty disingenuous.", "It’s interesting that no one seems to even know that desecrating the US flag is illegal and disrespectful. But the Russian bots like to start crap.", "People.. relax and read the article.\n\nThe flag stays. They removed it for a brief period, and were allowed to put it back on.", "So for people asking how an American Flag could be considered a fascist symbol:\n\n1. It wasn't an American Flag, it was a \"Thin Red Line\" flag.\n2. The \"Thin Red Line\" flag is derived from the the \"Thing Blue Line\" flag, a flag that emerged from the \"Blue Lives Matter\" movement around 2014.\n3. With that flag being controversial, by extension the flags derived from it are controversial.", "All derivative versions of the stars and stripes disgust me", "Ah, that’s not the Stars and Stripes.  I respect your viewpoint but technically the flag violates the codes for handling or using the US flag. Would it not be better to fly our official US flag alongside the official FDNY flag.  Is that not sufficient?", "This is insane that it was even talked about let alone tried to be enforced...", "Fascism is calling a symbol fascist and banning it. This is an attack on freedom!!.", "\"As nightfall does not come all at once, neither does oppression. In both instances, there is a twilight when everything remains seemingly unchanged. And it is in such twilight that we all must be most aware of change in the air - however slight - lest we become unwitting victims of the darkness.\"  \n\\- Justice William O. Douglas\n\n&amp;#x200B;\n\nWe are now in the darkness, but still unaware.", "Democrats are a disgrace to this country.\n\nThrow up Republican sign in the window of your house. Missing the sign? Put out your own fire.", "The American flag honoring firefighters is fascist?", "How about, “No”?", "Democratic Socialists gonna Democrats Socialist", "Tell them piss off! If they they think that go to Russia or North Korea", "As much as I disagree with protocol violations to the American Flag, any Marxists/Socialists/Communists/Anarchists (apologies for the duplication) who thought that banning the FD version is outta their freakin’ minds and can f*** right off appropriately. \n\nTime to push back upon this abhorrent Clown World and to start restoring basic norms of civility and the tenets of the Constitution.", "When is enough finally enough?", "Let newyork have all of its cake", "So simply refuse to do so.......", "So some rando New Yorker rolled up on a bike and acted like they worked for some councilwoman and told them to take the flag off the truck and people are getting fired up over it?\n\nOr, what happened, exactly?", "Individual politicians have ZERO - repeat ZERO authority over individual units of government. She should have gone to the Mayor or at the least the FDNY commissioner. Otherwise tell her to go pound sand.", "Yet I bet they wouldn't have a problem with rainbow or BLM flags...", "Why are these people complying???", "Jesus", "replace it with pride flags\n\ndownvoters lmao /s"]}, {"title": "Kennedy Eyes Libertarian Lifeline in Ballot Battle Bonanza", "description": "As someone who considers himself a libertarian conservative, I’m not sure what benefit the libertarian party sees ( other than using RFK as a place holder since it doesn’t have its own candidate this year) in giving it’s election spot to a candidate who has just chosen an extreme Leftist who is opposed to almost everything true libertarians stand for!??\n\nThis makes little sense.\n\nAs a libertarian…I will never support a ticket with a hard core leftist on it!!\n\nThese almost guarantees that RFK pulls a LOT more votes from Biden than Trump.", "time": 1711935249.0, "comments": ["RFK is not right-leaning or libertarian at all… what on earth?", "His VP pick was the obvious attempt to attract more left wing voters and/or repel more right, while the libertarian party is less of a sure thing and seems more a means of getting more support since he may struggle to end up on enough ballots otherwise.\n\nLibertarians are quite repulsive to pro welfare state economically left, but they have some appeal to socially liberal left and certain single issue voters like the pro gun and/or legal weed crowds.\n\nAt the same time, they appeal to the economically right who aren't socially conservative. But... Trump himself fits that bill to an extent. He is not remotely plausible as a compassionate/Christian social conservative, and his foreign policy leans isolationist as is often preferred by libertarians.\n\nI'm not sure how many of each type there are and to what extent they lean dem/rep this election, but we'd need some sense of that to judge how this influence the votes RFK pulls.\n\nGenerally it seems like third parties tend to favor Republicans by pulling from democrats, but it's harder to say with libertarians specifically."]}, {"title": "Navy makes shocking aircraft carrier decision while China threat rises", "description": "", "time": 1711975129.0, "comments": ["This author leaves out a lot of vital context.  \n\nI am a big proponent of keeping our military fully funded and I think it's a mistake to delay production of the new carriers.  The works is a far more stable and safer place when the United states has a military of overwhelming capabilities.  We want our military to be stronger and more advanced than all of our adversaries combined. \n\nThat said the context that's missing in this article is\n1. these 2 new carriers were slated to replace carriers that are still in service and still far more powerful and advanced than anything China (or anyone else)  has. \n\n2. The carriers China has are not true carriers.  They are what is called jump carriers, sometimes referred to as mini carriers. They are much shorter in design and their flight deck is built with a sloped ramp to get aircraft air borne. Because of these design differences they only hold a small portion of the aircraft.  I believe it is 17 combat fighters. In comparison our old carriers that are slated to be replaced hold 90. The new ford class holds 137. 1 of our old ones equals over 4 of theirs in capability without even considering how much more technologically advanced or farther and fighter craft are. The f22 is virtually invisible on radar with a cross section of less than .0001/square meters.  That's smaller than a bubble bee. They can not be shot down with guided munitions.  Line of sight spray and pray is their only risk.   The fuijan will be China first true carrier and while that is a threat to be taken seriously, they don't have the anything comparably to the f22 to stick on it. It's going to be armed with technologically outdated fighters.  \n\n3. In contrast to China, the United states currently has 11 true fleet carriers. 10 Nimitz class and 1 ford class. And not just the carriers, but entire carrier strike groups comprised of over a dozen war ships and several dozen support ships. In addition to the fleet carter's we have an additional 10+ light carriers. \n\nIn conclusion, while on the surface it is concerning to see China investing to expand their military capabilities while we show down our plans to update our fleet, we don't need to freak out.  The difference between the militaries is like comparing a random high school jv team to the Dallas cowboys of the early 90s, 49ers of the 80s our patriots of the 2000s.  China's new carriers start to close the gap, but the gap is still the size of the grand canyon.", "Woman who spent entire career in military industrial complex wants more $15,000,000,000 ships. News at 11."]}, {"title": "Left Wing Logic", "description": "", "time": 1711899697.0, "comments": []}, {"title": "House Republican suggests US should nuke Gaza in resurfaced clip: ‘Get it over quick’", "description": "", "time": 1711928366.0, "comments": ["Make of this what you will: “We shouldn’t be spending a dime on humanitarian aid. It should be like Nagasaki and Hiroshima. Get it over quick.”\n\nNot the best idea to use two cities we nuked as a metaphor. Even if he didn’t mean using a nuke, the optics of using two cities we *did* nuke in a metaphor is bad.", "I mean the entire region won’t take in Palestinian refugees for a reason. And they’re all Muslim Arab countries. \n\nHe doesn’t explicitly call for nuking them. In the article he clarifies what he meant was resolving the conflict as expeditiously as possible militarily. A metaphor.\n\nIdk you can either accept he meant what he says he meant or continue to believe what those words mean to you.\n\n*“As a child who grew up in the Cold War Era, the last thing I’d advocate for would be the use of nuclear weapons. In a shortened clip, I used a metaphor to convey the need for both Israel and Ukraine to win their wars as swiftly as possible, without putting American troops in harm’s way,” the statement read.*\n\n*“My reasoning was the exact opposite of what is being reported: the quicker these wars end, the fewer innocent lives will be caught in the crossfire. The sooner Hamas and Russia surrender, the easier it will be to move forward. The use of this metaphor, along with the removal of context, distorted my message, but I fully stand by these beliefs and stand by our allies.”*", "Russia surrender? You know this dude is fucking clueless.", "Why is no one talking about detention centers? If the Israelis removed these civilians from the battlefield they could declare free fire zones and stop using the Vietnam handbook. It seems pretty clear to me that Bibi has no intention of winning this war quickly.", "[deleted]", "The left thinks every problem can be solved by throwing money at it and the establishment right thinks every problem can be solved by throwing bombs at it.\n\nBoth have earned the right to not be listened to anymore.", "Well for us folks who still studied history in school and weren't subjected to 'progressive' interpretation of historical events, it was widely understood that Truman's decision to use the A bombs on Hiroshima and Nagasaki were intended to bring the war to a speedier conclusion and to actually save many thousands of lives on both sides by avoiding a prolonged conflict on the Japanese mainland.\n\nSo the metaphor works for me.", "Fake news. Misleading title. He did not call to nuke Gaza.  "]}, {"title": "The Case for Trump’s Foreign Policy Leadership", "description": "", "time": 1711979683.0, "comments": []}, {"title": "$2 Million Law Suit for Police Using ‘Excessive’ Force in Jan. 6 Beating", "description": "", "time": 1711925958.0, "comments": ["Unless they get it outside of DC circuit, they have no chance."]}, {"title": "Biden Says His Next SCOTUS Nominee 'Will Be An Illegal Immigrant, I Mean Undocumented'", "description": "", "time": 1711971394.0, "comments": ["This is satire…", "Oh thank God, I forgot it’s April Fool’s Day.", "Don't post bullshit, not even on April 1st.", "No, the new term is \"newcomer\".", "I’d absolutely believe he would do something like that. You’re supposed to trick us today…so maybe say something like “Biden plans to get tough on crime” or “Biden now wants to help his own country…America”.", "It’s hard to tell if this is satire bc I wouldn’t put it past this weird regime.", "It should be tagged as satire", "And the next secretary of defense will be a terrorist", "\"Satire\"", "Biden says:\n\n“Go piss girl, I mean they”", "He could technically do this. There is no requirement in the constitution to be a SCOTUS judge. Not even citizenship is required.", "Great.\n\nNow we gotta deal with fake news IN HERE all day today.\n\nI'm out.", "Sometimes satire is hard to distinguish from reality.", "April Fool's Day aside, I wouldn't be surprised at all if  he actually had said that.", "I understand it April 1st, but should we give them any ideas?", "That would be good, because they would never get confirmed, and the opening would be waiting for Trump.", "We order the term “invader.”", "Not far from the truth.", "Don’t think for a second he wouldn’t if he could", "As long as they \"identify as Americans\" they're OK, right?  Right??", "DEI... come on man!", "If it wasn’t today, I could have taken this seriously", "It's a little concerning that this could pass for reality.", "I know it's April Fools day, but you never know what the old fool may pull.", "&gt;\"How can we call ourselves a nation of laws when millions of non-citizens are denied the opportunity to assess the constitutionality of those laws?\"\n\nThis is barely hinging on satire at this point...absolutely terrifying. Liberalism reaching a bizarre \"end point\"...ending with liberal fascism.", "&gt;Editor's Note: Today is April 1, 2024.\n\nYou know, if not for that little bit at the bottom, I would 100% believe that the Biden Regency Council would try to pull a stunt like that.", "Undocumented American. Transgender multi national", "If you don't vote for me... then you ain't illegal!", "Republicans have been crying about immigrants taking their jobs since I was a kid in the 70s. Without immigrants we would not be such a powerful nation! Bring on the immigrants! We will need them in the coming fight against Russia and China", "Ah the free beacon, one of the few “news” organizations with the bravery to mix satire pieces with real journalism.  You could almost call it fake news, to coin a term.", "Well if he appoints another one it will have to check multiple boxes and will only be White if they are LGBTQ or Jewish."]}, {"title": "'SNL' mocks Donald Trump Bibles ahead of Easter Sunday", "description": "", "time": 1711904453.0, "comments": ["Everyone in the \"entertainment\"/media industry has to be praying that Trump wins so they can continue to coast using him for content.", "They mock Trump for this, meanwhile ignore all the free material Joe and the hoe have been cranking out all this time.", "There is so little to laugh at on that show nowadays...a ghost of the Will Ferrell era, to be sure. Also, awful Trump impression, almost as bad as Alec Baldwin's was", "Does anyone still watch SNL?", "Aren’t they clever .. SNL hasn’t been funny for over 20 year and. Then  some", "I guess Joe Biden standing next to Obama and a predator selling selfies for $100,000 each is ok, though.", "People still watching SNL?", "They did this last Easter too", "Commies believe in the abolishment of religion.  Not surprising.", "I didn’t like it, but Phil 1:18 🤷🏻"]}, {"title": "Mass deportation of migrants seen in Russia after concert attack. This is the way", "description": "", "time": 1711913242.0, "comments": ["Honestly, it’s not a good time to be in Russia because they like to take their immigrants to arrest them and charge them with being spies and then trade them.", "And they will be headed this way.", "In an absolute totalitarian state this is the way. Remember totalitarian is what a government wants but what the people must resist. Security is the responsibility of state, sure. The Russian sovereignty, like the American sovereignty, is not acting responsibly to the people. They’re just acting irresponsibly differently.", "Let's not use Russia as an example to look up to.", "Rare Russia W", "I’m honestly amazed that putin isn’t bussing them to the frontlines. ", "how come they can do this and we cant?", "buttttt what if those people get their feelings hurt?"]}, {"title": "Harvard applications plummet in potential harbinger for other schools", "description": "", "time": 1711946781.0, "comments": ["&gt;While Harvard had nearly 57,000 applicants for the class of 2027, applications declined more than 5% to about 54,000 for the incoming class of 2028. \n\nStill a bit above the 37,000 applicants Harvard had 5 years ago. If anything I'm guessing applications will decrease around the US as institutions continue to re-instate SAT/ACT requirements.\n\nAlso I'm sure they will cry into their pile of cash ($53 billion endowment) as we argue online", "The class of 2018 had 34, 295 applicants.\n\nClass of 2019 had 37, 307. \n\nClass of 2020 had 39, 041.\n\n2021 - 39, 506. \n\n2022 - 42, 749. \n\n2023 - 43, 330. \n\nClass of 2024 - 40, 428. \n\n2025 - 57, 786. \n\n2026 - 62, 221. \n\n2027 - 56, 937. \n\n2028 - 54, 008 &lt;--- this is where the article states it \"plummets\". \n\nAdmission is still greatly up from decade ago or even 4 years ago, and hasn't \"plummeted\". This is a misleading nothing burger. \n\n\n[source](https://oira.harvard.edu/factbook/fact-book-admissions/)", "good.  we dont need more liberal arts degree holders."]}, {"title": "Ex-CENTCOM Commander: ISIS Threat To U.S. Becoming Serious Because Of Biden’s Foreign Policy | The Daily Wire", "description": "", "time": 1711946545.0, "comments": []}, {"title": "Hope everyone had a great Easter! ", "description": "[deleted]", "time": 1711934630.0, "comments": ["Is that the bunny talking …or the old guy?\n\nI admit….it’s hard to believe that old guy is for real …or just a propped up corpse from Weekend at Bernie’s.", "Come on man, Joe just needs some directions.", "Oof. Look at that facial expression. Confusion abounds.", "Plot twist: the bunny is transgender."]}, {"title": "The children yearn for the Dairy Queen", "description": "", "time": 1711905248.0, "comments": ["I live in an area where mom and pop ice cream shops dominate the only ice cream chain we have (Friendly's). It's pretty cool.", "It will be interesting to see what happens in CA with their new fast food minimum wage.  I imagine there will be a lot of closures as customers are unwilling to pay for low-quality food what it costs to support that level of pay.", "Making ice cream cones is an entry level low skill job for teenagers. It’s should be for them to some cash to play with during the summer or to start saving. \n\nIt’s not for grown ass adults trying to raise a family. A manager spot is a maybe but to raise a family, someone should be targeting a skilled profession and a job with benefits", "What do you do then when your congress shipped all your production overseas and the number one beneficiary of shipping production overseas became the president and people making ice cream cones at Dairy Queen keep voting for him.", "The only thing that \"living wage\" is creating is a faster move to automation. Were already seeing that happen. No company is going to pay someone $50,000 a year to scoop icecream.", "I sympathize but I honestly don't know what the answer is and I won't pretend that I do. Raising minimum wage means other wages have to go up and that means prices increase everywhere and you're back to where you started. Leftists will say CEOs need to take a pay cut but even if you concede that's the sole problem (I'm not saying it is) how do you go about fixing that? \n\nHowever a lot of people live beyond their means and that's not helping their situation. Everyone wants to have their food and groceries delivered, have a nice car, have an expensive cell phone, etc. Social media exacerbates this because people post and see all of the good stuff (\"If so-and-so can live like this on their job, then I should be able to too\") but they don't see the bad (those people struggling to pay bills, being in massive debt, having credit cards maxed out).", "Every full time job should provide a basic living wage. Not part time tho. The lower the experience and level, the less money tho. That’s just logical", "Working entry level jobs didn't need to pay well when the population was BOOMING in the 50s and 60s. Because of the boom, there was always a job to move up to.\n\nWith the population leveling off, and birth rates actually not supporting replacement, there isn't nearly as much room to move up from entry level jobs, and when it does happen, it happens much later in life.\n\nThe issue is that the U.S. doesn't really have a real capitalist economy. It's an oligarchy.", "The real answer is that there's no relationship between pay and cost of living other than you shouldn't take a job if you don't like the pay", "Because these jobs were always intended for young people just starting out in the job market not as a damn career to raise a family from.", "We need these jobs to train the folks for the real world not for it to become their world.", "Super weird that people want low skill short term jobs to make unreasonable amounts of money. \n\nMore weird that people don't know that if you're actually a reliable worker, you get promoted out of those jobs relatively quickly. Like 3-6 months normally, 12 months max. Assuming your boss isn't a trash person. If they are, you need toove to a different job anyhow.", "Here's the question though: if you think fast food workers deserve to be paid something like $25 per hour, do you also think that you ought to pay $15-$20 for a single ice cream cone? If that's the case, then even what they're making won't be enough to live on.\n\nEmployees are hands down the biggest business expense, even minimum wage employees. If you have an employee working for $10 and hour full time for a year that adds up to paying up about $20,000 and most families would not be able to cough up that much money for an emergency. Now multiply that expense towards multiple people, and then add expenses for other things like wasted food, renting out the building, the cost of ordering food and cleaning supplies and everything else, and you'd understand how expensive it is to run a business.\n\nI've never run a small business so I can't say how much it comes out to. But it would be nice if some small business owner on Tik Tok just came out and explained all of their business expenses and how they price everything just to tell people that they aren't being greedy and ripping everyone off.", "Here's a shocking idea.  Maybe jobs should pay what the market determines.  If that job doesn't pay high enough to work on the market, then it shouldn't exist.", "Minimum wage is good for the fact people can’t exploit their labor. IMO it doesn’t mean livable wage. I don’t think someone that is a skilled and experienced worker should be making minimum wage.", "Here's a thought -- if the company can't pay living wages maybe it should just close down?\n\nWe'd all be a little bit better off without Dairy Queens anyway, lol. It's not providing any benefit to society. You can get ice cream from a local creamery or if not that, a grocery store.", "It genuinely scares me how many people that don't understand basic economics are commenting on that thread....", "If you're 30 years old and assemble hamburgers wrong for a living, then somewhere on your path you squandered opportunities or made horrible life choices. Fast food is not meant to feed and house a family unless you're owner or manager. Especially in 2024. Making poor choices in life should have consequences. This is one of those consequences. Working fast food as an adult. If a guy can make my hamburger wrong and do it slowly for $20/hr then all of the skilled trades should skyrocket. This socialist idea of everyone should be equal is nonsense. Make good decisions and reap the benefits. The participation trophy generation needs a rude awakening. Celebrate greatness. Not mediocrity"]}, {"title": "Biden Says His Next SCOTUS Nominee 'Will Be An Illegal Immigrant, I Mean Undocumented' (satire)", "description": "", "time": 1711982553.0, "comments": ["Can’t be any worse than the last one that doesn’t know what a woman is", "Dont give the left ideas! they will do it...its not satire if its believable", "I would believe it. The last one doesn't even know what a woman is."]}, {"title": "Google has a picture of Trumps likeness with duct tape over his mouth when you search “gag order”.", "description": "Seems very unprofessional, the left wing tech empire continues to inject their blatant bias into their program functions. I fear that googles Gemini will do something similar. I’m aware that news just broke about Trumps gag order but I was just simply looking up what a gag order entailed in the first place. ", "time": 1711906283.0, "comments": ["And when you look up \"sedition\" it shows pictures of January 6th", "Search gag order on Google images. 95% of the photos are of Trump. Its because the Trump gag order is very popular right now.\n\nLegal analyst Glenn Kirschner applauded the gag order saying he hopes it curtails the former president's \"endlessly dangerous, violence-inspiring rhetoric.\" BLOODBATH!!", "The schism between conservatives and liberals is growing wider in the U.S.  \n\nAnd our politicians and mass media try to heighten that gap as much as possible.\n\nI don’t believe they’ve thought the consequences through however…", "I did my part and reported it", "That's because google uses images of (recent) news websites in their results", "I bathe in their pettiness.", "Show a pic of Biden behind bars and the Feds will come after you and end your life.\n\nLefitsts everywhere are tearing this country apart from within and if Joe is allowed to steal office again we're doomed.", "Reported it as Violent or Dangerous Content.", "Google also had Gemini and we saw what kind of dystopian derangement product that turned out to be. The rot is through the organization. It censors more than 50% of the internet through its search engine.", "They definitely, totally, pinkie promise swear don’t manipulate search results though!", "They need a pic of Hunter when you search for crackhead.", "Not a fan of Google in a lot of ways, but considering Trump's gag order is probably the most famous gag order not just in history, but in modern history, it kinda makes sense.", "You can report it and offer feedback\n\nEdit: might be good to compile a list of these things so everyone can report it.", "Wow. \n\nThat’s entirely unambiguous, it’s not a product of algorithm or AI, and it has to be intentional human action. \n\nWhat’s the over/under until it’s retracted and someone is apologizing for an “overzealous employee” or something?", "But nothing for Easter", "I just looked and it's still up.", "Not only is it biased but it’s something no serious IT company should do.", "Google might just be the only company in all of history to intentionally destroy the utility of its products just to snub half of its primary user base.", "Good grief.", "Absolutely insane", "Google needs to go straight to JAIL!", "Don't feed the troll. I'm talking about Google BTW.", "Wow, that's blatant.\n\nI've reported the image as politically charged.", "it's textbook marxism."]}, {"title": "Pro-Palestinian protesters interrupt Easter Vigil service at St. Patrick's Cathedral in NYC", "description": "", "time": 1711906733.0, "comments": ["Can you imagine if some Christians interrupted a special  Muslim worship service?", "They can call themselves “pro-Palestinian” but they’re really just Hamasnicks", "This is an attack on *western civilization*, not *israel*", "Rent-a-protesters", "How much do they get paid by the Dem party?", "If they really want to support them, they should go fly on over and join them.", "This is just being annoying by the sake of it. I highly doubt any of this christians have any remote influence in the Israel and Palestine conflict."]}, {"title": "'Demented' Trump 'incapable of doing job' says psychologist. Says Biden is still sound in his judgement, and though he forgets things, they aren't massive gaffes.", "description": "", "time": 1711903757.0, "comments": ["Doctors who presume to diagnose a patient without meeting the patient are called \"quacks\".\n\nThere should be \"red flag laws\" for quacks; their license to practice medicine should be seized.", "Remember boys and girls: Biden is mentally sharp, the economy is the best ever and crime is at an all time low!", "Goldwater Rule doesn't apply to \"psychologist\" when they are \"sAvInG dEmOcRaCy\" by slandering Trump and propping up Biden.\n\nJust like covid rules didn't apply to rioters.\n\nJust like classified documents laws didn't apply to Biden.\n\nJust like so many other things.", "Psychologist? He’s more like an activist", "It's not even exaggeration to say that all these so called 'experts' are just miserable frauds trying to grift off whatever gets their name in an article or a media appearance.\n\nRemember just about a week ago, \"experts\" were so confident that Tishy could seize Trump's assets, there was this whole article on politico where they were salivating and drooling over \"ways Tishy could seize Trump's assets and bank accounts\". \n\nAppeal courts gave them a big F U, then they had behaved so deranged that it was \"dual standards of justice\" for the evil orange man.", "Why post this garbage? Seriously…", "Let's replay the tape, first Trump go around they wanted to diagnose Trump with personality disorders to disqualify him from office.  Despite never doing an actual exam.  \n\nBiden gets in and talks to people who aren't there, talks about things that never happened, and can't stay upright.  Those same people said a person cannot get a proper diagnosis without examination.  \n\nNow that we are in round 3 with Trump they are back to giving armchair diagnosis?  \n\nHow about this, no credible professional can render a diagnosis of any kind without an examination?  That is no shit stuff to a real professional.  These people are hacks, take their licenses.  They aren't fit to practice if they truly believe they can DX someone from CNN and MSNBC soundbites.", "They’re both too old to be President.", "💵💵💵💵 paid for by Pfizer", "The good doctor has donated to Act Blue.\n\nMakes me question his motives…", "The mental gymnastics these people use to justify Biden's failures is mind-boggling. \n\nThis psychologist is probably a quack who hasn't practiced in decades.... due to being a quack.", "That’s a bought and paid for Democrat psychologist.", "If you’re going to call it a spade then it’s a spade. If Trump has dementia then Biden does too. Biden doesn’t know where he is most of the time. His handlers carry him around like a baby. \n\nI’m so sick of this armchair “diagnosis” from supposed professional MDs.", "This government really is trying it's damnedest to play out 1984.", "The fact that we need to have “experts” (I use quotes because they are clearly biased) claim that either Trump or Biden are fit for office when they should be retired is so frightening to me. \n\nWe need age caps for the presidency yesterday.", "Should have his license suspended for making a 'remote' diagnosis.", "Since when does a “doctor” diagnose someone without seeing them?  And since when does a “doctor” discuss the health of someone else with others?", "And then these people wonder why people don't trust doctors anymore", "Someone needs their license to practice reviewed and revoked, if they even had one.", "Someone go after these dildos’ licenses. You can’t just go around diagnosing people without actually meeting the patient. Fucking quackery going to the media like this.", "It would be nice if Trump was maybe 10 years younger but he's still sharper than Biden any day", "Is that from a parody site???😂😂", "This is priceless. Love him or hate him he is going to live rent free in liberal heads for the next century. A total win for trump all the way around.", "Fake news", "&gt;the aren't major gaffes\n\nNo big deal, just asking the crowd where a dead person is and then telling stories about talking with dead people and riding the train across a bridge where trains didn't travel.", "Lets look at the REAL issue here in the US and determine who is the BEST candidate to make real decisions...for example; the border!!...its not racist nor discrimination to have a secure border! Nearly every decision biden takes credit for (because we know the puppeteers are the real decision makers) is all about keep the power and nothing to do with keeping this country safe.", "Lol. Special counsel Hur and this psychologist should get together and compare notes.", "How much they pay them to say that?", "\"Hear all about it in my new book, only $29,99\"", "One cannot make the decisions Biden has and be attributed sound judgment; assuming he is loyal to his oath of office.", "So this demented trump not only attended the rally for that officer that died but took the time to feed a lot of people and his crew(doesn’t sound demented to me) In politics is all about optics and Biden optics look really really really bad", "I wonder which super pac is funding this “expert”?", "facts don't matter when you are suffering from TDS.", "Trump is a brutally hard worker, and so are his kids, and his late father! ", "How do you spell malpractice?", "Gartner and the other \"400\" should have their titles and certifications stripped and become \"patients\""]}, {"title": "Border Agents Caught on Camera Telling Migrants They’re “Free to Go, and Free to Travel Wherever They Want.”", "description": "", "time": 1711961958.0, "comments": ["Sooo, they're actively participating in the destruction of the American way of life by allowing these criminals into our country?", "I support law enforcement but when you sit by and enable this you’re just as bad as the Big Man himself.", "That's nice of them", "Christ, this is an embarrassment and a disgrace to the USA.", "Absolutely sickening", "[removed]"]}, {"title": "Biden faces fresh political peril with latest student loans lawsuit", "description": "", "time": 1711982152.0, "comments": []}, {"title": "Ex-DOJ official’s disbarment trial shows difficult road for Jack Smith v. Trump", "description": "", "time": 1711981622.0, "comments": []}, {"title": "Gunman kills 1, injures 4 at Nashville coffee shop on Easter Sunday", "description": "", "time": 1711931661.0, "comments": ["Yeah, the liberals on r/Nashville are already going after gunowners and totally bypassing the actual shooter. They're making all kinds of excuses. And we know why lol.", "Is that a POC? If so, don't expect too much MSM coverage on this.", "Behind a paywall.", "Interesting if he was white, this would be blown up all over every news station all day. He’s not white though so liberals don’t care. Remember, it doesn’t fit their narrative.", "Anybody want to let us know what the article says?", "https://archive.is/AIv78", "I thought Nashville had a few more years before becoming a Californian city. Looks like I’m wrong."]}, {"title": "The Many Ways A Porous Border Means Crime Without Boundaries", "description": "", "time": 1711977981.0, "comments": []}, {"title": "Professors get $1 million to apply ‘critical race studies’ to the classics | The College Fix", "description": "", "time": 1711971343.0, "comments": ["The title of this post alone should make it abundantly clear why DEI is the biggest grift in history.\n\nAnd in most cases, _a shakedown_.", "&gt;The new program will be a “multi-year fellowship program designed to mentor graduate students and early career researchers of the ancient Mediterranean as they *center critical race studies* in their scholarship and teaching,” according to a Princeton announcement.\n\nPlacing critical theory at the center of anything, let alone *scholarship and teaching*, is not healthy for anyone...", "Since I already have hardcover copies of the classics on my shelves these people won’t be changing or editing a word of what I read. \n\nI suggest everyone find and keep hard copies of all their beloved media and store it in a safe place, the left is coming and will make every attempt to alter and destroy anything from the past they don’t agree with.", "A $1,000,000 deck of race cards. Collect them all!", "Just funneling money for bs", "&gt;You have not experienced Shakespeare until you have read him in the original Klingon."]}, {"title": "Texas Judge Releases Illegal Immigrants Who Rioted and Clashed With National Guard at Southern Border", "description": "", "time": 1711947028.0, "comments": ["[deleted]", "Hopefully, at the judges own backyard. Why would the people rounding them up have any incentive to arrest these people if the corrupt judges are going to let them loose anyway? It is a risk to their lives having to catch these violent people.", "Every branch of the government has been compromised.  We are living in an authoritarian system.  Our lack of borders has dismantled the sovereignty.  No one in any branch of government is on our side."]}, {"title": "Texas Judge Releases Illegal Immigrants Who Rioted and Clashed With National Guard at Southern Border", "description": "", "time": 1711977781.0, "comments": ["Can you imagine a group of US citizens, illegally crossing in to Mexico and clashing with Mexican troops? You will be imprisoned for YEARS in the worst conditions. Come here? Maybe a few days and released in to the country you violated to get our benefits, etc. What a fucked up world."]}, {"title": "‘Vaccine lettuce’ bill, aiming to classify food containing a vaccine as a drug, passes in Tennessee", "description": "", "time": 1711941451.0, "comments": ["This is in response to some group getting a grant to study if they could do it. The bill is more of a \"don't even think about it\" signal not to the scientists, but to the FDA.", "Tennessee must be a utopia where no one is homeless, no one is unemployed, there is an excess of funds available, education is the best in the country and crime is non-existent if this is what they are spending their voter's tax money legislating.", "What we need are laws ensuring that it's clearly labeled to contain vaccines", "Omg animals have been vaccinated for years, this is false hysteria.", "Foods contain vaccines now..? God thats scary\n\nIm pro vaccines but I also believe everybody has a choice as long as it doesnt drastically affect others. If people are eating these foods without knowing there’s stuff like this in them, what else could be in stuff we use everyday…", "If they could deliver vaccines in food that'd be kind of cool. Would make it easier to give to kids or even pets.", "Thomas Massey explained this is in a tweet like 6 months ago. And on the house floor it’s on video\n\nThey could give animals vaccines with MRNA and then those animals could end up in the supermarkets with no labeling.\nSame with MRNA into food fruits and veggies just like GMOs.", "what is the point of a bill if the vaccined food ain't even present atm? \n\nbut even then, how can you just not label it as a drug? It makes no sense. if it wasn't present, could they have just put it with normal food? If yes, that's hella scary", "WTF?????", "Is this a my body my choice attempt?", "We need to know which foods have vaxxes."]}, {"title": "With ‘Friends’ Like Mexico’s Obrador, Who Needs Enemies Like Putin, Xi, Kim Jong Un and the Ayatollahs? › American Greatness", "description": "", "time": 1711979197.0, "comments": []}, {"title": "9 Brits Apprehended Illegally Crossing Canadian Border into Vermont", "description": "", "time": 1711934314.0, "comments": ["No doubt lured by the US government's offer of free tea and crumpets.", "What are the Brits names?", "My first thought was it was probably British Muslims.", "Things must be really bad there if Britons are coming here illegally.", "Were any of them named muhammad?", "\"Brits\"", "Hey, if I were British these days I’d be attempting to illegally cross the border into the U.S. also.", "MI6 needs to brush up on its clandestine techniques. They're getting sloppy.", "I guess they don’t teach north from south in England anymore. If they did, they would know that they tried entering from the wrong side.", "[deleted]", "RACIST!!"]}, {"title": "Welfare Migrant: \"I'm rich and you're miserable\" (Fox News)", "description": "", "time": 1711970350.0, "comments": ["Is it really crazy to advocate for welfare chauvinism here? Even if you disagree with welfare, at the very least it should be restricted to the documented residents who need it.", "More diversity should reach diversity loving places like NYC, Chicago, Denver or Martha's Vineyard.", "The only reason he got in trouble with ICE was because he’s supposed to be quiet about it, at least in this election year.", "Elections have consequences", "Thanks democrats. This is what you voted for. Be proud!", "He's not \"rich\". In fact he'll never be \"rich\" He and those like him will be doled out juuuust enough to keep them beholden to the government.", "Worst Democratic administration since Buchanan...seriously, why is there no mechanism in our Constitution to just ABOLISH a fraudulent party? Call Martin Van Buran, this shit is NOT working anymore.", "The lefts dream society…", "This country was built on **Legal** Immigration. Biden and crew are trying to import an electoral majority of government dependent **illegal** aliens.", "Minimum wage in Mexico = $13.83/DAY! ($1.73/hr)....how much is each migrant getting on their debit cards when they get here?....Im sure they get months worth of wages that can be sent back home..who pays? YOU DO!"]}, {"title": "'Equity-Based Algebra' Is as Bad as You Imagine It to Be", "description": "", "time": 1711982247.0, "comments": ["[deleted]", "If everyone equally sucks at maths, there is no inequality anymore. That's the woke logic, I suppose. \n\n\nUSA is becoming an undeveloppind country. The whole western world is taking this exact same path. We are fucked. Plain and simple. Too much left-leaning morons on our shores. \n\n\nChina won't even have to fight us. They just have to wait a couple decades.", "A^2 + B^2 = that's racist", "This is another example of why my children go to private school.", "Math and science is a social construct. We don't need engineering and physician degrees anymore.", "call it anything you like but there is no equity based math.  Math is science not feewins.", "I suck at math. Does that mean I'm a minority?", "Math is math. It is the great equalizer. No one language or culture has any advantage over another when it comes to math. \n\nIt doesnt need equity. It just needs to be math.", "Instead of using their education, expertise, and resources to lift up those struggling, putting in the extra work or effort.. they lowered the bar for all. How insulting and disrespectful to both sides. The gifted and those needing the effort to keep up. Seems this is par for the course for the leftism mind set.", "Let me guess, it just results in no one learning Algebra?", "That’s okay. No critical thinking problem solving needed. \nBut they all special, gonna be rocket scientists or brain surgeons.", "The most racist thing to do is essentially bar people from success. This isn’t a good thing. This is harming kids no matter what race. This is harming our future. All other countries are already hammering the US in math and science. They will have no options other than social justice. Maybe that’s the plan.", "The political activist, who claimed to be a Stanford researcher, actually faked most of her claims and lied about supposed citations too.", "The idea of dumbing down what is being taught rather than offering learning aids to those who struggle to pass is fucking ridiculous.", "This is the dumbest thing ever.  Math is math.  It's probably the single academic subject where there is no room for interpretation whatsoever (at least at that level).", "https://www.youtube.com/watch?v=cV0XSPbo1CY\n\nIf you want to know why all this is happening, watch this interview between James Lindsay and Ben Shapiro.  It explains how and why our education system has been destroyed.", "This is why I will never send my kids to public schools.", "Also, \"letter grades will be discouraged in favor of 'standards-based assessments.'\" It's not very clear what \"standards-based assessments\" are, but it sure sounds academic and harmless, right?\n\nStandards based assessment is actually good.\n\nIt basically boils down to \"Can you consistently do X skill\".\n\nI use it as a Special Ed teacher and at the end of the day it gives a far more comprehensive idea what a student can do and what they need to work on. \n\nFor example. I basically have a sheet for each students that breaks down a given class into various skills. \n\nWhen they can demonstrate with 80% accuracy  that the can do a skill, I mark the day of attainment. We go over them periodically. \n\nIts also an ideal way to hone in on lagging skills.", "Gotta group all of these people together. The cause and effect", "Here's a shocker: I absolutely suck at Algebra. I always have.\n\nWhat I understand with ease is that Algebra is the same, regardless of who you are. \n\nI suck at it and that's on me. It's not someone else's fault.", "I read this article hoping to find an example but just found that they seem upset at the language used and some anonymous complaints from 10-20 years ago. Does anyone have an example of what is actually being taught by CMF that is bad?", "Yuck", "$5,000 an hour consulting fee?", "The ebonics of 24", "The school board won't dump the curriculum. That would be admitting they were wrong and wasted money.", "Yes, you can have negative exponents.", "Idiocracy IRL."]}, {"title": "El Paso judge orders release of migrants accused of 'border riot'", "description": "", "time": 1711978893.0, "comments": ["J6ers are still behind bars"]}, {"title": "NY Firefighters Forced to Remove Flag for 9/11 Heroes After Leftwing Questioning, Backlash Saves Day", "description": "", "time": 1711977868.0, "comments": ["At this point, we're just two countries occupying the same geography and fighting over which one gets the government.", "[removed]", "[removed]", "Fascist Firefighters. Waiting until a building is on fire and vulnerable to run in and occupy it.", "&gt; Someone who identified himself as a staffer for Democratic Manhattan Councilwoman Carlina Rivera confronted the firefighters at their firehouse and said that she had complained to the FDNY management about the flag, ***calling it a \"fascist symbol\"*** and demanding to know from them why it was still up. \n\nExtraordinary claims demand extraordinary evidence. \nIn what way is it \"fascist?\" \n\nNot everything is about you, councilwoman.", "This story is a clear example of the left \"testing the waters\". The only way to stop them from destroying the country is to push back against them until we've gone back to where we started. The won't stop the needling, so as long as we keep getting outraged they won't succeed in taking our rights, but that isn't enough. If they even test the waters we need to fire them immediately because they prove in that instance that they cannot be trusted with power.\n\nVote them all out.", "Not satire?\n\n\nNot a bad April Fool's joke?\n\n\nIck.", "Isn't over until the original source of both complaint and order are fired."]}, {"title": "Boston is planning on putting illegal immigrants in veteran housing.", "description": "", "time": 1711934053.0, "comments": ["This is like pouring salt into an open wound.", "“We can’t figure out why they keep coming. I guess we’ll give them food, housing, phones, and medical care until we get to the bottom of this” 🤡", "Its clear the disastrous Biden Administration cares more about ILLEGAL Immigrants than our own Veterans who fought for this amazing country.", "I am from Boston.\n\nThey also put them in a community center in roxbury which is a historically black neighborhood. It is one of the only “safe spaces” that those kids had.\n\nThey don’t give a fuck about American minorities. Just the optics.", "First it’s homeless shelters then it’s schools. Now it’s veteran housing…watch next will be regular citizens. You’ll get someone knock on your door and say you have to move out so these illegal immigrants can live here. But of course people hate Trump so much they’ll do it.", "illegal aliens over veterans.\n\n  \nhow outrageous.", "All part of the plan.", "This one hurts", "Is this real or just meant to piss me off", "Wtf??? And where are the veterans going??", "This is already happening in Washington state. The housing authorities are kicking veterans out and placing illegal immigrants because they get more federal $", "Does the VA not have it bad enough? You're begging for conflict", "I approve of this! There is plenty of housing for free in basic training! If you want veteran resources it's time to earn them.", "Showing exactly where the priorities of the Left are.", "They have a whole scam going with people profiting off the new revenue streams created from the whole transport, feeding, housing etc. These people don’t care about the long term impact, just want to rake in immediate profits for themselves while they can get away with it.", "If you're overrun by illegal aliens, simply start cooperating with ICE and working to get them deported ", "Are they trying to piss us off? What are they doing?? I'm bout to have a come apart!"]}, {"title": "Donald Trump’s Road to Victory | There are about seven months until Election Day, but right now, Donald Trump’s road to victory in the 2024 presidential race looks surprisingly smooth.", "description": "", "time": 1711982412.0, "comments": ["[deleted]", "Republicans have lost a lot of special elections since 2022.  Don't count your chickens before they hatch.\n\nVote.\n\nFundraise, get out the vote, ballot harvest, vote by mail.\n\nVote.", "It won't be a breeze, but it's still possible. And his chances are better than they were in 2020. All he truly needs to hit 270 is Georgia and Pennsylvania meaning he would win 270-268. \n\nA more likely and realistic scenario would be winning Georgia, Arizona and Wisconsin, the 3 closest states in 2020 putting him at 272 points."]}, {"title": "In setback to Turkey’s Erdogan, opposition makes huge gains in local election", "description": "", "time": 1711979836.0, "comments": []}, {"title": "El Paso judge orders release of migrants accused of 'border riot'", "description": "", "time": 1711937668.0, "comments": ["Release them in the judge's neighborhood.", "[deleted]", "Magistrate Humberto Acosta Jr.https://opengovus.com/texas-lawyer/24045369", "The judge's ruling is actually fine with me, as long as all of them... more than one hundred, I believe, are now released into the judge's custody. Have the local police transport them to the judge's home, and allow them in before the judge gets off work.", "We have to have the most incompetent judges in the world.", "that judge needs firing.", "[removed]", "Treasonous.", "You tend to find judges are more left leaning. The reason being is that the job is not as well paid as a lawyer could be, so lawyers who are generally unsuccessful become judges.\n\nThere is very little chance of a successful lawyer becoming a judge as why would he take a drop in pay. It also gives the \"failed\" lawyer a position of authority over his peers, which is an ego boost and a trait of the left leaning demographic.\n\nBeing a judge should be like being a juror, experienced lawyers have to do it and are called up randomly.", "In principle I agree they should be released… in the middle of eastern Ukraine", "He let some of them go, except for the ones with detainers. He also accused the DA’ office of not being ready to proceed with detention hearings\n\nParaphrasing because I can’t copy/paste because of the ads taking over this article. \n\nThis may not be on the judge. Set them free in the district that voted in that DA, which is exactly what was done", "What's the problem? They were peaceful tourists who just wanted to go visit Texas and shop at the outlets."]}, {"title": "A top official in Denver was just caught on tape begging illegals to leave the city", "description": "", "time": 1711928467.0, "comments": ["Pretty amusing how he’s trying to convince them to go to NY or Chicago. They don’t want them either.\n\nWhat a mess this is. I feel bad for the people involved but they shouldn’t have been allowed over the border in the first place.", "Pretty easy to flex on republicans and declare yourself a sanctuary city when you’re hundreds of miles from a border, huh?", "This the Escape from New York origin story.", "If there's one thing illegals will definitely do, it's listen to government officials about where they should or shouldn't live", "Denver's booming, so they should be able to absorb them better than anyone else.", "😂😂😂😂\n\nDemocrats playing hot potato w illegals\nI love it so much", "Why? I’ve thought illegals promote diversity and provide cheap labors?", "Love the about face when Democrats now have to deal with this.", "Why don't these cucks just admit their policy on welcoming illegals and their broader ideology has failed? I'm so sick of these hypocrites virtue signaling with other people's money, communities and lives.", "But they are so good for the economy, they are all proficient at coding in python.", "The white house is pretty big. I bet you could get a few hundred families in there. Tell them about squatters rights before they go", " NIMBY!"]}, {"title": "Trump reacts to Mexican president's $20 billion demand from Biden admin: 'I wouldn't give him 10 cents'", "description": "", "time": 1711954383.0, "comments": ["How about when Biden gets out we militarize the border and don't give him two cents", "Mexico 's president heard that the US was giving out money to other nations again and thought they would try it.", "There’s a serious collision coming between Trump and their President.", "Biden has made the US a joke. Every day is an advertisement for more criminals to come here and set up shop. They know the window is closing so there will be an even bigger influx before the elections.", "The president did not make a good decision when they tried to extort the us", "Enough of this - 100% tax on all remittances to Mexico until they quit their bullshit and the border wall is fully paid for.\n\nThe fucking audacity of this glorified cartel simp to extort us for $20 billion simply because he and his drug dealer handlers are profiting from the border invasion.", "\"During the \"60 Minutes\" interview, López Obrador doubled down on his demands previously made in January to the Biden administration in exchange for support from the Mexican government to halt the surge of illegal migrants, among them: lifting sanctions on Cuba and Venezuela; sending Latin American and Caribbean countries $20 billion in aid a year; and granting legal status to Mexican illegal immigrants in the U.S.\"\n\nHow about he gives us 20 billion dollars for his own protection."]}, {"title": "February Gallup poll revealed that 90% of Republican respondents view \"illegal immigration\" as a \"critical threat\", while only 29% of Democrats feel the same", "description": "", "time": 1711911840.0, "comments": ["30% is actually pretty high for something that you think would break along party lines\n\nThe dems internal polling must show that independents are in favor of limiting illegal immigration because they pivoted hard from the whole ‘you’re xenophobic for being against illegal immigration’ to ‘actually we care and are trying but it is trumps fault’", "Democrats ask why so many Republicans have a problem with illegal immigration when they dont live anywhere near the border. Cant make this stupidity up.", "Yes, but democrats can’t tell the difference between a boy and a girl, so the 29% makes sense.", "Meaning 71% of Democrats view illegal aliens as future liberal voters.", "Can’t be that big of a concern Republicans voted against every attempt to put bills forward. Please explain how an emergency of this magnitude can wait until after Jan 2025?  \n\n- Republicans also voted against deporting immigrants with expired work visas who make up 48% of people in the country illegally. \n\n-House republicans also voted to increase green cards for immigrants with tech skills while 300,000 Americans in the tech industry have been laid off since 2022 and workers struggle to find new jobs which have been moved offshore or taken by green card holders\n\nPlease explain the reasoning and how this serves the philosophy of “America First”?", "That’s because democrats are mentally stunted. It’s why they vote democrat in the first place.", "Way higher than i thought for the democrats", "I'm pretty sure those 29% of Democrats are from New York, Chicago, or Boston, where they've all been dealing with the bullshit there.", "Just highlights how useless liberals are on the economy. They know something is wrong, but they're afraid to offended their Brown neighbors...because they don't actually know them. They just pretend to \"support their rights\" but what about ECONOMIC freedoms?? Liberals have no cause when it comes to building a healthy economy anymore, besides turning an open border in a ghetto version of \"Ellis Island\". Total failure of leadership.", "[removed]"]}, {"title": "Business Owners Fight GOP Efforts to Make Them Police Workers’ Immigration Status", "description": "", "time": 1711977778.0, "comments": ["\"Don't make me stop using cheap illegal labor!\"", "Fine the living daylights out of ‘em if they don’t use E-Verify. \n\nPlus jail time.", "The business owners love the illegal  aliens. Business owners can easily use free federal service called E-verify. But instead they use the I-9 form which people can defeat easily using forged documents.", "Its like groundhog day. E-verify was a hotbutton issue 20 years ago.", "Hate to say it... But this is a case of you reap what you sow.\n\nTraditional neocon economic policies promoted off shoring and migrant workers at the expense of American workers interests, all under the guise of free trade, for decades.", "Does Europe do this?  They don't require visas for travel from a ton of countries that the US requires visas from... presumably because it is not very easy to go to the Uk or France and work under the table as it is here?", "They will never follow through with their threats. This is just them sounding off that they want more money donated if they want to keep their tax payer subsidized workforce.", "This one is a long time coming and, frankly, it’s absurd that the lobbying has made it last this long.", "They do that in Florida.  Why hire an expensive contractor when you can go down to Homdepot and hire a guy for a couple of bucks.", "Government has no business (pun intended) telling people who they can hire for work 🤷\n\n\nWhy should a contract between two people require a stack of government paperwork for approval "]}, {"title": "Hmmm, A top official in Denver was just caught on tape begging illegals to leave the city: \"Any city. We can take you to the Canadian border, wherever.\"", "description": "", "time": 1711943722.0, "comments": ["Oh and the Gov. of Texas is the bad man for sending them to other states.", "Governor Abbott is a visionary.", "Denver seems like one of the first big blue cities that is realizing how much of a problem this is, but they're trying to be low key with the realization so they don't lose left wing street cred. ", "Yikes.....", "Canada border? Trudeau seals that border as best he can. If the US-Mex border were locked down like the Can-US border, we wouldn’t have an illegal immigration problem.", "When will the democrats, especially the democrat politicians and celebrities, start to open their homes to the diversity of people that reached America? They want diversity so they should be helped to get as much diversity as possible.", "Democrats policies in practice aren't very practical huh? 😂", "\"Please go anywhere but avoid anywhere that's close to where I live.\"", "This is what they voted for", "And guess where this *isn't* posted, lol.", "Ugh. My country is a joke…", "Abbot needs to send many many more to Denver.", "Does Canada just allow anyone to cross? Pretty sure they don’t but happy to be corrected."]}]