[{"title": "Dark Money, GOP Turning New Hampshire into Florida, Texas of the North", "description": "", "time": 1711900919.0, "comments": ["*But the real eye catcher Thursday was House Bill 1683, which would have ended Medicaid coverage for voluntary circumcisions of baby boys at birth.*\r  \n\r  \n*The bill was tabled a week earlier when it looked like it was going to be killed when Democrats out-numbered Republicans near the end of the session.*\n\nI never thought I'd say this but the Republicans are right.   At least on this one issue."]}, {"title": "The climate-denying, Trump loving religious states are getting destroyed by climate change.", "description": "", "time": 1711909347.0, "comments": ["Let’s not ignore the plethora of other problems those states also have. Check out the infant and maternal mortality rate.", "It’s actually surprising even in the south that number is as high as it is. I feel like they’re a solid 20-30 years behind the rest of the country.", "Correction: we're all being harmed by climate change.", "This is why I don't want to move any further South than DC.", "We should have learned from COVID… it won’t matter to them how much science and facts you show them… they were literally dying of a respiratory virus, yet refuse to vaccinate and still think COVID was a hoax\n\nThey will also all want help when shit hits the fan and it’s too late", "Big gubmint will bail em out... /s", "The inevitable effect of voting against your own self interest for decades.  The obvious fix as instructed by right wing propoganda is a tax cut for the job creators and removal of any inconvenient environmental  or safety requlations.  Because the solution to everything according to faux and news minor is drill baby drill.   Make America burn faster!", "Voting has consequences, go figure.", "Black Americans have a higher religious attendance rate  than white Americans do, and many of those areas have higher Black population. Black folks are also, largely, **Democrats.**\n\nMaybe don't paint religious people with a broad stroke. Most of us are not blindly-faithful fundamentalists and evangelicals. They are a loud, yet small minority, and the Republicans regularly cater to those people specifically *to use them.*", "I was listening to a podcast where they were explaining that the GOP takeover of Iowa is resulting in the entire state slowly drowning in hog manure. This is the future conservatives want!", "As a different subreddit might put it, “leopards ate their faces.” \n\nI’ve been living in NC for while, at this point, and could have puked when the so-called legislature made it illegal for realtors to mention climate change or sea level rise to clients on the coast. For one thing, the law was illegal. For another, they’d rather see citizens drown than get off their butts and DO THEIR JOB.", "Reap what you sow.", "Fantastic!  They shouldn't vote for stupid people to run the state and the country", "We are the new Easter Islanders.", "May it be forever thus.", "Hi all humans in all states! I am 100% hoping to get everyone on board with the following:\n\n1-Register to vote and get your family and friends registered to vote. Find out where to vote. This feels empowering.\n\n2-Volunteer and join clubs with human interaction. Anywhere. This reminds your neighbors that we are all in this together and there are no invisible boogeymen to fight. Walk dogs at the shelter, pick up trash, start a rock club, go to chamber of commerce events, go to school board meetings, run the senior center bingo, get involved in YOUR community etc.\n\n3-Run for office. This is way more simple than you think. Find out how your borough or town is organized. Do they have a city council or other jobs open? \n\n4-I am a majority poll inspector for elections. You can work at the elections too! It’s massively boring. But needs to be done. Look into doing this today.\n\n5-Fight misinformation in a kind way. Do you have a way to count bots? Or a talent that a civic group needs? Find that group and join. They need you.\n\n6-Go to every council meeting in your area and be INVOLVED. Boots on the ground. At the smallest and most local level because they make your everyday choices like living next to a chemical plant for zoning.\n\n7-No whining on the internet unless you are actually DOING SOMETHING", "Scientists- climate change is real\n\nInsurance- climate change is affecting our business \n\nGOP- climate change is a hoax, like Covid \n\nReasons to vote the GOP out of office", "Remember these are the same people who, with their dying breath, said it wasn’t due to Covid it was allergies or the flu. Religion teaches loyalty not to truth but for its own sake, and they will persist in their delusions if only out of spite and resentment.", "I’d say it was almost poetic if it didn’t mean they’ll be migrating into my northern state surrounded by ample fresh water and open spaces.", "They’ll just say it’s a natural order of the world and argue to the death that it’s absolutely not man-made climate change.  \n\nNever met a conservative in person that believed man is neither responsible for global warming or that such a thing is real.  Ones that do believe warming is happening says it’s an Earth thing and that we go through natural warming and cooling, and released carbon is not responsible.  Some say we’ve only been recording global temperatures in the last 200 years so the left is dead wrong about any scientific claims of climate change.\n\nEither way, they’ll allow the world around them to burn to the ground before conceding that argument.", "It's God's vengeance due to their hate they spew.", "Seems like God is punishing these ‘religious’ people for some reason.  Maybe it is because they treat the world like shit.", "The inevitable death of organized religion is not happening fast enough! But I love this for them!", "God is punishing them, and he's punishing them harshly.", "🤷🏼‍♂️", "LMAO at Mohave and Gila counties in AZ… nothing but hicks and white trash in those counties", "What is the relevance of the first pic?", "Property prices in Blue States keep most of them at bay, but don’t think they’ll stay put in drought stricken hellholes forever. They’ll join the migrants they hate; metaphorically speaking, they’ll never actually join anything other than MAGA or church groups.", "To ( apparently incorrectly ) quote Ayn Rand: “You can avoid reality, but you cannot avoid the consequences of avoiding reality.”", "Magic Sky Daddy is laughing", "Democrat in a \"climate-denying, Trump-loving religious\" state here (TX). Also happen to be a Christian myself. I get the frustration, this is not how you deal with it though.", "What’s with all the edgy Reddit atheists in the comments here? \n\nMajority of Democrats are religious", "I'd love to see these two maps combined into one.", "I sir or ma’am; live in one of those areas and must prostest my utmost destress and fact - that the area affected is just an inland coast. /s", "anyone know why Alaska is so high?", "Thoughts n Prayers", "They wanted a seperation.... let's cut loose the dead weight already. Maybe the church will save them....🤣", "Ah snit - that means theyre gonna move…", "They should stay where they are and learn to solve their own problems. We're full up here.", "Let's be real here. Every state is being messed up by climate change. The entire West Coast has been on fire for numerous years in a row. The Colorado River is getting closer to drought. Florida, Hawaii and the US territories are sinking under rising oceans. \n\nBlaming it specifically on Trump states isn't doing anything to solve the problem, and just makes it more likely to be stuck in their ways.", "“Leopards at my face”", "“The Republican south deserves climate change” is not a winning democrat narrative to push.", "[deleted]"]}, {"title": "Texas \"G. O. Pee\" rule: 6 major airlines mandate women age 10-50 must now take airport pregnancy tests to board flights after anti-abortion vigilantes file suits", "description": "", "time": 1711983239.0, "comments": ["I friggin hate satire like this, even on April Fools, since this is the kind of thing that might really happen.", "Check the date, folks. ", "Don’t. Give. Them. Ideas.", "Wrong subreddit"]}, {"title": "Is climate change actually caused by humans?", "description": "[deleted]", "time": 1711928582.0, "comments": ["The global temperature rose a total of 4 to 7 degrees Celsius over about 5,000 years.\n\nBut since the invention of the industrial age (1850), the Earth's temperature has risen 1.1 degrees. Three times the rate than any other time in history.", "The short answer is that weather it is or not we foolish short sighted human being that we are will be arguing about it until we are WELL past the point of no return which I think we are at already.  \n\nThe big oil companies had their own think tanks study this problem back in the 70s and when they universally got the answer that YES \n\nA. Climate Change is real \n\nB.  If human beings aren't the cause of it we certainly aren't doing anything to stop it.  \n\nAll of those oil companies dismantled the labs and fired the scientists.  \n\nThere is no real DEBATE about this in the scientific community and anyone who says there is was probably paid by an oil lobbyist.", "There are many many sources of information explaining that. Simply speaking, yes, the evidence is irrefutable that the speed at which the climate is changing is due to humanity. Here are two links to begin with. \n\nhttps://science.nasa.gov/climate-change/causes/\n\nhttps://www.edf.org/climate/9-ways-we-know-humans-triggered-climate-change", "Yes there is tons of evidence that humans burning fossil fuels is directly to blame for it. \n\nhttps://science.nasa.gov/climate-change/evidence/", "Yeah, this goes back over 100 years.  In the 1890's, Svante Arrhenius was studying the effects of gasses.  He modeled, surprisingly accurately, how the earth's temps would rise as carbon dioxide was added to the atmosphere.  It has been heavily studied since.  Vast amounts of that research was buried by corporations because they saw that global warming would hurt their profits.\n\nAnyway, check out science.nasa.gov as further evidence with actual science.", "Humans didn't necessarily cause it, but have accelerated the process significantly. We can't have a society pumping out carbon dioxide for decades and expect to not have any consequences.", "Yes, scientists have proved anthropogenic global warming to the satisfaction of other climatologists. The \"scientists\" that the oil companies cite in their propaganda are almost all paid hacks from unrelated fields, e.g., engineers and chemists.", "So the climate change comes from carbon dioxid. Carbon dioxid is emitted by burning things. The concentration in the atmosphere got higher since humen started to burn coal. Very important is, that the carbon dioxide, that was burned has a lack of cabon dioxid with C14, the radioactive isotope of carbon (atually C12). The amount of C14 carbon dioxide did not rase like the amount of C12 carbon dioxide, so the carbon dioxide in the atmosphere has to come from CO2 emitted by fossiles, because in fossiles can not be C12, because the radioactive isotope disappears by time. This is the proof that the raise of CO2 in he atmosphere is made by the human.\n\nAnother proof that the amount of CO2 in the atmosphere is rising are the oceans as carbon acid as well. When water gets hotter there is less Carbon acid in the water. Nomally. But you have to know that not only heat is important for the chemical balance. Concentration is important as well. Because of the higher concentration of CO2 in the atmosphere this effect does not happen, but the oceans are actually getting hotter and more acid. This is the second proof that the amount of CO2 in the atmosphere must have risen.\n\nNow you may say that the amount of carbon dioxide in the atmosphere is really low, but you have to calculate that this little amountof CO2 made it possible that there is actually life on earth because this low amount of CO2 has a significant influence on earth temperature. It is really bad that this amount is getting higher, because a significant change makes the earth get significant hotter.\n\nNot to mention other greenhouse gases.\n\nSo yes, climate change is definitely made by humen and it is definitely as dangerous as its said to be.", "**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*", "Carbon dioxide concentrations in the deep Pacific and other oceans are changing the ph of the oceans making them more acidic. If this trend continues it will wipe out a base of the food chain and it very well could cascade up to us. You grandchildren may starve to death because you don’t believe the science which has been linked to humans for decades. \n\nThe carbon dioxide concentrations have been rising precipitously since the start of the industrial revolution. \n\nYou don’t want to be inconvenienced.", "It's really simple: \n\nhttps://imgur.com/a/78tPsAL", "97% of climate scientists (literal experts in the field of our climate and humans interactions with it) agree that climate change is accelerating at an alarming rate because of human emissions, and that if we don’t put an immediate stop to it, our planet will see irreversible damage.\n\nYes the climate has natural cycles, but what we’re seeing is far faster than natural."]}, {"title": "Fractures in the Grand Alliance between Black and Jewish Americans", "description": "[deleted]", "time": 1711978086.0, "comments": ["Such a shame, two peoples who have a lot in common and most definitely should be friends not foes.\n\nIf the KKK and Nazis had their way, both groups would be in danger.  Natural allies."]}, {"title": "Trump Meets Reality", "description": "I will have my satisfaction.", "time": 1711947149.0, "comments": ["I have my doubts\n\nThe courts have done everything to appease trump. It's utterly ridiculous the amount of special treatment he gets\n\nGets a discount on his bond and the NY appellate court gives no reason, is able to violate a gag order on a daily basis with no consequences. I have no confidence in this justice system and i won't be surprised if they go out of their way to lessen trump's punishment if found guilty.", "Make it snappy.\nShit is played out now.", "Several years too late, but OK.", "The harsh reality is, we will have to make sure he can never be near the oval ever again.", "Sure, he will make a show of it and talk about banging the judges wife and he nothing will happen. Seriously, does Trump get to carry the judges balls around like a bag of marbles. He has one bag for Republican Congressmen and one bag for judges at this point.", "I’ll believe it when it happens. This waste of oxygen keeps getting a pass to be awful.", "Fuck Donald Trump. Fuck that lying ratfucking orange rapist and what he is doing to this nation. He can’t be gone soon enough. Please, someone, hold this pile of shit accountable for *something.*", "If I had a nickel for every time some pundit said THIS TIME THEY GOT AGOLF FOR SURE, I would be much richer that Trump 😭", "I'll believe it when I see it, the US has a 2-tier justice system where those with apparent power, wealth, and connections see very little consequences", "Unlikely based on everything up to this point but it would be a nice boost to and validation of our democratic institutions", "Stop toying with my emotions.", "He's been remarkably llucky, gotten a ton of breaks, etc. but he's also lost a lot of appellate claims. He lost every single \"unfair election\" case and he's had several former lawyers disbarred or even convicted of crimes. Remember, this is the guy whose casinos went bankrupt. He clearly didn't understand how odds work. I think he's done too many dicey things, and trouble may finally have caught up with him.", "As Picard said: \"Make it so!\"", "Don’t you mean be a politically attacked for being a perfect person in the Republican Party that has done nothing wrong……rotflmao. I couldn’t event type that out without a huge eye roll.\n\nFunny how the party of Law and Order is so anti Law and Order when it comes to their lives but not afraid to attack others which sounds very Christian Evangelical of them.", "Not a moment too soon.", "Good. The sooner this criminal is in prison, the safer this country will be.", "What if, just what if, DOJ started criminal investigations into Trump right after J6? I still can not get over with the fact that DOJ sat idling for 2 years just to watch Liz’s congressional hearings! This is a real shame, if not crime, on this DOJ. Sigh.", "We’ll see.", "I'm sure he will be but I'd believe it when I see it.", "**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*", "The orange piece of shit keeps coming out of his legal problems smelling like a rose. Our justice system is messed up when it can’t hold this conman fully accountable for his crimes. They keep slapping his fingers and giving fines. He needs to be in prison. We all would have been in prison a long time ago if we did even a tiny percentage of what Trump did. Like others have said, I’ll believe it when I see it.", "Promises, promises.", "The question is when?", "On track? I think that it will get derailed, as it has been, for the past 4 years.", "Until I see it I won’t believe it", "April fools guys…", "[removed]", "Nah.  He’s above the law, he’s making it to the election. It’s up to us to stop him, last chance.", "Nope. Sick of these \"trump is so TOAST\" headlines. It's been happening for years. He does awful shit, and *ALWAYS* gets away with it. \n\nCall me when he's behind bars.", "Posted on April fools 😭", "I still have a $5 bet with a buddy that Trump will be in prison by election day. I still don't like my odds, but I'm really hopeful.", "And when he is, he will campaign off it, sell tee shirts, trading cards, tampons and various other junk. The magats will dig deeper, make room for it next to the dozen my pillows and worship their billionaire orange Jesus by sending him their food money.  Insane..... VOTE like your countries life, heck the world's life depends on it!", "I’ll believe it when I see it. Shits been going on forever and each time it’s like “Trump been very bad! He’s going to be in big trouble!” And in truth he always seems to slither out of true consequences…pisses me off to the nth degree", "Wake me when he suffers a consequence…", "This better not be April Fools.", "Yeah yeah.", "Clickbait. This is the spiciest things News has is to offer now?", "Seems like every couple months over the past several years there’s talk about how “trump is finally getting convicted” and it literally never happens. Turns out if you’re a billionaire, you can essentially do whatever you want and not go to jail. This shouldn’t be news to people", "About time... but I'll believe it when I see him behind bars.", "Just in the nick of time.", "This is like the 10th time an article has said something like this.", "I’ll believe it when I see it.", "I have absolutely no confidence at all that Donald Trump will face much of any legal penalty for any of his crimes.", "I’ll believe it when I see it", "Deja vu headline", "Yeah right, I've heard this song and dance before! I'm so sick and tired of seeing this same head line over and over. Stop fooling yourself, he will never see jail time!", "We have been told this for the better part of a decade. Just do it already", "I won't believe it until it happens. And even then, I would not be surprised if he still weaseled his way out of serving any time.", "I’ll believe it when I see it", "Stop promising me things that will never be delivered. Like a bad kickstarter campaign.", "The original post has done well - 25,000 views in several hours. Cool.", "Eh, I’ll believe it when it actually happens. I’m tired of getting my hopes up only for him to squirm off the hook every time.", "Don’t fall for it again guys. There is no legal recourse. There is only the election. \n\nTrump may end his days in Russia, but I wouldn’t hold out hope for prison. Well, a russian prison is plausible.", "God I hope so.…", "Ultimately the best way for him I go down in History\nUltimately, it's not about who gets credit for achieving success but rather the impact one has on others that defines their legacy. This is how  he wants to make an indelible mark on society, future year 2224 reading - first US President behind bars", "Obviously an April fools joke. We know justice doesn't exist.", "Stop blowing sunshine up my ass.", "You guys really still think there will be consequences for him?", "Trump isn’t going to jail, guys. I’m sorry. \n\nThese trials serve one purpose only - to (hopefully) sway some undecided voters in Biden’s direction in November. \n\nThere is nobody coming to save us. Nobody. The system wasn’t designed for this scenario. Even if convicted (any trial that has a jury - good luck getting 12 people without a single MAGA amongst them) - he could appeal until November. \n\nWe just gotta vote and he goes away. In luxury, tweeting, yes, hopefully dragging the entire GOP with him. \n\nThat’s the best case scenario.", "OMFG.  Once again...  Unless he's already convicted, STFU!  These clickbait articles are such bullshit.", "[deleted]", "Guys. “Legal Analyst”. They just find whatever washed up/retired lawyer they can get their hands on to say something provocative for the clicks. That’s it."]}, {"title": "Trump asks hush-money judge to let him keep attacking judge's daughter", "description": "", "time": 1711918303.0, "comments": ["He ***has*** to be arrested and if MAGA starts a civil war, it's better to have that civil war **now** while Biden is still president.", "He's just SUCH A DICK", "He's going to keep doing this shit until he gets stepped on hard, that being said I've been thinking of a way for this to change. My idea is to have a reporter ask President Biden about the situation and having him come down hard on the orange clown about him attacking the daughter of a judge. It could boost Biden's chances even more for re-election and drive trumpy crazy.", "From the article:\n&gt;The judge's daughter \"has just posted a picture of me behind bars, her obvious goal,\" the GOP frontrunner complained, referencing a social media account that court officials soon said was a hoax.\n\nTo all readers, please re-post, on all available social media, the same image that is referred to here. If the image appears \"everywhere\", the fact that Ms. Merchan MIGHT have posted it will be meaningless.  Fuck trump and all who ever supported him.", "Again, this is more nonsense. He is testing all these judges.He's hoping he can get them recused or get the trial extended. The judges are on to him and doing everything by the book. They are giving him a little lee way to not seem partisan.", "He must go to prison. There is no other place for him."]}, {"title": "What trump’s son posted about Biden on Easter vs what Biden actually said on Easter", "description": "", "time": 1711935143.0, "comments": ["In 2018 Easter was on April Fool's day.  I didn't hear a vast outcry from Republicans then.", "Any bets on which one went to church today?", "Ah, so Twatwaffle Jr lies as much as his dad.", "I’m starting to think that Trump kid isn’t very truthful.", "Annnnnnnnnnnnnnnnddddddddddddd they believe every word.", "I don't get why Republicans can't seem to understand that a lot of Catholics are indeed Democrats.", "He didn’t declare easter Sunday, he declared March 31st. Last year that was a Friday. Next year it is on a Monday. What a lying sack of shit. And where did he ban religious symbols. The rotten apple doesn’t fall far from the tree.", "The day can be two things at once. Easter won’t be on the same day next year, but **TDOV** will be on **March 31st** every year **forevermore**. Someone tell the repubs not to get their panties in such a knot and maybe if they wanna celebrate Easter then they should mind their own business like Christ said to do!?!\n\nThe trumps don’t celebrate holy days. They want to be worshipped instead of wanting to worship God. Biden is literally a devout Catholic. He received communion the morning of his inauguration. It was the first thing he did on the first day of his presidency. Do some people not notice these things?\n\nIn the end of times, they shall say, “Lord! Lord!” And Christ will say to them, “Depart from me, for I never knew you.”\n\n“Oh but Lord, when did we see you and not do these things for you?”\n\n“That which you haven’t done unto the least of my brethren, you haven’t done unto me.“ \n\nMay he hasten his return.\n\n“Fear not, for I have overcome the world.”\n\nShalom, salaam; peace, pas, pax!\n\nAmen. Selah. Amen.", "See that’s the difference. Republicans my family included take this and run. I’ve fact checked dozens of times. \n\nIf I saw Biden or his family saying this about trump, I go check if trump actually said it. Democrats do it too but republicans take this bait every time.", "Bottomless degeneracy is the MAGA superpower.", "I believe the Easter bunny brought Jr. one too many eggs that contain a white powdery substance.", "I stooped to their level to remind some of them that I'm free to worship whatever I choose. Part of this obscure amendment before the 2nd one.", "All of his kids should have been swallowed instead of hitting the egg.", "Yeah people who Trump to be a dictator don't get to call others \"sick\". They are the sick ones in this equation.", "Cool seeing the Easter Bunny and eggs on the [wh.gov](https://wh.gov) masthead.", "They can't let pesky facts get in the way of their ranting.", "Do you think that Donnie boi knows how a calendar works? I wish these ignorant bags of left-over fuckstains would get on with eating their own fucking heads...really.", "Fun fact, Easter is on the first Sunday after the first full moon after the Spring equinox for one reason.....\n\nAnd no... it's not because that's when Jesus died.\n\nIt was moved by the church to that day so it didn't accidentally end up on the same day as Passover.\n\nFor some odd reason celebrating Jesus's assent to heaven and sitting at the right hand of the all mighty god to become the beacon of peace, love and kindness throughout all the universe, doesn't sit well being the same day that god sent an angel of death to murder millions of innocent Egyptians.", "I didn't know why I thought it was Baron. Jr and Eric are so stupid I sometimes forget they exist.", "Well no one said Junior was intelligent", "Coke fiend posts again. WHO GIVES A SHIT ABOUT THIS COKED OUT SON OF A LITERAL TRAITOR. FUUUUUUCK HIM.", "CUlture war this time against the LGBTQ", "Truly dumb people, is more like it. Just curious as to how they have managed in life this far with their total lack of comprehension.", "Wasn't this also March 31 during Trump's reign?", "I know not many care about Utah as it's electoral is so small, but PLEASE help us turn Utah more purple! Help us defeat extremists by donating to Utah Alliance Coalition, a sub of Indivisible during April 1st - May 31st when we have a dollar for dollar match. \nWe'll be doing book forums, we'll be holding candidates meet and greet events and attending FamX to get the word about book banning out! \n\nYou can donate through ActBlue at\n https://secure.actblue.com/donate/utcoalition?fbclid=IwAR3oq7_Tgdh0IrWvahDq9LLfneQna9p9VgLYGeMvXUAE4Us--aXrGO-Gzcw", "Such hypocrites...", "They don’t care about lying as long as their supporters see the lies because everyone knows they won’t fact check it", "Oh my...w t ff?", "Both statements are real:\n\nhttps://www.whitehouse.gov/briefing-room/presidential-actions/2024/03/29/a-proclamation-on-transgender-day-of-visibility-2024/\n\nhttps://www.whitehouse.gov/briefing-room/statements-releases/2024/03/31/statement-from-president-joe-biden-on-easter-2/", "They know their only hope is to lie like the devil.", "Incredible", "Guess we really need a day for everything"]}, {"title": "The anti-abortion movement is losing the battle on IVF. It’s preparing to win the war.", "description": "Anti-abortion advocates worked for five decades to topple Roe v. Wade. They’re now laying the groundwork for a yearslong fight to curb in vitro fertilization.\n\nSince the Alabama Supreme Court ruled last month that frozen embryos are children, the Heritage Foundation and other conservative groups have been strategizing how to convince not just GOP officials but evangelicals broadly that they should have serious moral concerns about fertility treatments like IVF and that access to them should be curtailed.\n\nThey plan to appeal to evangelical denominations and their leaders to take a firm stance that IVF as practiced in the U.S. destroys human life. That, they hope, will reshape how conservative Christians — and in turn, the officials they elect — view the issue, just as it did on abortion. Ultimately, it could lead to laws that create a patchwork of IVF access in the United States, where the procedure is more accessible in liberal states and more limited in conservative ones.\n\nOrganizations including Heritage, former Vice President Mike Pence’s group Advancing American Freedom, and the Southern Baptist Convention’s public advocacy-focused Ethics and Religious Liberty Commission have worked behind the scenes over the last few weeks to distribute talking points, circulate policy recommendations and educate Republican officials and their staff about their ethical concerns with how IVF is commonly practiced in the United States.\n\nThe groups are not advocating banning IVF but want new restrictions that would significantly curtail access to the procedure, such as imposing more regulations on fertility clinics, limiting the number of embryos that can be created or transferred to the uterus at one time, and banning pre-implantation genetic testing, which they argue allows parents to discriminate against their embryos on the basis of sex, disabilities like Down Syndrome or other factors.\n\nAt the same time, they have been having conversations within their conservative Christian circles that have revealed how much work they need to do to convince evangelicals that there are ethical problems with the procedure. Most evangelical denominations have not taken firm stances on restricting fertility services like IVF.", "time": 1711969956.0, "comments": []}, {"title": "Trump paid Kim Jong Un $2,000,000 after Kim slowly tortured Otto Warmbier to death.", "description": "", "time": 1711913514.0, "comments": ["Remember. Trump doesn’t just love Putin!\n\nHe loves plenty of dictators. And doesn’t seem to get along with any democratically elected leaders.\n\nMust be a coincidence!", "‘America First!’ right? \n\nTrump also minted the [‘North Korea Summit’ peace coin,](https://www.theguardian.com/us-news/2018/may/22/donald-trump-north-korea-coin-kim-jong-un-nuclear-talks) hailing himself and Kim Jong Un as great statesmen.\n\nWhat a total fucking fraud.", "Sheer evil mixed with narcissistic ego and galling stupidity.", "Please God, take them both out. Soon.", "Then they sent him back basically dead. He died upon his return having been basically beaten to death. Trump is a perpetual loser and I don’t want to join his continuous shitshow.", "Fuck Donald Trump.", "\nKim Jung Un sends a $2,000,000 invoice for their ‘care’ of American hostage Otto Warmbier\n\nhttps://theunitedstatesblues.com/trump-may-have-agreed-to-pay-north-korea-2-million-for-its-care-of-tortured-american-hostage-otto-warmbier/", "Holy shit I thought they never paid North Korea, I always thought they ignored their demand for 2 million dollars, if true what grosses me out even more about this is that the money went straight to Kim Jong Un, I remember when his braindead fanboys were pretending that he should’ve gotten a Nobel Peace Prize for his visit to North Korea even though it didn’t actually make any changes happen.", "Trump wanted something from Kim.  Perhaps it was a deal to build a Trump resort in North Korea.", "It sure is strange he loves dictators and hates democracies.\n\nHMMMM. 🤔", "Imagine the screaming on fox news if Obama or Biden did this?!", "*Paid 2,000,000 for torturing him slowly to death.", "Trump gave the Saudis an ok to murder Kashoggi. ", "Trump sure loves dictators.", "Any Trumpanzes lurking here that want to remove their lips from Dear Leader Agolf Shitler's asshole long enough to explain this?", "Remember when Donald Trump cut a deal to get Otto Warmbier out of North Korea.\nHe couldn’t even do that, right.\nWe got Otto back a half dead zombie. \nWhile Donald Trump gave ￼$2,000,000.\n\nThis is the man you want as president\nRemember the love letters that\nDonald Trump never showed us.￼\n\nTrump couldn’t even get this done right.\nTrump wa￼s blinded with stars in his eyes\nfor his admiration of Kim Jong Un.\nTrump, was ￼so nervous he’s saluted one of Kim’s officers\nHe ￼has wet dreams about Kim and Putin.\nHe wants to be just like them.\nAnd Donald Trump wants all of us to worship him like a king.\n\nThat also means, jailing people that speak poorly of him.\n\nIf Donald Trump wins, he’s going to change the laws.\nHe talks about free speech that is a friggin laugh. \nHe’s a dictator. They will be no free speech if he becomes president. \n\nThink I’m lying. He already said he would want to take down MSNBC and have them all arrested. \n\nDonald Trump is actually telling us what he’s going to do you just have to open your ears and listen.\n\nSay what you’re a Trump supporter so you have nothing to worry about.\n\nBetter think again , the first thing dictators do is they take away the guns.\n\nThat’s right it won’t be the Democrats taking your guns away. It will be Donald J Trump. \n\nBecause dictators don’t feel safe in a society where everyone has guns.\n\nIook it up it’s in the history books.\nTrump is following Hitler’s playbook.\nIf Donald Trump wins you, me everyone Republican and Democrat is in for a very rude awakening.", "“The art of the deal?”", "Warmbier was from Ohio. Senator Rob Portman (now former Senator) negotiated for his release to help Warmbier’s family. \n\nYet even after all that, Portman licked Trump’s boots to the end.", "Trump saluting a North Korean general will always have a special place in American history. \n\nhttps://www.cnn.com/2018/06/14/politics/donald-trump-salute-north-korea/index.html", "I mean was he actually paid? Google searches for this and found we don't know.\n\nhttps://www.reuters.com/article/idUSKCN1S124D/", "We don’t have a clue yet how monstrous trump really is.", "Those are a lot of words to say he’s a traitorous piece of shit.", "Nothing says I want to be your friend than torturing one of your citizens and sending a bill for said hospitality.", "Im not finding any story that says we actually paid it. After these stories came out that trump approved the payment his admin came out and said no money was paid. I cant find anything out there that says it actually was paid.", "Don't judge people by what they say but how they act always.  \n\nThis is yet another story that confirms his love for dictators and strong men.  Will never be heard of in the Republican bubble sadly.", "He lets Donald in but not BTS. He gets an F.", "www.vote.gov", "I wonder what South Koreans think of Trump", "Let's see FOX News spin this. I remember this vaguely in the news awhile back. This was awful for the family.", "This story is 5 years old.  Trump is a bloviating shitbag, we know.  Why is this reposted?", "I've diversified my Media intake. I see the difference.", "My god just when I thought this man's stupidity and dipshit level foreign policy could not *possibly* have been any worse. I'm proven wrong again.", "Any comments that start  with \"trump paid...\" you know it's a bot."]}, {"title": "Conservative Oregon County Attempts Criminal Prosecution of Federal Employee", "description": "", "time": 1711975133.0, "comments": []}, {"title": "Team Trump Plots to Send DOJ After New York AG for Letitia James &amp; Other Prosecutors for Election Interference", "description": "", "time": 1711979643.0, "comments": []}, {"title": "Lex Luthor Of The Internet': Meet The Man Keeping Far-Right Websites Alive", "description": "", "time": 1711973998.0, "comments": []}, {"title": "Federal court reinstates lines for South Carolina congressional district despite racial gerrymander ruling", "description": "", "time": 1711980094.0, "comments": ["Because the south…", "Delay delay delay . . . whoops, now we've run out of time to implement this!"]}, {"title": "“Today, we show millions of transgender and nonbinary Americans that we see them, they belong, and they should be treated with dignity and respect.” – President Biden", "description": "", "time": 1711909678.0, "comments": ["Hell ya. That's my president", "Heck, yes, all people do have value, regardless of a birth difference.", "Makes me so happy he’s our president", "Why can't these so called \"Freedom Loving\", \"Small Government\", \"Don't Tread On Me\" **hippo-crits** just \"Live and Let Live\"? \n\nThere just friggin bullies!"]}, {"title": "Cesar Chavez’s Family Criticizes R.F.K. Jr. for His Chavez Day Event", "description": "", "time": 1711973957.0, "comments": ["This article may be behind a paywall. You can add 2-4 paragraphs as a quote in a comment. *Do not post the text for the entire article.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*", "Non-paywall:  [https://archive.is/X0W6g](https://archive.is/X0W6g)\n\n&gt;A campaign event on Saturday intended to galvanize support among Latino voters and organized labor behind Robert F. Kennedy Jr.’s presidential bid instead drew condemnation from the family of the labor organizer Cesar Chavez, who accused Mr. Kennedy of exploiting the Chavez name for political gain."]}, {"title": "China’s advancing efforts to influence the US election raise alarms", "description": "", "time": 1711957412.0, "comments": []}, {"title": "WATCH: Trump and GOP attack Biden for recognizing Transgender Day of Visibility on Easter Sunday", "description": "", "time": 1711944286.0, "comments": ["Tackling all the pressing issues which  so need attention. Let's attack Biden for  a day that was created 15 years ago which he had nothing to do with. \n\nNext week on April 7th, they will be attacking Biden for Metric System Day falling on the same day as National beer day.", "Next year, Easter is on 420. Woke has won! Burn one for Jesus.", "International Transgender Day of Visibility is **always March 31**.   \n\n**Biden issued the same proclamation in 2021, 2022, and 2023**. It just happens that Easter falls on this preexisting annual day of awareness in 2024.", "Fuck Donald Trump, and fuck the GOP for twisting and obfuscating anything and everything to support their own narratives irrespective of facts.", "Just ignore the noise . Focus on the Blue on November 5th. Biden will sweep the election from Trump. A bigger victory than 2020. Go BLUE. We got this. We just need to show up to vote. Let's do our part for our country and our president.", "I thought Jesus said to love one another, and he who is without sin cast the 1st stone.  You know for all the yelling/screaming of morals, wanting to execute women for abortion/ivf in TX, and wanting to execute top democrats:  these so-called Christians are a little hypocritical and choose the wrong poster boy, huh?", "Ah yes attacking Christian’s on Easter. Classic way to spend the holiday by the Trumps."]}, {"title": "Cognitive Dissonance", "description": "", "time": 1711943805.0, "comments": ["What would be wrong with Obama being a devout Muslim, anyway? It’s a religion. He can be any he wants and be a good man/leader. Trump faking being Christian is about his hypocrisy", "Who the heck is that family supposed to be?  I would say there would be no way he would rent a family for an appropriate look at a photo op but we all know he would.", "I mean this picture is partially accurate. He's with a woman that's not his current wife...again.", "Trump hasn't been that thin since he was 10 years old.", "I wouldn’t let that orange creep get that close to my little girl.", "WHo's that he's sitting with? Another mistress?", "The only accurate part of this cartoon is the little girls uncomfortable face- I'd be skittish if a known sexual predator with an affliction for underage girls was hugged up on me too, and wtf is the \"wife\" holding? Isn't this supposed to be a church? Why tf is she holding a book that says \"trump\"? Totally not a cult though", "I'm sure Trump is about as religious  as I am. ( I'm an Atheist....)", "Whose kid is he fondling?", "Getting real handsy with that random little girl", "Yup, and the same people who think impoverished people from the southern border are a yuuuuge threat to America, but their fake-n-bake messiah stealing state secrets and cozying up to Putin and Kim is AOK. No worries there!", "With another woman that isn't his wife while still married, at least it's accurate there.", "Man they are obsessed with that 1940s aesthetic. Wild.", "Why is he touching that young girl like that?", "How Trump is Making America Great Again!\n\n[https://imgur.com/a/nRWeBnk](https://imgur.com/a/nRWeBnk)", "As an atheist, I don’t want to claim him.", "Insane.", "Ushers: &lt;pass the offering plate&gt;\n\nTrump: \"Oh, thank you! &lt;Dumps it in his pocket&gt;", "Donald Trump is a non-whitewashed, accurate example of what Christianity is and as always been, and it is no coincidence that Christians consistently follow leaders like  Jimmy Swaggert, Kenneth Copeland, Jim Baker, Eddie Long, Joel Osteen, Benny Hinn, Creflo Dollar, Paula White, Robert Tilton, Jerry Falwell Jr., Ted Haggard, . . .", "Anyone stupid enough to believe in religion is stupid enough to believe that this image represents reality in any way. The man pays porn stars for sec while his wife just gave birth. They know their audience for this garbage."]}, {"title": "Donald Trump did not paid off slain officer's mortgage.", "description": "Apparent source of claim that Trump paid off slain officer's mortgage walks back statement.\n\nRight-wing news outlets and MAGA influencers were quick to jump on rumors that Donald Trump had paid off the mortgage of fallen New York police officer Jonathan Diller, but it appears that's simply not true.\n\nDiller's mortgage was paid off, but it was by an organization called Tunnel to Towers Foundation.\nHas absolutely nothing to do with Donald Trump.\n", "time": 1711910152.0, "comments": ["Rump didn't even pay for the McDonald's for police that accompanied him there on the way back to his plane with the golden toilets. ", "Donald Trump did not paid off anything ever.", "I'll bet the group are a bunch of morons that support him", "Yeah I didn't buy that and neither did Drumph", "Donnie Brokey never pays his own bills let alone others like the slain officer's mortgage.", "[removed]", "I’m actually surprised Trump himself didn’t lie and say he paid it.  It sounds like something HE himself would say:  take credit for things he didn’t have anything to do with.", "Well of course not. I knew that was a total lie the minute I heard it.", "MAGA is totally built on lies."]}, {"title": "Republican admits impeachment probe hasn't found any crime by Joe Biden", "description": "", "time": 1711899781.0, "comments": ["How much money has been spent on this already??", "“Little girl admits she didn’t find any pixies in the garden”.    \n    \nYeah no shit.", "Duh.  Anyone with half a brain knew this was a waste of time and tax payer money and was based on a complete lie.\nVote blue and end this pathetic rapist and his backwards party", "They tried to “manifest” their feelings and nothing happened.", "\"Republican admits GOP does NOTHING except waste time and money with frivolous bullshit.\"\n\nFixed it for you.", "Just like they tried to do with Clinton, spending 14 years investigating Whitewater/Filegate/Travelgate despite the DOJ and FBI telling congress there was no sign of a crime.", "Just a distraction. ", "There must be a personal cost to all that participated. We must ensure that such bafoonery doesn't keep happening.", "But that’s not really an important detail.", "No shit sherlock. No crimes committed by an individual means no impeachment.", "Wait … I thought he committed multiple high crimes and misdemeanors by:\n1.  Eating an ice cream while wearing sunglasses in public\n2.  Being 81 years of age\n3.  Being a Democrat\n4.  Winning the 2020 Presidential Election\n5.  Having a cat as a pet in the White House\n\nDid I miss something here?", "The Biden’s corruption runs so deep they’ve been able eliminate all signs of their corruption! They need to be prosecuted!!\n\n\n\n/s", "Lmao drop the bad news on Easter Sunday. That poor schmuck who had to go on NBC on Easter and drop this. Actually, nah fuck that guy.", "That's happens when you start an impeachment without knowing what the crime for it will be.", "Don't worry, everyone. This just hurts them and brings swing voters and such to vote for Biden. \n\nThey have only hurt themselves with their radical views on womens reproductive rights, Medicare, Medicaid    LGBTQ+, transgender, school children, ACA, and so on.  \n\nA lot of people are not voting for him cause if TFG is elected, it would hurt the people in many ways. Plus, many are just tired of his antics. \n\nLet's stay strong 💪 and make sure President Biden wins by more than 8M votes in November.  VOTE  BLUE", " And Comer has a book about the Biden crimes. Seems like a massive conflict. https://www.axios.com/2024/03/29/comer-book-deal-biden-probe", "Vote to reelect President Joseph Biden  and Vice President Kamala Harris24 and vote to give them a working congress not this Trumpian shit show!  Vote against every single Republican candidate on the ballot!  Vote blue save the red white n blue", "I’m a republican iam here to find out why do so many democrats support release and no bail it does not make sense to me and iam really trying to find out the reasons for this ,this is not a troll post I want to know"]}, {"title": "‘Bullies’: Biden effigy showcases a Johnson County Republican Party shaped by Trump era", "description": "", "time": 1711898245.0, "comments": ["Depicting Biden bound and gagged in the back of a truck combined with what is posted in this article can only lead to one conclusion.  They are prepping the horde for that \"blood bath\" tRump is calling for.", "How about we steal  the golden false god statue of Trump ( Google it) they all kneel in front of and all piss on it .", "Someone needs to come up with one of trump in his depends...", "&gt; Party chairwoman Maria Holiday, declaring that as Republicans “we are better than this.”\n\nI think she just has to admit that this is exactly who they are: Petty, vindictive, and violent."]}, {"title": "Undocumented migrants in Texas were 26% less likely to be convicted of homicide than native-born Americans over the last decade", "description": "", "time": 1711911890.0, "comments": []}, {"title": "Congressional Dems Flirt With Heading Off Supreme Court On Mifepristone", "description": "", "time": 1711897829.0, "comments": ["Excerpts:\n\n\n\nA Grim State of Affairs\n\nIt’s a grim moment for election workers across the country. \n\n\n\nBut, in Maricopa County, Arizona specifically, ground zero for 2020 election misinformation and election worker violence, it’s especially dark. In preparation for November, officials in the state’s largest county have renovated the voting infrastructure in response to extensive violence and threats to workers. The county’s tabulation center, said Maricopa County supervisor Bill Gates, now resembles “an encampment” with permanent fencing, barricades, badge requirements to even enter the parking lot of the facility, and metal detectors for entrance into the building. \n\n\n\nThe measures are critical in order to avoid another what Gates describes as a “Lollapalooza for the Alt-right.”\n\n\n\nCongressional Democrats Flirt With Heading Off Supreme Court On Mifepristone\n\nJustices Clarence Thomas and Samuel Alito laid the groundwork to a future challenge to abortion drug mifepristone, couched in Tuesday’s arguments over the Food and Drug Administration’s handling of the drug. \n\n\n\nThat original case was clearly dead in the water, its legal standing too dubious for even most of the bench’s right wing to swallow. So Alito and Thomas started signaling to anti-abortion litigants that if they wanted to bring another case — challenging the legality of mailing mifepristone under the Comstock Act, a 19th century anti-vice law — they’d be amenable."]}, {"title": "It must be defeated. Happy Easter", "description": "", "time": 1711906524.0, "comments": ["and selling bibles", "Why does he look like Alec Baldwin?", "Hitler also said he cared about Germany and was gonna return it to its former glory.  Fascists will always wrap their rhetoric in the flag of patriotism.", "So the Lord died for my sins , he must have put in overtime for this one", "It will be defeated, vote blue!", "**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*", "Bet this picture gets repurposed unironically."]}, {"title": "Spread the word everone, so no one forgets!", "description": "", "time": 1711983563.0, "comments": ["And idiotic trade wars that that drove up costs in multiple sectors just before the supply line was hamstrung by COVID.", "It’s not “inflation” it’s called corporate greed. The only things inflating are the billionaires wallets.", "$880 billion in PPP “loans” that over 75% of which went to top income earners", "Not to be a dick but: What inflation? Inflation has almost flatlined thanks to Biden policies. What you are actually seeing is unchecked corporate greed.", "This is half right and half wrong. \n\nWhile Trump is certainly the guilty party, it was his useless Trade War that jump-started this period of hyper-inflation. Covid was such a major disruption to our daily lives it made us collectively forget about the trade war. \n\nSupply chain disruptions began BEFORE covid. Dean's Dairy (the largest dairy company on the US) went under BEFORE covid because Canadian retaliatory tariffs in response to Trump's poor business instincts. \n\nFailures addressing covid was the icing on the cake.", "This is a great example of why I love democrats.  We can actually disagree with memes and discuss it, rather than just shouting AMEN!   That being said, I disagree with this meme.  He can be blamed for many things, more than any other president in history...but probably not inflation.  He sure didn't help it, but didn't cause it.", "Not to mention the 8 Trillion he added to the debt and the fat tax cut where 1% of the people received 80% of the savings.", "Pack the god damn churches on Easter Sunday in the height of the spread while we are at it.", "Inflation is mostly caused by the GOP, the initial inflation from supply chain issues was Drump related, the rest is from not enforcing minimal corporate oversight, zero anti-trust efforts, zero criminal investigations in to fraud/abuse by corporations (like his own was and is committing).. It is corporate greed mostly with a sprinkling of climate related problems and other oversight issues that are slowly being addressed by Dems.", "Blaming the current price of consumer goods on anything other than those who actually set the prices is just distracting and deflecting.  \n\nThe relative handful of corporations that monopolize key sectors of the economy are to blame.  Greedy CEO’s and shareholders took a hit with Covid so now it’s profit taking time.  RECORD PROFIT TAKING TIME.  \n\nTime to call price gouging for exactly what it is.", "The better question is how will trump fight inflation now - tax cuts for rich people and tariffs are both inflationary policies - and that’s his entire agenda", "Well, that and his tax cut for the wealthy and whatever else went into his $8.4 trillion addition to the deficit.", "Don't forget his disastrous trade war.", "Ngl, that picture is still really funny to me lmao. I can't with that face", "More like the media hysteria over inflation allowed corporations to arbitrarily increase prices and blame it on Covid Stimulus money.", "Can someone, Anyone, explain why inflation is because of Trump's response to covid (and any other Trumpian reasons for high prices) in small simple words so that I may use those words to explain things to the small simple people in my life. Thanx", "“ isn’t it way past his jail time “", "Why do people got to be like this. Inflation is a world wide phenomenon from pandemic not the fault of any one country. You also acting like he controls state response to Covid. Not like I am going to act like I am knowledgeable on all the ways Trump had a hand in Covid response, but blaming it on any individual is ludicrous.", "Well, initially yes. But let’s be honest, corporations are raking in record profits because they’re run by fucking pieces of shit that use the excuse of inflation to price gouge.", "I hate Trump more than most, but this meme is just wild and unbased accusation.", "It was worldwide. Both the pandemic and inflation. Trump’s failure is his inability to react to the pandemic which cost the country a million lives. (again not all his fault) The chaos in this country exacerbated inflation worldwide too. \n\nHe is a failure any way you slice it. We just happen to be ignorant enough to elect his fatness president.", "More like from his enormous tax cuts to the wealthy tbh", "And multiple seating representatives as well!", "I don't think anyone seriously believes this. Even the most trump hating democrat still has basic knowledge of economics and a working memory... I hope.", "And companies hiding behind inflation being in the news to raise prices despite record profits.", "Ehhh...I'm a little worried this might be taken as \"support/stimulus checks were the wrong response,\" on top of the actual inflation story being non-monocausal.", "And the Republican party’s deregulation of markets that allow for monopolies", "Also the greed of rich corporate bastards who are probably also red.", "There was going to be inflation either way....\n\nTrump's anemic response *exacerbated* the issues, but didn't cause them.  When there's a huge decline in activity, and then a huge spike in activity, you're going to see price inflation on the tail end due to the extraordinary demand.  The part where Don shares some of the blame is that the spike wouldn't have been as large if the response to COVID was better.", "I keep trying to explain this very thing... but so many just don't seem to grasp simple economics.", "I also know for a fact that companies are jacking prices up to make Biden look bad.\n\nCome on, Walmart, Sam‘s Cola was 62¢ in 2019. It did not become more than twice as expensive to make since.", "**Bot message:** Help us make this a better community by clicking the \"report\" link on any memes, pics or vids that break [the sub's rules.](https://old.reddit.com/r/democrats/about/rules/) Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/democrats) if you have any questions or concerns.*", "I think I read somewhere that American inflation numbers are actually pretty good compared to other countries.", "I stopped shopping at Walmart. I started exclusively shopping at Super 1. Something about double cash back on my credit card. This store does not have everything I like. They run out if I wait until the last minute. Good for them.", "And as soon as trump gets in and the inflation goes away it was all Biden’s actions while he was in office. Right?", "Honestly no matter how many times I say this to republicans they refuse to acknowledge it and say inflation is actually cause the government is printing too much money. When in reality the minting rate has been the same over the last 3 years.", "Someone explain to me how so", "Not defending trump, but what did he do exactly?", "Cap", "Mishandling Covid Trump caused the GCS Global Covid Shutdown.", "Congress has absolutely no hand in this?", "No it isn't.  That certainly played a part for sure, but it isn't the cause.", "how", "More like lack of response", "Lol to be naive enough to believe this. The bipartisan system is a joke", "I honestly don’t know that there was a way to keep the country from collapsing and at the same time avoiding any future economic ramifications. Of all the things you can rightly pile on this piece of shit this is one that I’m hesitant to do so.", "Hang on, it was transitory when Biden took over and then it was because of Putin’s war. How has it retroactively become Trump’s fault?", "What policies are you blaming the inflation on? Because I feel like the ones you're blaming him for are the ones Democrats were pushing for in congress.", "Inflation didn't start till after bidens green new deal", "Wow! They were right: The left really can’t meme."]}, {"title": "Embittered Republicans plot to knock off House GOP’s hard-right leader in Virginia primary feud", "description": "", "time": 1711983544.0, "comments": []}, {"title": "Chinese Accounts Posing as Trump Fans Ahead of Election", "description": "", "time": 1711979172.0, "comments": ["Not hard to do.  Trump fans do not have a good grasp of English and do not understand much about the US.  A relatively educated person from any country could easily pose as a Trump fan online.  And that's just a sorry fact about a significant portion of our population. :-)", "Wow it's almost like Russia and China want Trump as president. Why oh why would they want that?!?! /s", "Our enemies are relentless, and they've found massive cracks to exploit. The free world and its supporters must hold strong!", "Trump + Fascist Dictatorships = ❤️", "Easy way to combat it. Just post Tiananmen Square Massacre (or similar phrases) in Mandarin, or other related code numbers for the event. The Chinese government people go away VERY quickly. \n\n六四屠殺 - June 4th Massacre\n\n8964 - the date of 1989/6/4\n\n六四鎮壓 - June 4th Crackdown\n\nVIIV - Roman numerals for 6 and 4, the month and day\n\n民主沙龙 - Democracy Salon, a student group", "Trump wants to slap 100% tariffs on goods imported from China. What the hell are they thinking?", "Like Russia, I’m sure China is doing what they can to cause instability by posting inflammatory messages for/against both sides.", "According to MAGA it’s their first ‘menment rights", "Trump has proven to be the perfect idiot for dissonance in the u.s.. So of course in the age of social media there are many fake accounts that are fans of former president business. \nIf you wanted to destabilize a country you would use the best tools available. I’m not sure how this is much different than what our government does as well."]}, {"title": "How Anti-Vaccine Activists and the Far Right are Trying to Build a Parallel Economy", "description": "", "time": 1711973887.0, "comments": []}, {"title": "Exclusive: Trump allies plot anti-racism protections — for white people", "description": "If Donald Trump returns to the White House, close allies want to dramatically change the government's interpretation of Civil Rights-era laws to focus on \"anti-white racism\" rather than discrimination against people of color.\n\nTrump's Justice Department would push to eliminate or upend programs in government and corporate America that are designed to counter racism that has favored whites.\n\nTargets would range from decades-old policies aimed at giving minorities economic opportunities, to more recent programs that began in response to the pandemic and the killing of George Floyd.\n\nLongtime aides and allies preparing for a potential second Trump administration have been laying legal groundwork with a flurry of lawsuits and legal complaints — some of which have been successful.\n\nIn February, America First Legal filed a civil rights complaint against the NFL over its \"Rooney Rule.\"\n\nThe rule — named for Dan Rooney, late owner of the Pittsburgh Steelers — was instituted in 2003 and expanded in 2022. It requires NFL teams to interview at least two minority candidates for vacant general manager, head coach and coordinator positions.\n\nIn 2021, Miller's group successfully sued to block the implementation of a $29 billion pandemic-era program for women- and minority-owned restaurants, saying it discriminated against white-owned businesses.\n\nOther Trump-aligned groups are preparing for a future Trump Justice Department to implement — or challenge — policies on a broader scale.\n\nThe Heritage Foundation's well-funded \"Project 2025\" envisions a second Trump administration ending what it calls \"affirmative discrimination.\"\n\nSuch groups have gained momentum with the Supreme Court's turn to the right — most notably its recent rejection of affirmative action in college admissions. The court ruled that programs designed to benefit people of color and address past injustices discriminate against white and Asian Americans.\n\n", "time": 1711969385.0, "comments": []}, {"title": "Average Santa Barbara March rainfall is 2.4\" It got 3.93\" over the weekend.", "description": "", "time": 1711942444.0, "comments": []}, {"title": "How the Biden operation mobilized right after the Baltimore bridge collapsed - POLITICO", "description": "", "time": 1711906256.0, "comments": []}, {"title": "Barack Obama Tells Voters Why He Picked Joe Biden for VP, and How It Applies Now", "description": "", "time": 1711902285.0, "comments": []}, {"title": "Democrats hope Biden could get a boost from down-ballot races under Wisconsin's new legislative map", "description": "New legislative districts adopted last month erase Republican advantages that gave the GOP dominance of the Wisconsin Assembly even as Democrats won 14 of the past 17 statewide elections. Democrats think they can now compete for a majority, but also that invigorated legislative campaigns can help turn out votes for President Joe Biden and Vice President Kamala Harris in November.\n\nThe Democrats argue there will be renewed personal attention to neighborhoods in small towns, suburbs and rural areas that had been part of GOP-heavy legislative seats but are now in more competitive districts. Those districts were seen as not worth the effort before, when Democrats’ only hope was to stave off veto-proof GOP majorities. Now, they will get more campaign staff and volunteers to drive turnout.\n\nWisconsin is also among a half-dozen battleground states where Democrats are defending Senate seats in hopes of protecting their 51-49 majority. Sen. Tammy Baldwin, running for a third term, is likely to face millionaire businessman Eric Hovde who faces only nominal Republican opposition in the Aug. 13 primary.\n\nBaldwin agrees that she could benefit from “reverse coattails” of legislative races. Previous districts “were so gerrymandered, which meant that there were whole swaths of Wisconsin where there weren’t competitive races,” she said.\n\nOf the Assembly’s 99 seats, about half remain reasonably safe bets for Republicans. Democrats, who now hold 35 seats, have a better shot in 15 new districts. Some of those districts are on the outskirts of the Minnesota Twin Cities metro area in northwest Wisconsin and around Eau Claire to the northeast, both Democratic-leaning areas. Others are in the vote-rich Fox River Valley, including around Green Bay, where Trump plans to headline a rally on Tuesday.\n\nEven if Democrats fall short of the Assembly majority, Wikler figures that more aggressive canvassing for legislative candidates could identify people willing to vote Democratic in top-of-the-ticket races that have been tight in recent years.", "time": 1711901800.0, "comments": []}]