[{"title": "Are the anti-Biden Left equivalent to the Never-Trump Right?", "description": "Since the attack on Israel on Oct 7th of last year by Hamas and the forceful response to that terrorism by Israel, many on the Left have protested Biden and those Democrats who support Israel as unacceptable to the point where some say they won't vote for Biden in November. Similarly, in 2016, a group of conservative Republicans didn't like Trump because he didn't uphold conservative values or principles and vowed not to vote for him then and for many, ever again. They became Never-Trumpers. Some even decided to support Biden and left the GOP.\n\nDo you see a similar phenomenon happening to those who decry Biden's support for Israel and pledge not to vote for him for president? Will they become essentially Never-Biden liberals, where a noticeable few defect and even support Trump over Biden, just as some Never-Trumpers did? How would this development upend the presidential contest? What kind of visibility would these defections receive in the media?", "time": 1711910122.0, "comments": ["[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*", "I think the people who are democrats that are mad at Biden still hate Trump more. At the very best they will still vote Biden and at the very worst they won't vote at all. I don't see many of them actively voting for Trump but I am sure there will be that one person who does but they will be few and far between.", "The Never-Trump Republicans were closer to the middle than Trump's supporters. The Never-Biden Democrats are farther to the left than Biden's base.", "Hell no. The layman’s difference is that the Anti-Biden Left would also never vote for Trump.", "There’s a certain kind of leftist for whom getting mad at Democrats for losing comes second only to being mad at Democrats for winning since, at least, the Gore candidacy; so I really don’t think they were persuadable Biden voters in the first place.", "No.  Those opposed to Biden on the left (at least the ones you're talking about) are specfically trying to apply pressure on him to change policy.  They don't necessarily have opposition to Biden, just what he's doing at the moment, which is something that can change.  There's a decent chance in the secrecy of the voting both they'll actually vote for him, regardless of what changes eventually happen.  Never-Trumpers are opposed to everything about the person; there's not really anything the MAGA-wing could do to bring them onside, since ideologically, they're mostly aligned already.", "I’d say I’m anti-Biden, but it’s still in my best interest to vote strategically, which means Biden is clearly better than trump. Most “anti-Biden leftists” will acknowledge that Biden is absolutely better than Trump. It doesn’t mean we’re going to enthusiastically vote for Biden, but so far most protest votes I’ve seen have been about withholding primary support to show the impact they can have, while also planning on voting for Biden in the general. As people on this subreddit like to point out, we’re more to the left than Biden and the Democratic Party, so why any leftist would vote for Trump is beyond me.", "One big difference that is connected to the political spectrum differences others have pointed to (far left vs. moderate right) is that never-Trump Republicans are very much not the base of the Republican Party. The Never-Trump movement is deep-pocketed, but it’s mostly an elite phenomenon that has shown a complete inability to rally the Republican voting base around it. \n\nAnti-Biden leftists are also a minority in the Democratic coalition. But it is much more of a grassroots movement than an elite-driven movement. And it comes from the layer of the Democratic Party (young, urban, PoC) that tends to supply the activist base of the party. So in that way, the anti-Biden left is more of a “base” phenomenon, even if they also don’t pose a particularly severe electoral threat to Biden. ", "No. \n\nThe anti-Biden fringe left has never, and would never, vote for Biden.\n\nThe anti-Trump bunch voted for Trump, and they'll vote for him again. They're just posers trying to wash the stink off.", "No, there are no never Biden people. If we're talking about serious Democrat leaders.", "No. Because the democrats that don’t like Biden realize that voting for him is at worse just wasting 4 years of progress, where as the anti-trump republicans know that Trump getting into office means the end of the US being a democracy.", "I think the difference is that never Trumpers are corporatists who want the old Republican Party when it was politically correct and didn't pretend to care about the people, while far left people are anti-corporatists who dislike Biden for selling out to that same corporate mainstream.", "I can't see anyone on the left supporting Trump; but it's easy to picture them supporting Greens or another left-of-Democrat party. Or even sitting this one out, and fighting for House representation.", "They are similar in that there's a contingent of the party swearing off the party's candidate but that's where the similarities end. Personally, I'll vote for anybody who isn't a fascist. I don't think Biden is a great candidate, but I also don't think letting the country fall even further is a good form of protest. I understand why some people believe Biden doesn't deserve their vote, however.", "Trump received the second most votes in the history of our elections.\n\n\nIt took a record number of votes to beat Trump.\n\n\nPeople not voting Biden this time around is an huge issue even if they aren't voting Trump", "Not really. Anti-Biden leftists are acting on consistent principles, they've never really *liked* the Democratic Party, and Biden has been part of its establishment for 50 years. Anti-Trump Republicans are apparently shocked at their party's principles being carried forward, because they somehow can't see the throughline from Nixon, Reagan and the Bushes to Trump.", "The idea that the antiBiden left will vote for trump because of Biden's treatment of Israel ignores trump's attitude towards Israel.  The one smart political move trump has made is to largely ignore the middle east.", "This, right here, is part of the problem.  People really believe that there is actual equivalence between the left-wing and right-wing American politics.\n\n&amp;#x200B;\n\nYou can always discuss a subject as one side-vs-the other, but the merit or whether the two different sides of a topic are actually based on a realistic \"center point\" is a whole other matter.  \n\n\nTV stations, web sites and newspapers even need controversy and discussion to get attention and sell papers/ads, but in reality there is no such thing as equivalence in the American poilitical discourse.", "\"Never Trumpers\" will likely wind up voting for Trump. \"Anti-Biden lefties\" will probably stay home on voting day while furiously tweeting how morally pure they are.", "They aren't comparable, one wants different policies and where here before Biden and will be here after. The never Trumpers see danger in Trump and fear he will destroy America.", "I consider myself anti-Biden left (I’m still going to vote for him but I disagree with and loathe so much of his policy, especially foreign policy. But Trump is a literal fascist so… I digress)\n\n\nThey’re not entirely equivalent because I think the Anti-Biden left’s issue with Biden is mainly policy vs the Anti-Trump right’s issue with Trump is mainly optics.\n\nMost of the anti-Trump right finds Trump embarrassing, especially in regards how Trump makes them look to the rest of the world. They’re perfectly fine with his 2017 tax cuts for the rich, the Federalist Society Hacks he appoints to the judiciary, him being extremely pro-Israel, him being hawkish on Iran, etc.\n\nThey’re probably not okay with what he thinks on Russia/Ukraine, his tariffs and the stop the steal/January 6 stuff. But by and large they agree with Trump on the vast majority of policy. \n\nThe Anti-Biden left dislikes Biden because most of the left seeks to end the capitalist system we live in. That’s the end game. (Most of us don’t actually think it’s something that can end over night.) Biden (despite some more pro-labor policies than any Democrat since LBJ) is still by and large a neoliberal capitalist in his ideology. \n\nAdd on top of that we think Biden is actively assisting in a genocide…. So yeah. I wouldn’t say I or most of the left are big fans of Biden for those reasons.\n\nMost of us do actually think Biden is the lesser evil, but the left is slowly starting to realize that electoral politics is only one piece of the puzzle.\n\nYou also need to build up unions, educate the masses about what socialism actually is, change the media landscape, and make people aware of the contradictions of the ruling class.", "Anti Biden people are to the left of Biden (which honestly, he's pretty conservative, so most of the party is probably left of him, but this segment is far left of him).\nThe never Trump people are just against fascism, they are all over the spectrum politically.  No one would call Liz Cheney a moderate, she's a far right Republican, she just isn't a fascist.", "I don’t think so. I think the anti trump right is mostly opposed to his personality. The anti biden left is mostly policy focused. And mostly opposed to his support for Israel.", "         First stop a support in money and weapons to Isreal.  As you said Isreal has more weapons than hamas. Good. But they woukd not be able to do near as much as they do with our weapons. From 2023 stats we supplied 69% of their weapons probly more since Oct 7. So yes it would make a huge difference. \n         Almost the entire UN is saying that there is a genocide going on there. It is in our interest in multiple ways to not fund them; one being it's against the law to fund and support a genocide also when your bombs are killing kids, parents family members all around the world it is making terrorist more likely to want to attack us. \n           For anyone who says that isreal's form of attacking terrorist is fine then put that on american soil and see how much you woukd agree with it. Woukd you let the Russia supply Isreal with weapons to bomb hamas supporters or terrorist in large cities in America? Woukd that person be fine with hospitals being bombed, schools or religious buildings because they are believed to have terrorist in them hiding with them? \n           If that type of war is supported then all Hitler needed was to say was that the Jews were terrorist and needed to be felt with for Germany to be safe. \n           I say all of thiae because it us our tax dollars going to kill families babies and civilians. One terror attack does not justify an extermination. Hearing the rhetoric from Isreals officials and the business class already talking about new beachfront in Gaza to be sold soon. It is sad amd backwards that anyone could support this. For most of those Americans refusing Biden it's not just because of some of his other policies it is because he is implicit on supporting a genocide and terrorism.", "I feel that the left will never vote for an open fascist like 45.\n\nWhich means that they will either not vote for president, or vote third party.\n\nAs a reminder, I would argue that the non-voters sent the most savage message possible in 2016.\n\nNeither side paid attention to them.  They stayed home, or didn’t cast a vote for president, or voted third party.\n\nAs a result, the Dems threw away an election that was clearly theirs to win.\n\nHad they campaigned in the Rust Belt, and worked to win some of those working class votes on the left, the US is a different nation.\n\nBut the DNC is clearly much less comfortable with the entirety of the political left than they are with the very far political right.\n\nAfter all, right of center corporatists and far right corporatists have far more in common than either has with people who actually give a damn about the little people, the bottom 90% of America.\n\nTry to learn from the past.\n\nAnd no, not voting for someone whose policies are unilaterally opposed to yours doesn’t mean supporting an open fascist.\n\nIt means that you’re not willing to sacrifice people elsewhere just to avoid sacrificing another group of people.\n\nBiden is sacrificing the Palestinians to keep the Israelis happy.\n\nTrump sacrificed the Kurds to keep the Turks from doing bad things to his Turkish holdings (allegedly).\n\nYes, one is worse than the other.  But that’s how many people view this election.", " No. Many never-Trumpers will vote for Biden while virtually no anti-Biden will vote for Trump.", "[deleted]", "Yes. Yes. Probably decisive. Will be ignored or attempts to shame them into voting for him.", "There is no such thing as never Biden liberals.  Biden has to watch out for people (the casual left) not voting and the male vote.", "Similar, except I think there are more anti-Biden left and that’s why Trump will win.", "To me, the only comparison between the two is that I think both groups are misguided.", "I don’t know if it’ll reach the point where these people start to vote for Trump in opposition to Biden, but I could see a situation where lots of young leftists abstain from voting in the next election and we have another Trump term. A lot of college aged kids are engaging in boycotts of anything that could have the slightest association with supporting Israel’s campaign, so I don’t see it as something that is too far out of the realm of possibility. Biden I think has realized this too and is trying to turn the tide by changing his tone on Israel. I’m curious to see if it’ll work, because right now I don’t believe many of the youth are going to come out of their radical Instagram holes to support “Genocide Joe.”", "Never trumpers are to the left of trump, and  the anti biden left is to the left of biden. So I guess that's the equivalent more or less. Sure", "Fundamentally, these are two very different kinds of groups. The anti-Biden left is largely about specific policy or position issues. While they may stay home in November, they aren't likely to jump to another candidate, because none of the rest of the national candidates have a better (in their eyes) position. The never-Trumpers, on the other hand, don't necessarily have policy issues with Trump. There problems are in his very style and personality. They are more likely to jump, because they do have alternate candidates who, while they may have more policy disagreements with (such as Biden), are more appropriate to the office of President.", "The two are similar in that they both reject their respective candidates on a truly heart felt principle. The Never-Trump Republican has propensity to side with the prior powers that be with conservatism of the Edmund Burke slow gradual reforms without getting rid of the valuable aspects of the current status quo. The Never-Biden Left are opposed to the gradualism of the liberal establishment, that there are brightlines that should never be crossed even if led across them by allies who have always been allies. If the UK responded to IRA terrorism in the 1970s-1980s with an invasion of the Republic of Ireland, would the liberal Establishment (of which Biden would have been a junior member of at the time) cut ties with their NATO ally? Unlikely, but there would be plenty of voters who would have had a similar response to the Never-Biden voters today that Israel has crossed the brightline with the 50+ year brutal occupation of West Bank, Gaza, and the Golan Heights (which Israel succeeded in depopulating all Arabs from and completed the conversion to wholly Israel, recognized by Trump and not being rescinded by Biden) and the deliberate starving of 2.2 million people in Gaza by the IDF.\n \nEither you are against war crimes or your not, but you won't get voters who find supporting war crimes as being beyond the pale without acknowledging the crimes against humanity that Israel is committing. Never-Trump right see as brightline that steady and dependable values are the definition to being a conservative, and like giving darts to a monkey Trump may wildly fling about policy that hits a bullseye for the conservatives but the capricious nature is never going to change about Trump. Never-Biden left sees the support of Israel as the brightline that can't be compromised despite Biden given compromised lipservice in that regard (\"my administration has strongly communicated with Netanyahu that we are greatly displeased with the civilian loss of life\" will never be enough to get Never-Biden voters back) there's more deliberateness in Biden's actions that he won't deliver for the Never-Bidens like Trump can for the Never-Trumps.", "Trump won in 2016 without the support of the never Trump right. Biden is going to have a much more difficult time winning without the FULL support of the left as most of the liberals I am personally friends with are either voting for Trump or not voting at all. It seems to really boil down to the economy and the fact that things like eggs, that were $1.60 in 2018 are now $4.38... just one example but I don't think I need to argue that inflation is hitting the average American HARD. People remember the good economy under Trump and people do not seem to be enjoying the disaster we are currently experiencing.", "No... the anti-Bid3n left are also Never-Trumpers. They are also intelligent enough to know a third party vote is a vote wasted that helps Trump win.", "How can people still be saying this isn’t a genocide? We have numerous reports showing it is. This is a genocide. They are indiscriminately killing everyone. They are shooting kids in the head like yall are either purposely ignoring this or you’re just stupid. I don’t get it. Wtf is wrong with yall?", "There have always been people so exaggerated to the left or right of the political parties. We see them all now bc of the internet and the fact the gop had to embrace them bc they didn't have many normal voters left since their policies are so terrible.\n\nRegardless, no the people on the far left or who've fallen for the pro Palestine propaganda likely wouldn't have voted at all. But to vote for trump over their best hope to see ANY positive change in Gaza would be so ridiculous.\n\nAlso we can't pretend the dems religiously worship Biden the way the gop does trump. We just...vote for people who seem to have the best ideas to get progressive policy enacted. That's it.", "No, in the sense that anti-Biden Democrats are anti-Biden for policy reasons, and anti-Trumpers are anti-Trump for personal reasons. \n\nWhen one would ask most anti-Biden Democrats why they are anti-Biden, most would probably say that it is because he supports Israel, or he furthers the Military Industrial Complex, or because he’s a neo-liberal. Forgetting, for a moment, one’s own political leanings, these are all very good reasons to oppose a candidate. \n\nI presume most anti-Trump Republicans do disagree with Trump on some issues, but they most likely still mostly agree with Trump on core issues e.g. tax cuts, securing the border, etc. The main reason I see why some former Republicans leave the party, is because they can’t stand Donald Trump himself. They cite how Trumpers have become a cult, how he has taken over the apparatus of the Republican Party, etc. Also very valid reasons to oppose Trump. \n\nHowever, fundamentally, the reasons are very different. Policy disagreements cannot be considered the same thing as Disagreements with a candidate personally. \n\nThese are, of course, only my own personal findings.", "There will not be a place in hell hot enough for what Trump did to those kids in Texas. They are phoked for life. When I tell people this and they just shrug I cross them off my list of mentally stable people.", "Most of the anti biden democrats are simply negotiating with the party to get more progressive ideas on the party platform.\n\n\nMost of the never Trumpers are old school republicans who still love the usa and want to preserve global democracies", "Anti Biden are more political extremist than Biden, they are too far left for him. Never Trump are more moderate than him. The anti Bidens could stay home but would never vote for Trump. Never Trumps could vote for Biden, but based on how Trump dominated in primaries I don't think there is really as much as them anymore.", "Biden is committing a genocide.  That is how I see it, that’s how anyone who has turned out to the protests sees it.  More than that, the genocide has opened/reopened people’s eyes to what Israel was doing beforehand and where politicians like Biden and Trump have been when it comes to similar issues like Ukraine and the Iraq war.  No one who believes we are committing mass atrocities, and have a disregard for doesn’t think Trump wouldn’t do the same or worse as well, certainly.  So, folks who protest Biden and other Dems for the mass atrocities they are committing will not flip support to Trump or republicans.  The problem will be an elevated version of the choices leftists have long faced, to not turn out to vote this time (or perhaps never again) to become more active in the Democratic Party to make it a party that would never support the commission of atrocities and human rights violations it does now, and/or build a 3rd alternative to the two parties.   What the primary “uncommitted” results suggest to me, is that unlike before there may a significant contingent of anti-Bidenites who will operate more like the radical republicans during the Reconstruction and are in open, coordinated combat with much of the rest of the party and start taking over leadership.  I hope it turns out better for us than it did for them.", "The pro Palestinian group are the idiots who fall for MAGA disinformation and propaganda. They aren't a real group.", "No. \n\nNever-Trumpers are divided into social conservatives, neoconservatives and Old Guard republicans who are war hawks. They actually want war in the middle east because it gives the US an excuse to act interventionist, 'spread democracy' and profit from the military industrial complex.\n\nThe Left is breaking away from Biden precisely because he is soft-balling his response to Israel, not going far enough on student loan forgiveness and failing to follow through on his other promises.\n\nThere is an odd alliance between the isolationist camp of Trump supporters and pro-palestine lefties, but Trump represents a return to the democratic party circa 1992. He's not radical enough for the modern Left and his tycoon capitalist image is what sets off a lot of lefties.", "Liberals who are refusing to vote for Biden because of his initial hesitancy to call for a ceasefire are being illogical. Idealistically I empathize with them and what they are trying to accomplish. But realistically we need to win this election when the opponent would only be worse for the Palestinians. It makes no sense.\n\nIn addition Biden and Kamala has since called for a cease fire, veto’d a no cease fire at the UN, sending aid weekly, building ports in Rafa for continued aid, and have spoken publicly blaming the Bibi government. \n\nYes funds are still going to Israel but we can’t win everything. I’ll take what I can get.  \n\nIt’s time to be a realist. Continue to protest continue to detest I support you. But if you don’t for Biden because of Gaza you aren’t a liberal, you are just a hypocrite who would rather see a terrible person come to power for your own pride.\n\nThoughts?"]}, {"title": "Should natives have expanded rights in government? ", "description": "By this i mean should they get any special representation, voices, higher autonomy, their our autonomous counties or states etc. \n\nAn example of an autonomous county can be like a native land that isn’t within any other county but is within a state. it has its own charter/constitution and leadership and can create laws and ordinances. \n\nspecial representation may be reserved seats in legislatures or resident commisioner positions in state legislatures. \n\nthoughts? ideas? i’ll leave some of mine in the comments.", "time": 1711934341.0, "comments": ["[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*", "From your post and responses, you seem to be grossly misinformed on Native American rights. \n\nFirst, Native tribes are and have always been sovereign nations. US breaking treaties was vile and reprehensible, but it was the time period, it happened between bigger nations too (British Impressment post Revolutionary War was a violation of the Treat of Paris and led directly to the War of 1812). \n\nSecond, under the 14th Amendment and the Indian Voting Rights Act of 1924, Native Americans HAVE had voting rights (became universal due to some state laws in 1957). Being able to vote in State and Federal elections, including legislative elections. \n\nWhile limited, there are 5 members of the House that are Native American (3 GOP, 2 Dem).\n\nThen you gotta figure out how to GET commissioners (if you go that route) are you getting one from each nation? Per X# of nations? 1-2 per State? How do you handle bigger nations stepping on smaller ones?\n\nThen, the House has to deal with more non-voting members when what they need is more VOTING members with smaller districts (which is a whole different discussion, but would get more minority groups represented). Not more special interests groups yammering for limited attention.", "According to most of the treaties in the United States, Native American tribal nations are just that: nations.  They have ceded foreign relations to the United States, but they are not part of the states whose territory borders them, even if it surrounds them.  For instance, Highway Patrol officers do not have jurisdiction to enter tribal lands to make arrests, conduct searches, or serve warrants.  FBI agents have limited jurisdiction, in consultation with tribal authorities.  \n    \nThat said, states often blithely ignore these rules when they think they can get away with it.  For instance, there was an Attorney General in Kansas some time ago that raided stores on reservation land because they supposedly weren't collecting state sales or liquor taxes -- which they aren't obligated to do, of course.  His excuse was that they were accessible from the interstate, which had the right of way leased from the tribe, and therefore through some mental gymnastics were part of Kansas. \n   \nSo, should they have rights in the lands stolen from them and/or ceded to them?  Certainly.  Is it realistic to expect that people with vested interests will grant or respect those rights?  No.", "I am indigenous. Outside of the procedural/statutory ambiguities and mistakes in your post, I want to focus on the fundamentals.\n\nIn my experience, Native Americans want nothing to do with the governments of municipalities and states. This is because our leverage and autonomy is greater from the tribal level. We are \"sovereign\" meaning we supercede the laws and statutes of local, county and state authorities. In general, the federal government does not want conflict with us, although the BIA takes different forms under each POTUS.\n\nAll that to say - going from a councilor position in a tribe to a county commissioner is, effectively, a serious demotion. There is far less leverage to be wielded at that level.\n\nI hope this helps.", "The Nordics have a group called the Sami. They vary a bit between the Norwegians, Swedes, and Finns, but they have their own parliament. They also elect the said parliament proportionally so no gerrymandering and no weird elections, just party X gets Y% of the votes so they get Y% of the seats. They are doing quite well for themselves. They get into arguments at times of course, but are far better off than many indigenous peoples in North America.\n\nI like that idea. \n\nImportantly, they have a general overarching parliament not just one for each reserve or parish. A few hundred or a couple of thousand natives on a reserve is not economically strong or especially interesting. Individual skyscrapers have more people than that. It is hard to build things with economies of scale or to have people interested in running for office or all kinds of logistical things needed in a modern system which brings about the prosperity and effectiveness they provide, even if you use indigenous principles to help bring them about. It can also help to provide a kind of clear voice you can negotiate with. If you tell people in British Columbia that the Wetsuweten elected chiefs agrees to something and the hereditary chiefs do not, what opinion should you have of that split? Is it legitimate to go against the hereditary chiefs to build a pipe? One assembly for indigenous people elected by the widest possible franchise of them by harmonized rules makes it much easier to understand in your head and avoid divide and conquer.", "They should 100% have their own elected officials in office but whether they should sit in the House or Senate would be wrong because the sovereign nations are not American. They do not trust american government because they have broken every single treaty ever signed with them. \n\nThere are Native folks who have run for office in their state or state and won. This is wonderful and should happen more often so we have more diverse representatives for all citizens.", "While I personally think there ought to be some sort of political entity in Washington with some more power for indigenous issues, I can't think of a way to constitutionally do so that is beneficial without encroaching on our currently built systems. Do we create an extra council in Congress to veto bills? If we gave tribal nations more veto power it would just heavily weigh down our current process, and our current process is bogged down as is, so it would more slog things for the rest of us than really empower tribes. \n\nDo we create a cabinet of Indian affairs? We kinda already have that with the Bureau of Indian Affairs and it really doesn't do much. Its also worth noting that most tribes prioritize in getting land rights, not promises that the government can give them. Independent autonomy is often placed of higher importance than participation in the US political system. \n\nOn the flip side of that, tribes have been very active and successful in working with state governments, which arguably progresses at a much faster rate than the federal government. I think its more realistic to lobby state governments for economic relief to improve the conditions of tribes.\n\nTwo ideas for reparations at a state and federal level; the federal government could allocate 1% of military funding to tribal reservations. The idea being that since the military was used for expansionism, a piece of the military has to go back to the descendants of those who were harmed. 1% seems reasonable because that's the percentage amount of indigenous people living in the US today. \n\nRealistically though, I think tribes could successfully lobby their state governments to subsidize remote work salaries (particularly call centers) on tribal lands. That way indigenous citizens don't have to worry about lack of work, it guarantees revenue can be brought to economically deprived areas, companies could pay higher wages thanks to this, and states help alleviate the unemployment problem that has been long lasting in the state. \n\nAnother political empowerment tool is making Oklahoma and New Mexico the first primary states in federal elections. It's largely agreed that Iowa is a bad first state, but most also agree that first states need to be rural, so that there's more reliance on grassroots volunteers rather than whomever can buy the most adspace in the beginning of the election races (Bloomberg would've steamrolled Obama if the first state were New York). Oklahoma, much more diverse than Iowa, has a high native American population with about 10% of the state residents living on tribal lands. In New Mexico, 100,000 Navajos live there. New Mexico also has a high number of Hispanics, which also better represents the country than Iowa or Nevada. \n\nIowa gets a massive amount of sugar subsidies for being the first primary state. Oklahoma and New Mexico are far better reflections of the rest of the country, and indigenous voices would be greatly elevated if they were the first primary states.  This wouldn't even require an act of congress, just a reordering of states by either parties.\n\nEdit: not ministry of Indian affairs, Bureau of Indian Affairs.", "Possibly the worst idea I’ve heard on the sub.  Not only would it be discriminatory but even with their tribal nations the majority of them are governed poorly with rampant corruption.  I don’t see the UK giving priority/disproportionate representation to ethnic picts.  I don’t see the Japanese government giving disproportionate governance to Ainu people.  We have possibly the most spoiled indigenous culture of any nation that partook in colonialism(nearly all of them) and if we keep entertaining delusions of their exceptionalism we end up with more insufferable debates.  The past is the past and the US government has done vastly more then other nations to accommodate the people we conquered.  It’s nearing the point where many non-indigenous family lines have deep cultural and ancestral connections to the land they live on, some whose families have spent more consecutive time on their land(typically rural folks) then any Native American.", "it really depends on how well integrated &amp; accepted Native tribe members are within the larger \"host\" community. If statutes &amp; social impediments were erected to prevent social mobility &amp; intermingling and even marriage, then their communities deserve more autonomy and more funding. But if much of their native people have mixed &amp; moved away from tribal lands representation &amp; even special funding &amp; programs/scholarships/internships may be only benefiting a small pocket or minority, which may be unfair to those of mixed background, or those whose families are not officially on tribal registries.", "Rights in the government of their own reservations, but nothing extra elsewhere.", "So you want positive discrimination, essentially.\n\nThat sounds like a terrible idea.", "It seems to me that EITHER the U.S. should actually treat tribes/nations as independent states with their own borders and sovereignty, OR representation should be equal and the state multicultural.\n\nExpanded rights in government seems like the worst of both worlds, to me; it's anti-democratic but also assimilationist.", "Can you explain what exactly a \"resident commissioner\" is, because you've mentioned it several times.", "I'm their own, yes. Which they already do AFAIK. \n\nHow can land not be within the country but within a state? Every state is part of the country. And state governments don't make treaties with foreign nations.", "&gt; By this i mean should they get any special representation, voices, higher autonomy, their our autonomous counties or states etc. \n\nYou're actually referencing multiple different concepts here.\n\n\"Special representation\" is vague, but any representation that would give them more weight than an American citizen is not going to fly, nor should it in a democracy.\n\n\"Higher autonomy\" could certainly be argued, but specifics are important. They have their own countries. Higher autonomy is certainly something their countries could argue for. But that wouldn't be the same as greater autonomy within the US government, which again, sounds like it would be giving them special privileges or additional rights. There are some few of those that exist, but they're not popular on the whole, and trying to expand that would likely be very harmful.", "Ideally, no general law, and no Constitutional right should address any group of people at all. Rights inhere in all and only individual people. Groups of people have *powers*. Powers can be taken away by the people. Rights can never be taken away, only either recognized or violated.\n\nWhen you write a law or Constitutional Amendment, it should be worded in such a way that it is a contract between the government and the individual person, i.e. without regard to any group they happen to be a member of.\n\nNow I know what you are thinking. The ideal principle leaves us open to the failures of human beings to implement it. That is so true. The ideal situation involves a strong judiciary with high quality appointees that will make equitable decisions that protect the minority from the majority. Currently the only minority being protected is the rich and the property-owning.\n\nBut we should resist the temptation to correct these failing in other ways. Inevitably, a day will come when we want the system to work *in principle*, and it needs to be able to allow the good and the decent to be enabled.", "While I appreciate your use of the word 'should', I immediately consider that: if 'natives' have control of their own government, they have more-or-less whatever rights they see fit to grant themselves, and such a question would read more like: 'should non-natives have diminished rights in government'; alternatively, if they do not, there seems little likelihood of any genuine expansion of their rights. \n\nBy 'a native land that isn’t within any other county but is within a state. it has its own charter/constitution and leadership and can create laws and ordinances', do you refer to what would be termed a 'Bantustan'?", "No. They should actually have absolutely no say in what happens at all, since they fought, and lost. Repeatedly. Them having almost exclusive gambing rights is way more than ample compensation for them. Cant think of another time in history where a nation; got there asses whooped, continued to try to to rebel while not learning any new battle tactics at all, get government gifted land after the fact, n still cry. And they always fail to mention that tribes that supported america during the revolution, are treated like brothers. Bc they cant accept their ancestors were actually really not that clever. Like lol they were scalping each other plus stealing land and goods long before the white man showed up. \n\nEvery time a native cries about stolen land, remind them they are perfectly welcome to try n take it back. LOL", "No. Nobody should have anything “special”. That applies to all ethnicities, groups or religions.", "I’m absolutely for expanded rights. Technically they’re sovereign nations, but the US breaks treaties/rules so often that the status isn’t respected.\n\nI’m an internationalist and generally against the idea of many nations, as I believe nationality is divisive; but I believe at the end of the day they should be given the right of self determination that natives have been denied for so long.", "No. In fact native Americans should be stripped of anything that separates them from every other American citizen. The whole idea of Indian reservations and independent nations rights is a TERRIBLE idea and should never have been granted. When you're conquered your conquered. There should be no special dispensation for history's losers.", "Here are some of my ideas; \n\nThere's a few things i mean by this:\n\n- instead of having reservations as a separate layer of government from the main state→&gt; county→ township/city structure, should they be incorporated parallel to counties. i feel as though the current way they are organized is really weird and complicates things because you can be living on the same tribal land but belong to different counties or even completely different states. this is why i think tribal lands should be entities alongside counties within a single state (not spanning multiple). but they should also have some lore autonomy. I know some lands would be very small and completely fit within a county. but others like Navajoland would be massive.\n\n\n- the other way native civic rights can be expanded is through special representative seats. state legislatures can create special seats within their assemblies or even senate where tribes with significant populations (or even all tribes) can send a representation. or it can be split between regions like all tribes in northern california have one and all tribes in the Sierra Nevada region have another. these representatives can be full voting members, or limited voting members like some commonwealth residents to Congress; they can sit and vote in committees but not the main floor. these seats can be taken from the current existing numbers or be additional seats that are adde (with is better i feel)", "Yes, indigenous peoples should have representation in state and national governments the world over automatically ('natives' as a term has an unfortunate history), otherwise their rights will continue to be ignored, and they will continue to live in horrifying poverty.\n\nEqually, it should be declared by statute that the discovery of remains or other archaeological evidence which pre-dates living indigenous populations does not invalidate their status or have any bearing on land claims or indigenous rights. \n\nThere is a vital part of human arcological history which tribes all over the world feel compelled to cover up lest it be used against them (and they're right, it will).", "I believe that Republicans' view is that they should not, to the point that they believe the Indian Child Welfare Act--which basically makes it marginally harder for state courts to award custody of Native American kids to non-Native American families, due to a long history of Native American families being broken up--is unconstitutional racial discrimination."]}]