[{"title": "Are the anti-Biden Left equivalent to the Never-Trump Right?", "description": "Since the attack on Israel on Oct 7th of last year by Hamas and the forceful response to that terrorism by Israel, many on the Left have protested Biden and those Democrats who support Israel as unacceptable to the point where some say they won't vote for Biden in November. Similarly, in 2016, a group of conservative Republicans didn't like Trump because he didn't uphold conservative values or principles and vowed not to vote for him then and for many, ever again. They became Never-Trumpers. Some even decided to support Biden and left the GOP.\n\nDo you see a similar phenomenon happening to those who decry Biden's support for Israel and pledge not to vote for him for president? Will they become essentially Never-Biden liberals, where a noticeable few defect and even support Trump over Biden, just as some Never-Trumpers did? How would this development upend the presidential contest? What kind of visibility would these defections receive in the media?", "comments": ["[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*", "I think the people who are democrats that are mad at Biden still hate Trump more. At the very best they will still vote Biden and at the very worst they won't vote at all. I don't see many of them actively voting for Trump but I am sure there will be that one person who does but they will be few and far between.", "The Never-Trump Republicans were closer to the middle than Trump's supporters. The Never-Biden Democrats are farther to the left than Biden's base.", "Hell no. The layman’s difference is that the Anti-Biden Left would also never vote for Trump."]}, {"title": "Should natives have expanded rights in government? ", "description": "By this i mean should they get any special representation, voices, higher autonomy, their our autonomous counties or states etc. \n\nAn example of an autonomous county can be like a native land that isn’t within any other county but is within a state. it has its own charter/constitution and leadership and can create laws and ordinances. \n\nspecial representation may be reserved seats in legislatures or resident commisioner positions in state legislatures. \n\nthoughts? ideas? i’ll leave some of mine in the comments.", "comments": ["[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*", "From your post and responses, you seem to be grossly misinformed on Native American rights. \n\nFirst, Native tribes are and have always been sovereign nations. US breaking treaties was vile and reprehensible, but it was the time period, it happened between bigger nations too (British Impressment post Revolutionary War was a violation of the Treat of Paris and led directly to the War of 1812). \n\nSecond, under the 14th Amendment and the Indian Voting Rights Act of 1924, Native Americans HAVE had voting rights (became universal due to some state laws in 1957). Being able to vote in State and Federal elections, including legislative elections. \n\nWhile limited, there are 5 members of the House that are Native American (3 GOP, 2 Dem).\n\nThen you gotta figure out how to GET commissioners (if you go that route) are you getting one from each nation? Per X# of nations? 1-2 per State? How do you handle bigger nations stepping on smaller ones?\n\nThen, the House has to deal with more non-voting members when what they need is more VOTING members with smaller districts (which is a whole different discussion, but would get more minority groups represented). Not more special interests groups yammering for limited attention.", "According to most of the treaties in the United States, Native American tribal nations are just that: nations.  They have ceded foreign relations to the United States, but they are not part of the states whose territory borders them, even if it surrounds them.  For instance, Highway Patrol officers do not have jurisdiction to enter tribal lands to make arrests, conduct searches, or serve warrants.  FBI agents have limited jurisdiction, in consultation with tribal authorities.  \n    \nThat said, states often blithely ignore these rules when they think they can get away with it.  For instance, there was an Attorney General in Kansas some time ago that raided stores on reservation land because they supposedly weren't collecting state sales or liquor taxes -- which they aren't obligated to do, of course.  His excuse was that they were accessible from the interstate, which had the right of way leased from the tribe, and therefore through some mental gymnastics were part of Kansas. \n   \nSo, should they have rights in the lands stolen from them and/or ceded to them?  Certainly.  Is it realistic to expect that people with vested interests will grant or respect those rights?  No.", "I am indigenous. Outside of the procedural/statutory ambiguities and mistakes in your post, I want to focus on the fundamentals.\n\nIn my experience, Native Americans want nothing to do with the governments of municipalities and states. This is because our leverage and autonomy is greater from the tribal level. We are \"sovereign\" meaning we supercede the laws and statutes of local, county and state authorities. In general, the federal government does not want conflict with us, although the BIA takes different forms under each POTUS.\n\nAll that to say - going from a councilor position in a tribe to a county commissioner is, effectively, a serious demotion. There is far less leverage to be wielded at that level.\n\nI hope this helps."]}]