[{"title": "Moving forward on Israel/Palestine posts, and other moderation concerns", "description": "Hi all. Posting this on Sunday night EST so this isn't mistaken for an April Fool's Thing (sorry, GMT folks).\n\nTwo things as we enter Q2 of 2024:\n\n1) **Israel/Palestine**.   Big issues with this topic in particular, and it's a sitewide problem and one that no single sub or mod can possibly fix.  What I can do, for here at least, is make this a place that is safe and free to discuss *without hate speech* and *without violating sitewide rules*.  The latter, we have no choice in.  The former, the level of discourse required by the site is lower than the level of discourse we should be able to expect when talking about such a volatile topic.\n\nI see a few paths forward, and would love anyone's thoughts:\n\na) Maintain the moratorium - if it ain't broke, etc.\n\nb) Strict moderation of the topic - basically what we had before, as much as \"I wonder how long before this gets locked\" became a thing.\n\nc) Stricter moderation on the topic - allow the posts, but be very quick to remove anything inflammatory.\n\nd) A \"megathread\" of sorts of Israel/Palestine reads that is heavily moderated or otherwise doesn't have long back-and-forths.\n\nd) Something else I'm not thinking of.\n\nThere are no good answers here, in part because anti-semites don't care as long as they can boost their hate, anti-Arab/Muslim people don't care as long as they can boost their hate, and a lot of people who aren't outright hateful still repeat the boosted stuff believing incorrectly that it *isn't* hateful.  Like I said, bigger problem than here.\n\nThe only option not on the table is to allow the hate speech to linger.  That's not going to happen.  Anything else, though, I'm all ears.\n\n(Do not debate it here in this post.  If you have to ask if it's hate speech, it's probably hate speech.)\n\n2) **Moderation in General**: Traditionally, the rules on the sidebar have been less hard-and-fast and more \"hard suggestions.\"  The predominant approach over the years was a hands-off one.  Is that still working for people?\n\nThanks for making this place one of the more interesting places on the site.", "time": 1711932620.0, "comments": ["My vote is to maintain the moratorium on this radioactive topic.", "Do you / the mod team have the resources to carefully monitor the Israel / Palestine posts? It really requires intensive moderation (something that is way above what would be reasonable for any other topic), and if you aren't able to provide that extra level of careful, post-by-post / comment-by-comment supervision on it 24/7/365 it is probably better to keep the moratorium in place. It's not exactly as if there's a shortage of places to go over this topic.", "Maintain the moratorium. ", "I think best to maintain the moratorium. I'm very involved and honestly, it's much preferred to have a space free of it.", "I don't post here, regularly.  I just follow the arguments.  But for what it's worth, I say you should maintain the ban.", "moratorium. there are plenty of places on reddit for discussion on the topic. there is no need for this to be one of them"]}, {"title": "Assisted dying advocates are losing their compassion", "description": "", "time": 1711904866.0, "comments": ["\nRemember that TrueReddit is a place to engage in **high-quality and civil discussion**. Posts must meet certain content and title requirements. Additionally, **all posts must contain a submission statement.** See the rules [here](https://old.reddit.com/r/truereddit/about/rules/) or in the sidebar for details. \n\nComments or posts that don't follow the rules may be removed without warning. [Reddit's content policy](https://www.redditinc.com/policies/content-policy) will be strictly enforced, especially regarding hate speech and calls for violence, and may result in a restriction in your participation.\n\nIf an article is paywalled, please ***do not*** request or post its contents. Use [archive.ph](https://archive.ph/) or similar and link to that in the comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TrueReddit) if you have any questions or concerns.*", "Anyone have access to the original article, that this was written in response to? From Matthew Parris in the Times. This response piece isn’t gated but that one is.", "Submission statement: Over the last few years many disability advocates and social historians have claimed that there is an ongoing shift in the language used by society to talk about the disabled as assisted dying has grown in legitimacy. It seems, that in the same way that the public of the 1920s were told by the press of the day to embrace euthanasia as a way of dealing with the tens of thousands of people burdened with post-Spanish flu viral sequelae like epilepsy, parkinsons and encephalitis, the public of the 2020s are messaged by the press of today that assisted dying is good, the disabled are faking it and long covid doesn't real.\n\nThis article examines a recent instance of this pro-eugenics astroturfing showing up in the biggest non-tabloid UK newpaper, The Times.", "It is interesting to observe the vehemence in some quarters to even the suggestion that it would be sufficient to make the various accoutrements sufficient to end one's life readily available along with instructions for their use. For a hard core, nothing short of death-by-doctor is acceptable. \n\nThey like to play on such words as 'dignity', and take issue with the fact that the few persons incapable of killing themselves in any way are also incapable of feeding themselves; but they cannot point out how dying of a drug overdose - as any washed-up primadonna in a motel room might do - is 'dignified', but death by starvation - as famously achieved by Bobby Sands, is 'undignified', and grossly so.\n\nNow I think this is all rather interesting. Something crucial to this drive for the 'good death' - euthanasia - lies, not in the ready availability of suicide technics, or exculpation for the mailman who delivers you them, but in a member of the medical profession administering death by needle-point (not gunpoint; they do not like my alternative of a member of the armed forces, our paid experts in such matters, coming round to do the deed - the medical profession must be besmirched).\n\nIf I were of a conspiratorial bent, I would make hay; I must simply content myself with pointing out a peculiarity of personality among the set angling for 'assistance in dying'."]}, {"title": "The quiet disappearance of the safe deposit box", "description": "", "time": 1711917589.0, "comments": ["\nRemember that TrueReddit is a place to engage in **high-quality and civil discussion**. Posts must meet certain content and title requirements. Additionally, **all posts must contain a submission statement.** See the rules [here](https://old.reddit.com/r/truereddit/about/rules/) or in the sidebar for details. \n\nComments or posts that don't follow the rules may be removed without warning. [Reddit's content policy](https://www.redditinc.com/policies/content-policy) will be strictly enforced, especially regarding hate speech and calls for violence, and may result in a restriction in your participation.\n\nIf an article is paywalled, please ***do not*** request or post its contents. Use [archive.ph](https://archive.ph/) or similar and link to that in the comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TrueReddit) if you have any questions or concerns.*", "Submission Statement: While not as topical as many stories posted to the sub, I found this piece drew me in. It started when a friend ranted about not being able to find a safe-deposit box. The reason for my friend's distress seems to be long-term economic trends.", "I have one across the state. I tried last year to get it transferred, but the guy at Chase was like, \"We can close this, but you probably won't find another branch that will have one for you,\" and sure enough, I guess I'll be keeping that one then.", "For those that haven't dealt with boxes from an operations perspective they are horrible. They aren't worth the headache for the $60-$100 a year we charge the customers. Too much room for error and too many regulations. The risk is huge. If we could charge $300 to $500 per year it would totally be worth it but no one wants to pay that much.", "there's been a couple high-profile cases of the police seizing them based off of dubious information and having absolutely zero recourse for the people that were wrongly divested of their belongings.", "The feds did a raid on boxes at us vaults in California because the owners were laundering money and rented to drug dealers.    All the regular people had their goods sized due to civil asset forfeiture.    I closed my box as soon as they did this.\n\nEdit spelling", "They were never safe anyways. ", "For 350-500 you can get a slim 10-12 gun safe that you store in your own home. You can even bolt it to your wall studs. Why get a safety deposit box?", "I still have one and I store cash in it. I should buy a gun safe and move it to my house", "An alternative is buying a gun safe. Most quality safes offer fire protection, and i know many people who store their valuables in them. They are pricier up front and, depending on the size, can be cumbersome, but they are effective. I only scanned the article, so forgive me if this was mentioned.", "People buy safes now to keep at home.", "&gt;These vaults are made with heavy concrete and layers of reinforced steel, and they are built to withstand the unimaginable\n\n&gt;Between 2017 and 2021 alone, the number of bank branches in the US fell by 9%. With big banks focusing on fewer — and smaller — physical locations, safe deposit boxes were among the first to go. \n\nOk, so banks are abandoning their safe deposit boxes and branch locations, but they aren't likely destroying the vault, are they? That seems pretty expensive as well.  \n\nHow are these rooms being reused? Are they being reused? Has this already been a plot point on a crime procedural - e.g., serial killer using former/abandoned safety deposit box room as his killing room?"]}, {"title": "Amateur diver 'true crime junkies' have found 11 bodies, 350 sunken cars in Florida", "description": "", "time": 1711907728.0, "comments": ["\nRemember that TrueReddit is a place to engage in **high-quality and civil discussion**. Posts must meet certain content and title requirements. Additionally, **all posts must contain a submission statement.** See the rules [here](https://old.reddit.com/r/truereddit/about/rules/) or in the sidebar for details. \n\nComments or posts that don't follow the rules may be removed without warning. [Reddit's content policy](https://www.redditinc.com/policies/content-policy) will be strictly enforced, especially regarding hate speech and calls for violence, and may result in a restriction in your participation.\n\nIf an article is paywalled, please ***do not*** request or post its contents. Use [archive.ph](https://archive.ph/) or similar and link to that in the comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TrueReddit) if you have any questions or concerns.*", "Doing ~~God’s~~ Police work. If two guy can do this why isn’t it a unit of 2 police divers on the payroll to do this yearly?", "In the last two years, the half-brother owners of Sunshine State Sonar have found more than 350 cars in canals, ponds and waterways across Florida. They have discovered remains of 11 missing people inside cars, giving answers to relatives who had spent years agonizing over the mysteries of their loved ones' disappearances.\n\nThese weekend fishermen turned amateur underwater detectives were regular true-crime junkies, but now they  dive into cold cases, searching for the disappeared. They choose the cases themselves, following threads online (INCLUDING REDDIT). Other times, law enforcement asks for their help.\n\nPretty cool story about why and how they do it.", "Suprised no one linked the [Sunshine State Sonar](https://youtube.com/@Sunshinestatesonar?si=fFmAJ3aY4aGmnE1z) YouTube channel.\n\n\nIf their making $100/mo on YouTube per [this post](https://www.reddit.com/r/TrueReddit/comments/1bsgfpg/comment/kxg0ti4/?utm_source=share&amp;utm_medium=mweb3x&amp;utm_name=mweb3xcss&amp;utm_term=1&amp;utm_content=share_button). Probably needs to get more views so they can do this more.", "Just wait until they start searching the sinkholes.", "I've seen one of the divers YouTube channels. A lot of these cars seem to be missing in the 80s and 90s when they didn't have the underwater scanner technology available.", "Why isn't this a reality show? ", "I swear the world would be a better place if we just hired and paid the right people to do the job. Most of our problems are because people are too stuck up or not brave enough to hire a man like this. Crazy or not, the man is dedicated", "These guys are doing good work.", "The first thing I thought of was, “When will this become a show?” And “how do I watch?”", "I guarantee the police absolutely hate this person.  If they are never found you don't have to do any paperwork.", "Police don’t solve crimes.", "Plot twist** They put them there! Lol", "Only Murders in the Bayou", "This would never happen if they would just ban more books.\n\nBan all the books!", "Heros right here!", "Is there a show about this yet?", "  *  read  later", "Why do floridians pay taxes to the FDLE then?! Shouldn't they be doing this? I'm sure FDLE wastes enough taxpayer $$ on OT.", "Damn, Brenda Starr went missing."]}, {"title": "A Ghost Ship’s Doomed Journey Through the Gate of Tears", "description": "", "time": 1711976555.0, "comments": ["\nRemember that TrueReddit is a place to engage in **high-quality and civil discussion**. Posts must meet certain content and title requirements. Additionally, **all posts must contain a submission statement.** See the rules [here](https://old.reddit.com/r/truereddit/about/rules/) or in the sidebar for details. \n\nComments or posts that don't follow the rules may be removed without warning. [Reddit's content policy](https://www.redditinc.com/policies/content-policy) will be strictly enforced, especially regarding hate speech and calls for violence, and may result in a restriction in your participation.\n\nIf an article is paywalled, please ***do not*** request or post its contents. Use [archive.ph](https://archive.ph/) or similar and link to that in the comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TrueReddit) if you have any questions or concerns.*"]}]