[{"title": "CMV: Feral and outdoor cats should be viewed and treated as an invasive species and treated accordingly.", "description": "Cats are shown to kill billions of birds each year in the United States alone every year, and that doesn't even consider insects, reptiles and small mammals they kill. Cats are highly efficient predators and leaving them to roam the environment is a massive strain on ecosystems that are already struggling from other human factors. These populations of feral cats need to be reduced if we want to reduce the decline of important native fauna just as we would any other invasive species be it by trap and adopt, trap and euthanize or euthanized in place.  ", "time": 1711901608.0, "sentiment_scores": {"neg": 0.145, "neu": 0.769, "pos": 0.086, "compound": -0.9983}}, {"title": "CMV: The Gaza Health Ministry Talley is Wrong, but in Ways Both Sides Find Awkward", "description": "A lot of discussion about the current war in Gaza centers around the death toll with the most bandied about numbers being the Talley kept by the Gaza Ministry of Health. It claims the vast majority of deaths in the conflict are civilians, and is frequently used to justify claims of genocide against Israel. The current number stands at around 32k Dead, of whom half are minors. \n\nHere's the thing, the number is wrong. I think people directly quoting the number are making a mistake. It's wrong. It's obviously wrong. But, the specific way it's wrong is awkward for everyone. \n\nThe reason why is this. The GMH Talley is accurately tracking confirmed deaths. Most of the people on the list (there's an actual list of names) are dead. It's just undercounting the actual death toll.\n\nIt's awkward for Hamas because: \n\nHamas and \"resistance\" deaths are not being accurately tracked in the page. The list is exclusively composed of people reported to the ministry or who ended up in the hospital. There's basically no evidence Hamas/PIJ is telling the GHM accurate casualty tallies. \n\nSoldier/terrorists lost behind the lines, killed in airstrikes, buried in collapsed tunnels, are not being added to the list. The 7-8k Missing category that the GHM mentions is probably disproportionately fighting age males. \n\nOne of the clearest indicators of this is the fact that terrorists killed during the Oct. 7 offensive do not seem to show up on the list. We know that between 500 and 2000 fighters died in \"67 Israel\" during the offensive, but the early list didn't \"jump\" at the start with fight-age male losses. \n\nThe incentive for \"the Resistance\" is obvious. They plan to claim victory/they fought off Israel after the war ends. It's the same reason they publish their absurdly fake Talley of Israeli casualties and the videos of RPG ambushes that don't show impact. They can't honestly admit to the Palastinian people that 2/3rds of their battalions have been smashed. \n\nIt's awkward for Israel because:\n\nIsrael actually has killed an absolute fuck ton of civilians. The ratio isn't quite as lopsided as the GMH Talley suggests. But 12k dead Palastinian children is a lot. The evidence that they've killed so many people is extremely well documented and the attempts to deny it or claim it's staged are really emberassing lies. \n\nThe thing is, Israel is probably aware of this. They do go around claiming the GMH is false, but they can't actually admit that the real reason why is that it's just incomplete. \n\nTechnically speaking, if Israel actually has killed 10k-15k resistance fighters and 25k-30k civilians, this isn't a *good* Soldier-Civilian death ratio. The US broadly achieved 2:1 in the seige of Mosul, so Israel with 1:1.5 - 1:3 still raises a bunch of uncomfortable questions. But, the fact they can't admit this leaves them open to the GMH charge of something ludicrous like 1:6 or worse. A 1:2 ratio is an exceedingly bloody war, but within defensible bounds. A 1:6 ratio is a much more credible genocide allegation. \n\nConclusion:\n\nWe're left with the Gaza Ministry number because it's the only Talley of the dead that's detailed and data driven. It's not a lie, but it should not be taken as a representative. It's still useful as an absolute floor of deaths. Still, I don't think people should be using it to actually discuss the death ratio in Gaza.", "time": 1711932842.0, "sentiment_scores": {"neg": 0.184, "neu": 0.738, "pos": 0.078, "compound": -1.0}}, {"title": "CMV: The UK has more in common with Northern Europe than Western Europe", "description": "It seems common to consider the UK as a Western European country in line with France, Germany etc, however I would argue that when it comes to classification, the UK should be considered with the same mindset as Northern European (ie the Nordics, the Baltics and possibly the Netherlands and Ireland). This is in part a geographical consideration, however I recognise the distinction between Northern, Western and Eastern Europe in that sense is fairly arbitrary. Instead, I would argue that the relation exists on wider levels of culture, economics and politics, such that in general it should be natural to consistently refer to this as a distinct group with the UK included. This BBC article (https://www.bbc.co.uk/news/education-35374822) does a good job at listing a number of these points, but to give a broad overview of my thinking:\n\nPolitically:\n- They are joined together in multiple political organisations built around this grouping, such as the Northern Futures Forum and the Joint Expeditionary Force\n- They tend have a relative history of Euroscepticism, or otherwise being distinct from the rest of the EU/not in it at all\n- Almost all of them operate using some variation of a Parliamentary system\n\nEconomically:\n- Their economic systems are all far more oriented towards knowledge and innovation than the rest of Europe\n- Their government services tend to operate in similar ways, such as in single payer models of healthcare and in spending on welfare services\n- They all tend to contribute large proportions of their income on foreign aid relative to other nations\n\nCulturally:\n- They all tend to be far more socially liberal than the rest of the world in outlook\n- A much greater emphasis is placed in their societies on speaking good English\n- In general, their culture tends to be very similar to the UK in humour, personality etc\n\nIf you want to go further, you could even point out things like the UK flag looking similar to the Nordic ones and many of them having royal families!\n\nAs far as I can see, the only major exceptions to this lie in size (economically and in terms of population, the UK is more similar to Germany, France and Italy), and history, with the UK having a far more significant global role. However, given the number of above similarities these factors don’t seem to be playing an enormous role overall.\n\nHence, I would argue that the UK is a Northern European country, not a Western European country. I am intrigued to here arguments to the contrary however!\n", "time": 1711926026.0, "sentiment_scores": {"neg": 0.017, "neu": 0.9, "pos": 0.083, "compound": 0.9942}}, {"title": "CMV: The only solution to Israel-Palestine would be the extremely drastic measure of putting it all under a foreign ruled government ", "description": "Any long lasting peace requires both sides being willing to stick to the agreements of the peace. \n\nI don't think either side is willing. On Israel's side you have settlements and repeated genocidal rethoric by officials in the government. On Palestine's side it is clear that the Palestinians are not willing to accept anything less than a total destruction of Israel.\n\nThis is the core of why most purported solutions are bound to fail:\n\n1 state: Jews in Israel are reasonable to fear what would happen with an Arab majority. \n\n2 states: the Palestinians won't accept Israel existing. Israel would also be unwilling to repatriate 700.000 settlers. \n\nSo here's what I propose: delete the whole thing. Make a state called \"the Levant\", make it so that all powers can only be held by foreigners, that no Jew, Arab or Muslim can ever be elected there.\n", "time": 1711981147.0, "sentiment_scores": {"neg": 0.135, "neu": 0.76, "pos": 0.105, "compound": -0.9983}}, {"title": "CMV: Buying solar rarely pays for itself and if it does end up being a benefit, it’s much further out than most people realize. ", "description": "Some basic points:\n1. Solar is good for the environment and people should do it.\n\n2. Solar is a good hedge against rising energy costs. It’s great peace of mind knowing that you’re locked in. \n\n3. Solar + house battery is great for blackouts and inconvenient power outages. Do it if you can!!\n\n4. For this argument I’m assuming normal family suburban homes. Not some giant compound that uses extreme amounts of energy. I understand that those may have nearer term break even points. \n\n\nMy point: When people make the case that solar “saves them money”. They do overly basic math. \n\nExample: I spent $20k on the system. My bill used to be $100/mo and now it’s $0/mo. So I break even 200 months aka 16 years. \n\nWhat I feel like is unfairly left out of the equation is the opportunity cost of the $20k. I think it’s fair to debate where that money would have been otherwise (I.e. not in solar panels), but for debate I think it’s fair to assume that money would be in the S&amp;P500 or VTSAX or equivalent.  When you do this math, you’re very unlikely to ever break even or if you do it’s 40+ years out. And that’s before taking into account repair costs while you’re out of warranty. \n\nWould love your thoughts!\n\nEdit: I think some people have shown that their systems, have had relative short payoffs. While also factoring in opportunity cost. I have no way to validate the prices they claim or their savings on electricity but it seems like for some there’s a solid case to be made. Thanks!!\n\nYou should still be factoring in opportunity cost when you evaluate your system from a financial standpoint. And you should probably get solar + battery regardless, because it’s great for the environment and excellent peace of mind. ", "time": 1711908931.0, "sentiment_scores": {"neg": 0.049, "neu": 0.835, "pos": 0.116, "compound": 1.0}}, {"title": "CMV: If you don't like the fan content being made, either make your own or shut up.", "description": "As a Warhammer 40k fan, I occasionally see fanart people make (as someone does). This includes things that some people might not like very much, Space Marine maids, skitarii femboys, Femmarines. I personally don't have a problem with any of these, but I always see people who do. They complain about it, call it heresy (though this one can also be a joke), say \"this is why we need to gatekeep the fandom\", or any number of other things. It drives me nuts. You're welcome to not like something. But fan artists aren't beholden to you or anyone. If you don't like the content other fans are making, then make your own content. You're a fan and have as much right to do so as they do. It doesn't matter if its good or not. It's better to light one candle than to whine about the darkness.", "time": 1711967949.0, "sentiment_scores": {"neg": 0.113, "neu": 0.71, "pos": 0.177, "compound": 0.999}}, {"title": "CMV: Some dialects are better than others", "description": "[deleted]", "time": 1711948159.0, "sentiment_scores": {"neg": 0.044, "neu": 0.811, "pos": 0.146, "compound": 0.9997}}, {"title": "CMV: Despite denying it, the US government started the crack epidemic.", "description": "[deleted]", "time": 1711981802.0, "sentiment_scores": {"neg": 0.14, "neu": 0.747, "pos": 0.114, "compound": -0.9978}}, {"title": "CMV: All men are depraved", "description": "[deleted]", "time": 1711939356.0, "sentiment_scores": {"neg": 0.143, "neu": 0.723, "pos": 0.134, "compound": -0.9996}}, {"title": "Cmv: it’s not accurate to say men don’t get compliments.  ", "description": "\nI see the opposite. I see various groups of men complimenting each other all the time.\n\nSkateboarder: sick board. Gym bros: nice biceps. Country guys: damn thats a nice truck. Hood guys: fresh kicks. Like, yeah guys get compliments. And this is biased but the 4 guys Ive been in a relationship with, don’t really care that I compliment them. One was flattered and humbled at first, but then he stopped caring pretty fast. The others never seemed to care in general. Do you suppose this is a generational thing? ", "time": 1711947149.0, "sentiment_scores": {"neg": 0.083, "neu": 0.683, "pos": 0.234, "compound": 0.9998}}, {"title": "Cmv: Prioritizing Child Well-being: Pre-Parenting Evaluations Needed!", "description": "[removed]", "time": 1711977074.0, "sentiment_scores": {"neg": 0.112, "neu": 0.751, "pos": 0.138, "compound": 0.9952}}, {"title": "CMV: a completely fair world would actually suck", "description": "[removed]", "time": 1711905888.0, "sentiment_scores": {"neg": 0.132, "neu": 0.69, "pos": 0.178, "compound": 0.9992}}, {"title": "Meta: Research Participation Opportunity", "description": "From time to time, CMV will partner with researchers and provide access to the community to assist in research projects.  See below for a message from u/homemadefalafel at Maastricht University about their research and how you can participate.\n\nAs always, participation is entirely voluntary.  Please reach out to u/homemadefalafel with any questions, concerns, or if you'd like to participate (I won't be monitoring replies in this thread and I don't have specific answers anyway - PMing u/homemadefalafel is your best bet if want more info).\n\n-----\n\nI am a Master’s student writing my thesis on the quality of the digital public sphere!\n\nReddit and other social platforms are spaces for people to freely exchange their views. But they come with their fair share of challenges, both social (e.g. opinion diversity, in-group bias, fear of isolation, political correctness) and technological (e.g. algorithmic design, platform affordances).\n\nWhat contributes to healthy discussion? What threatens it? And what factors ensure a space where people can communicate well?\n\n⭐This is where YOU SHINE. Whether you are a frequent contributor or just an observer, your insights, and experiences are invaluable. Think about patterns you have noticed on this subreddit, what enhances or hinders discussions, the different types of commenters, etc. ⭐\n\n🚨If you are keen to share your experience and expertise, PLEASE feel free to PM me - u/homemadefalafel 🚨\n\n**Privacy Note**: Your anonymity is a priority and you can opt out of the study at any time.\n\nBest, \n\nu/homemadefalafel", "time": 1711910440.0, "sentiment_scores": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, {"title": "CMV: The counter jihad activists such as Robert Spencer aren't saying anything incorrect about the religious motives of Islamic militants", "description": "Looking at what they speak about, [here](https://www.tfp.org/interview-with-robert-spencer-explaining-the-islamist-threat/) is an example. I am not seeing anything laid out and/or written here that is incorrect about the Islamic texts, what they teach about non Muslims and the extent to which ISIS, the Taliban, Boko Haram, Hamas, Hezbollah and other militants draw inspiration from.  Now to clarify, this is not in any way a statement saying this is the sole correct interpretation of Islamic texts or for that matter what the majority of Muslims living day to day lives believe is the correct way to interpret them.  Just that Spencer and others are saying there are commands there and that when they say that, it isn't in and of itself wrong.", "time": 1711982785.0, "sentiment_scores": {"neg": 0.135, "neu": 0.755, "pos": 0.11, "compound": -0.9972}}, {"title": "CMV: Maximising profit is more often than not unsustainable and not in the shareholders' interest.", "description": "I am talking about this from a purely shareholder and company earnings viewpoint, regardless of it's morality and popularity, as it seems like that's the way these companies think anyway.\n\nWhat I mean by maximising profit is the way companies try to introduce unnecessary additional pricing, or reduction in quality to barrel-scrape the most profit.\n\nadditional pricing are value added \"features\" in their products that are either not related to improvement in quality or for things that should've been there in the first place, e.g. microtransactions in single player games, subscription for carplay/android auto in cars.\n\nreduction in quality, think Boeing.\n\nI would argue that for the most part, unpopular profit maximising strategies is not a good way to increase shareholder value in the long run. At most, the extra profit or share value gained are short term and a money grab for the current C-suite lineup. This is because the unpopular decisions they make is likely to catch up to them in the long run.\n\nBoeing's shares are only half from peak, and even if we could reasonably expect it to bounce back in the future, it creates uncertainty, insolvency, and lost interest for shareholders at the very least.\n\nFrom what I can tell, even if these strategies work most times (people don't know or eventually don't care, and media scrutiny dies down), they need to be lucky every time for it to translate to long term shareholder value. Only one truely unpopular/illegal practice might bring the whole operation down.\n\nOf course, some companies have made an art of anti-consumer practises like Apple, and with it enormous profits, but most companies aren't Apple.\n\nEdit: It seems like many people here are scrutinizing my semantics. I am not arguing against effective profit maximisation. What I'm arguing against is the thought process behind anti-consumer and blatant price gouging under the guise of \"profit maximisation for the good of shareholders\" that seems to be on the rise lately.", "time": 1711957155.0, "sentiment_scores": {"neg": 0.082, "neu": 0.703, "pos": 0.215, "compound": 0.9999}}, {"title": "Cmv: Internet piracy is a crime and must be punished by law.", "description": "Criminals justify any crime they commit or want to commit. \nBe it corruption, rape, murder, robbery, etc.\nBut justifying a crime does not change the fact that it is a crime.\n\nDigital piracy is a crime not because a person takes something without paying for it, no. This is a crime because a person takes something from someone without permission. This is the same reason why we consider slavery a crime, but voluntarism does not.\n\nIn general, people need to be taught from childhood that they cannot take someone else’s thing without the owner’s permission. Let's say on the street I find the latest model gaming console, say Playstation 5. It can be any thing, clothes, car and money. \nOf course I can take it, and of course there are many people who will not feel guilty or ashamed for this, unfortunately. And of course, if the police don’t catch me, I will be clean before the law despite the crime I committed. \n\nOf course, I agree that there is no need to go to extremes and cut off someone’s hand or head for stealing a piece of bread, but why it was impossible to ask for permission and help, that’s what surprises me.\nBut my mother taught me that you should never take someone else’s thing without permission, and especially against his will. And I think this is the best way to live. After all, the best life is a life without the oppression of guilt, shame and regret.", "time": 1711957452.0, "sentiment_scores": {"neg": 0.156, "neu": 0.733, "pos": 0.111, "compound": -0.9999}}, {"title": "CMV: Retirement age for men should be 4-5 years lower than for women", "description": "[removed]", "time": 1711983697.0, "sentiment_scores": {"neg": 0.104, "neu": 0.787, "pos": 0.11, "compound": 0.9083}}, {"title": "CMV: Judging people’s character isn’t reasonable or fair because they have no control over it", "description": "Sorry in advance if this has been posted before or is a hackneyed thought (eg we’re living in a simulation and nothing matters). I believe a person’s character is defined by their thoughts, urges, and actions, which in turn is just a product of two things: brain chemistry and external stimuli. Upon receiving an external stimulus (which could be outwardly physical like the five senses or mental like a thought or emotion), the brain produces an output, like a thought, urge, or action, and then rewires itself based on the perceived reward (how good/bad something feels, also based on neurochemistry). As a person grows, this brain chemistry and input-output relationship becomes progressively built upon and defines what a person will do, think, or feel at any given moment. The state a person ends up in is thus defined by their starting brain chemistry, the method of rewiring, (both genetic/nature) and the environment they are in (circumstantial/nurture). This is just my understanding from my limited knowledge of how the brain learns, with some concepts from reinforcement learning thrown in—very open to believing this could be wrong. But in this framework there is only the illusion of control and not control itself.\n\nFor example, imagine you had infinite computing power and some incredible simulation tools that could create a computational learning agent that would interact with a dynamic world around it. You initialize like a thousand of these agents by putting them in different environments with different starting variables, and let them loose and observe (to be fair this is almost already a reality!) The programmers/observers would likely say that any behavior is not under any moral guidelines, and understand that an agent’s output and action are just a product of the code/math, randomness, and the environment. To me, our DNA operates extremely similarly, with a similar conclusion to be drawn about our behavior. If a person commits first degree murder or another heinous crime, they had no control over whether they would have the thoughts to commit the crime, or whether they lacked the neural guardrails to prevent them from doing it. Less drastically, many don’t view addiction as a moral failure, because it’s just brain chemistry—some are inevitably more susceptible than others. Likewise if someone is “morally good” it can be argued that they were just lucky that the product of their brain chemistry and environment aligned with societal values.\n\nThings and actions can still be judged good or bad, but they are evaluated in the context of whether they help you or not and not in the context of mortality. Therefore someone who is selfless, kind, and honest is considered good because they are less likely to harm you, while those who take pleasure in hurting others, lying, and death are more likely to harm you and are therefore bad. When expanded to the societal level, this creates cultural and social norms and laws, which are just a product of the people living in it (what people view as good and bad based on that brain chemistry) rather than some moral absolute. People are punished not because it’s fair or moral, but because of power from collective interest.\n\nSo in practice, I understand that this shouldn’t change most of how we live our lives—we still undeniably have the illusion of choice, and shouldn’t just let go of all accountability of ourselves. People should still be punished, and order should still be held. However, if we want to “rationally” maintain some construct of fairness, rather than viewing some people as good or bad, lesser or more, based on their character (those thoughts, urges, and actions), we have empathy by realizing everyone just is a person and a product of things out of their control. Rather than demonizing “evil” and casting them aside with 0 remorse, it’s something we look at with pity in that they were dealt a life of pain and suffering, both in what they received and caused. It’s reasonable to think “I would rather have this person on this earth than that person to live with for a happier life” but unreasonable to think “I am better than this person because if I were in their exact circumstance and had their same experience I would pick the more socially acceptable option” because according to this model, you really wouldn’t. It’s basically impossible to put yourself in someone else’s shoes as an exercise to think that that person should have taken a different action. Likewise, for people that are a stereotypical “saint,” that is the hand they were dealt. \n\nVery interested in hearing counterpoints from the scientific and philosophical angle, as admittedly it’s the best model of humanity that I can think of (and I’m not a philosopher so I probably can’t think of a lot). Also admittedly, this probably does sound like a big religion influenced-“everyone deserves love” idea, which I’m sure has some criticism. Thanks everyone!\n\nEDIT: Thank you everyone for your responses. In doing so I think I may have made an error in how I phrased the topic statement—my premises are the same though. To avoid replying in a very long post to everyone interested in discussing, I’ll reframe here:\n\nPremise 1: The universe (and therefore human life)is predetermined. If we scientifically and mathematically proved today that the universe was predetermined, I would say this finding would be unsurprising as it is the most likely conclusion based on what we know of the universe already. To change my view, this probably requires some sort of scientific argument.\n\nPremise 2: Knowing this is the way of the world will not change your life in any way, nor our legal or societal structure. You cannot effectively use the fact that the universe is predetermined to justify any decision that you’re making. You still feel the same emotions, feel the same quality of unfairness and what is reasonable—whether they are predetermined or not doesn’t matter in how you live your life. To change my view, this requires you to accept the hypothetical that we found out that the universe is predetermined and nothing else, and that in some way, life for you is now a completely different paradigm to what you were doing before. To me, the experience is the same—you can’t actually do anything with it because you can just as easily say “I was fated to do this” and do it as you can say “I was fated not to do this” and do the other thing. For all intents and purposes you still have to live like you have choices, things can still be reasonable, and things can still seem fair.\n\nPremise 3: Assuming you accepted the first two premises, I would argue that hatred/idolization of people are not a rational way to think about people—ie the premise of this person is just inherently bad or evil or good doesn’t make any sense. Of course people can still feel them because they are biologically driven, like lust or excitement, but when I step back and reason about it, there is no logical argument for why you could sustain hatred/disgust for another person. The only thing that pops out is that some people are more beneficial/more disadvantageous to your experience than others. You can still have enemies and people that are antithetical to your experience, but at the end of the day they are only doing what they think is right just as you are—in another set of initialization variables, you would have done the same thing as your enemy. Everyone is just moving forward the way and doing what they believe to be best in the way that their biological code dictates. True good and evil no longer exist—just human suffering and the absence of it. To change my view, one probably has to accept that the first two premises are true, and argue that it is still reasonable to hate someone, or think that people are still inherently evil in a way that is separate from believing they are just more dangerous to you and society.", "time": 1711947340.0, "sentiment_scores": {"neg": 0.107, "neu": 0.765, "pos": 0.128, "compound": 0.9959}}, {"title": "META: Bi-Monthly Feedback Thread", "description": "As part of our commitment to improving CMV and ensuring it meets the needs of our community, we have bi-monthly feedback threads.  While you are always welcome to visit r/ideasforcmv to give us feedback anytime, these threads will hopefully also help solicit more ways for us to improve the sub.\n\nPlease feel free to share any \\*\\*constructive\\*\\* feedback you have for the sub.  All we ask is that you keep things civil and focus on how to make things better (not just complain about things you dislike).", "time": 1711947656.0, "sentiment_scores": {"neg": 0.101, "neu": 0.775, "pos": 0.125, "compound": 0.9868}}]