[{"title": "Dark Money, GOP Turning New Hampshire into Florida, Texas of the North", "description": "", "sentiment_scores": {"neg": 0.343, "neu": 0.657, "pos": 0.0, "compound": -0.2714}}, {"title": "The climate-denying, Trump loving religious states are getting destroyed by climate change.", "description": "", "sentiment_scores": {"neg": 0.097, "neu": 0.771, "pos": 0.132, "compound": 0.1501}}, {"title": "Texas \"G. O. Pee\" rule: 6 major airlines mandate women age 10-50 must now take airport pregnancy tests to board flights after anti-abortion vigilantes file suits", "description": "", "sentiment_scores": {"neg": 0.212, "neu": 0.707, "pos": 0.081, "compound": -0.6629}}, {"title": "Is climate change actually caused by humans?", "description": "[deleted]", "sentiment_scores": {"neg": 0.1, "neu": 0.829, "pos": 0.071, "compound": -0.8083}}, {"title": "Fractures in the Grand Alliance between Black and Jewish Americans", "description": "[deleted]", "sentiment_scores": {"neg": 0.146, "neu": 0.606, "pos": 0.248, "compound": 0.5534}}, {"title": "Trump Meets Reality", "description": "I will have my satisfaction.", "sentiment_scores": {"neg": 0.184, "neu": 0.711, "pos": 0.105, "compound": -0.7414}}, {"title": "Trump asks hush-money judge to let him keep attacking judge's daughter", "description": "", "sentiment_scores": {"neg": 0.165, "neu": 0.774, "pos": 0.061, "compound": -0.9645}}, {"title": "What trump’s son posted about Biden on Easter vs what Biden actually said on Easter", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.891, "pos": 0.109, "compound": 0.4023}}, {"title": "The anti-abortion movement is losing the battle on IVF. It’s preparing to win the war.", "description": "Anti-abortion advocates worked for five decades to topple Roe v. Wade. They’re now laying the groundwork for a yearslong fight to curb in vitro fertilization.\n\nSince the Alabama Supreme Court ruled last month that frozen embryos are children, the Heritage Foundation and other conservative groups have been strategizing how to convince not just GOP officials but evangelicals broadly that they should have serious moral concerns about fertility treatments like IVF and that access to them should be curtailed.\n\nThey plan to appeal to evangelical denominations and their leaders to take a firm stance that IVF as practiced in the U.S. destroys human life. That, they hope, will reshape how conservative Christians — and in turn, the officials they elect — view the issue, just as it did on abortion. Ultimately, it could lead to laws that create a patchwork of IVF access in the United States, where the procedure is more accessible in liberal states and more limited in conservative ones.\n\nOrganizations including Heritage, former Vice President Mike Pence’s group Advancing American Freedom, and the Southern Baptist Convention’s public advocacy-focused Ethics and Religious Liberty Commission have worked behind the scenes over the last few weeks to distribute talking points, circulate policy recommendations and educate Republican officials and their staff about their ethical concerns with how IVF is commonly practiced in the United States.\n\nThe groups are not advocating banning IVF but want new restrictions that would significantly curtail access to the procedure, such as imposing more regulations on fertility clinics, limiting the number of embryos that can be created or transferred to the uterus at one time, and banning pre-implantation genetic testing, which they argue allows parents to discriminate against their embryos on the basis of sex, disabilities like Down Syndrome or other factors.\n\nAt the same time, they have been having conversations within their conservative Christian circles that have revealed how much work they need to do to convince evangelicals that there are ethical problems with the procedure. Most evangelical denominations have not taken firm stances on restricting fertility services like IVF.", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Trump paid Kim Jong Un $2,000,000 after Kim slowly tortured Otto Warmbier to death.", "description": "", "sentiment_scores": {"neg": 0.19, "neu": 0.639, "pos": 0.171, "compound": -0.6656}}, {"title": "Conservative Oregon County Attempts Criminal Prosecution of Federal Employee", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Team Trump Plots to Send DOJ After New York AG for Letitia James &amp; Other Prosecutors for Election Interference", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Lex Luthor Of The Internet': Meet The Man Keeping Far-Right Websites Alive", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Federal court reinstates lines for South Carolina congressional district despite racial gerrymander ruling", "description": "", "sentiment_scores": {"neg": 0.172, "neu": 0.725, "pos": 0.103, "compound": -0.618}}, {"title": "“Today, we show millions of transgender and nonbinary Americans that we see them, they belong, and they should be treated with dignity and respect.” – President Biden", "description": "", "sentiment_scores": {"neg": 0.08, "neu": 0.664, "pos": 0.255, "compound": 0.8753}}, {"title": "Cesar Chavez’s Family Criticizes R.F.K. Jr. for His Chavez Day Event", "description": "", "sentiment_scores": {"neg": 0.085, "neu": 0.836, "pos": 0.08, "compound": -0.128}}, {"title": "China’s advancing efforts to influence the US election raise alarms", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "WATCH: Trump and GOP attack Biden for recognizing Transgender Day of Visibility on Easter Sunday", "description": "", "sentiment_scores": {"neg": 0.077, "neu": 0.868, "pos": 0.055, "compound": -0.3164}}, {"title": "Cognitive Dissonance", "description": "", "sentiment_scores": {"neg": 0.066, "neu": 0.913, "pos": 0.022, "compound": -0.4515}}, {"title": "Donald Trump did not paid off slain officer's mortgage.", "description": "Apparent source of claim that Trump paid off slain officer's mortgage walks back statement.\n\nRight-wing news outlets and MAGA influencers were quick to jump on rumors that Donald Trump had paid off the mortgage of fallen New York police officer Jonathan Diller, but it appears that's simply not true.\n\nDiller's mortgage was paid off, but it was by an organization called Tunnel to Towers Foundation.\nHas absolutely nothing to do with Donald Trump.\n", "sentiment_scores": {"neg": 0.044, "neu": 0.88, "pos": 0.076, "compound": 0.1769}}, {"title": "Republican admits impeachment probe hasn't found any crime by Joe Biden", "description": "", "sentiment_scores": {"neg": 0.187, "neu": 0.742, "pos": 0.071, "compound": -0.9159}}, {"title": "‘Bullies’: Biden effigy showcases a Johnson County Republican Party shaped by Trump era", "description": "", "sentiment_scores": {"neg": 0.118, "neu": 0.779, "pos": 0.103, "compound": -0.4019}}, {"title": "Undocumented migrants in Texas were 26% less likely to be convicted of homicide than native-born Americans over the last decade", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Congressional Dems Flirt With Heading Off Supreme Court On Mifepristone", "description": "", "sentiment_scores": {"neg": 0.165, "neu": 0.769, "pos": 0.066, "compound": -0.9811}}, {"title": "It must be defeated. Happy Easter", "description": "", "sentiment_scores": {"neg": 0.172, "neu": 0.7, "pos": 0.128, "compound": -0.4574}}, {"title": "Spread the word everone, so no one forgets!", "description": "", "sentiment_scores": {"neg": 0.175, "neu": 0.794, "pos": 0.032, "compound": -0.8442}}, {"title": "Embittered Republicans plot to knock off House GOP’s hard-right leader in Virginia primary feud", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Chinese Accounts Posing as Trump Fans Ahead of Election", "description": "", "sentiment_scores": {"neg": 0.087, "neu": 0.783, "pos": 0.13, "compound": 0.6037}}, {"title": "How Anti-Vaccine Activists and the Far Right are Trying to Build a Parallel Economy", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Exclusive: Trump allies plot anti-racism protections — for white people", "description": "If Donald Trump returns to the White House, close allies want to dramatically change the government's interpretation of Civil Rights-era laws to focus on \"anti-white racism\" rather than discrimination against people of color.\n\nTrump's Justice Department would push to eliminate or upend programs in government and corporate America that are designed to counter racism that has favored whites.\n\nTargets would range from decades-old policies aimed at giving minorities economic opportunities, to more recent programs that began in response to the pandemic and the killing of George Floyd.\n\nLongtime aides and allies preparing for a potential second Trump administration have been laying legal groundwork with a flurry of lawsuits and legal complaints — some of which have been successful.\n\nIn February, America First Legal filed a civil rights complaint against the NFL over its \"Rooney Rule.\"\n\nThe rule — named for Dan Rooney, late owner of the Pittsburgh Steelers — was instituted in 2003 and expanded in 2022. It requires NFL teams to interview at least two minority candidates for vacant general manager, head coach and coordinator positions.\n\nIn 2021, Miller's group successfully sued to block the implementation of a $29 billion pandemic-era program for women- and minority-owned restaurants, saying it discriminated against white-owned businesses.\n\nOther Trump-aligned groups are preparing for a future Trump Justice Department to implement — or challenge — policies on a broader scale.\n\nThe Heritage Foundation's well-funded \"Project 2025\" envisions a second Trump administration ending what it calls \"affirmative discrimination.\"\n\nSuch groups have gained momentum with the Supreme Court's turn to the right — most notably its recent rejection of affirmative action in college admissions. The court ruled that programs designed to benefit people of color and address past injustices discriminate against white and Asian Americans.\n\n", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Average Santa Barbara March rainfall is 2.4\" It got 3.93\" over the weekend.", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "How the Biden operation mobilized right after the Baltimore bridge collapsed - POLITICO", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Barack Obama Tells Voters Why He Picked Joe Biden for VP, and How It Applies Now", "description": "", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}, {"title": "Democrats hope Biden could get a boost from down-ballot races under Wisconsin's new legislative map", "description": "New legislative districts adopted last month erase Republican advantages that gave the GOP dominance of the Wisconsin Assembly even as Democrats won 14 of the past 17 statewide elections. Democrats think they can now compete for a majority, but also that invigorated legislative campaigns can help turn out votes for President Joe Biden and Vice President Kamala Harris in November.\n\nThe Democrats argue there will be renewed personal attention to neighborhoods in small towns, suburbs and rural areas that had been part of GOP-heavy legislative seats but are now in more competitive districts. Those districts were seen as not worth the effort before, when Democrats’ only hope was to stave off veto-proof GOP majorities. Now, they will get more campaign staff and volunteers to drive turnout.\n\nWisconsin is also among a half-dozen battleground states where Democrats are defending Senate seats in hopes of protecting their 51-49 majority. Sen. Tammy Baldwin, running for a third term, is likely to face millionaire businessman Eric Hovde who faces only nominal Republican opposition in the Aug. 13 primary.\n\nBaldwin agrees that she could benefit from “reverse coattails” of legislative races. Previous districts “were so gerrymandered, which meant that there were whole swaths of Wisconsin where there weren’t competitive races,” she said.\n\nOf the Assembly’s 99 seats, about half remain reasonably safe bets for Republicans. Democrats, who now hold 35 seats, have a better shot in 15 new districts. Some of those districts are on the outskirts of the Minnesota Twin Cities metro area in northwest Wisconsin and around Eau Claire to the northeast, both Democratic-leaning areas. Others are in the vote-rich Fox River Valley, including around Green Bay, where Trump plans to headline a rally on Tuesday.\n\nEven if Democrats fall short of the Assembly majority, Wikler figures that more aggressive canvassing for legislative candidates could identify people willing to vote Democratic in top-of-the-ticket races that have been tight in recent years.", "sentiment_scores": {"neg": 0.0, "neu": 0.0, "pos": 0.0, "compound": 0.0}}]