[{"title": "Moving forward on Israel/Palestine posts, and other moderation concerns", "description": "Hi all. Posting this on Sunday night EST so this isn't mistaken for an April Fool's Thing (sorry, GMT folks).\n\nTwo things as we enter Q2 of 2024:\n\n1) **Israel/Palestine**.   Big issues with this topic in particular, and it's a sitewide problem and one that no single sub or mod can possibly fix.  What I can do, for here at least, is make this a place that is safe and free to discuss *without hate speech* and *without violating sitewide rules*.  The latter, we have no choice in.  The former, the level of discourse required by the site is lower than the level of discourse we should be able to expect when talking about such a volatile topic.\n\nI see a few paths forward, and would love anyone's thoughts:\n\na) Maintain the moratorium - if it ain't broke, etc.\n\nb) Strict moderation of the topic - basically what we had before, as much as \"I wonder how long before this gets locked\" became a thing.\n\nc) Stricter moderation on the topic - allow the posts, but be very quick to remove anything inflammatory.\n\nd) A \"megathread\" of sorts of Israel/Palestine reads that is heavily moderated or otherwise doesn't have long back-and-forths.\n\nd) Something else I'm not thinking of.\n\nThere are no good answers here, in part because anti-semites don't care as long as they can boost their hate, anti-Arab/Muslim people don't care as long as they can boost their hate, and a lot of people who aren't outright hateful still repeat the boosted stuff believing incorrectly that it *isn't* hateful.  Like I said, bigger problem than here.\n\nThe only option not on the table is to allow the hate speech to linger.  That's not going to happen.  Anything else, though, I'm all ears.\n\n(Do not debate it here in this post.  If you have to ask if it's hate speech, it's probably hate speech.)\n\n2) **Moderation in General**: Traditionally, the rules on the sidebar have been less hard-and-fast and more \"hard suggestions.\"  The predominant approach over the years was a hands-off one.  Is that still working for people?\n\nThanks for making this place one of the more interesting places on the site.", "time": 1711932620.0, "sentiment_scores": {"neg": 0.039, "neu": 0.875, "pos": 0.086, "compound": 0.679}}, {"title": "Assisted dying advocates are losing their compassion", "description": "", "time": 1711904866.0, "sentiment_scores": {"neg": 0.111, "neu": 0.808, "pos": 0.081, "compound": -0.9771}}, {"title": "The quiet disappearance of the safe deposit box", "description": "", "time": 1711917589.0, "sentiment_scores": {"neg": 0.13, "neu": 0.778, "pos": 0.092, "compound": -0.9826}}, {"title": "Amateur diver 'true crime junkies' have found 11 bodies, 350 sunken cars in Florida", "description": "", "time": 1711907728.0, "sentiment_scores": {"neg": 0.116, "neu": 0.802, "pos": 0.082, "compound": -0.9702}}, {"title": "A Ghost Ship’s Doomed Journey Through the Gate of Tears", "description": "", "time": 1711976555.0, "sentiment_scores": {"neg": 0.076, "neu": 0.84, "pos": 0.084, "compound": -0.2599}}]